RT-Thread/rt-thread/bsp/renesas/ra8d1-vision-board/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8D1BH.h
typedef struct                          /*!< (@ 0x40221000) R_AGTX0 Structure                                          */
{
    union
    {
        __IOM R_AGTX0_AGT32_Type AGT32; /*!< (@ 0x00000000) AGTW (32-bit) peripheral registers                         */
        __IOM R_AGTX0_AGT16_Type AGT16; /*!< (@ 0x00000000) AGT (16-bit) peripheral registers                          */
    };
} R_AGTX0_Type;                         /*!< Size = 20 (0x14)                                                          */

/* =========================================================================================================================== */
/* ================                                         R_DPHYCNT                                         ================ */
/* =========================================================================================================================== */

/**
 * @brief D-PHY Controller Top (R_DPHYCNT)
 */

typedef struct                         /*!< (@ 0x40346C00) R_DPHYCNT Structure                                        */
{
    union
    {
        __IOM uint32_t DPHYREFCR;      /*!< (@ 0x00000000) D-PHY Reference Clock Setting Register                     */

        struct
        {
            __IOM uint32_t RFREQ : 8;  /*!< [7..0] Reference Clock Frequency Setting                                  */
            uint32_t             : 24;
        } DPHYREFCR_b;
    };

    union
    {
        __IOM uint32_t DPHYPLFCR;      /*!< (@ 0x00000004) D-PHY PLL Frequency Control Register                       */

        struct
        {
            __IOM uint32_t IDIV  : 2;  /*!< [1..0] D-PHY PLL Input Frequency Division Ratio Select                    */
            uint32_t             : 6;
            __IOM uint32_t NFMUL : 2;  /*!< [9..8] D-PHY PLL Frequency Multiplication Factor Select (Fractional
                                        *   Part)                                                                     */
            uint32_t            : 6;
            __IOM uint32_t NMUL : 8;   /*!< [23..16] D-PHY PLL Frequency Multiplication Factor Select (Integer
                                        *   Part)                                                                     */
            uint32_t : 8;
        } DPHYPLFCR_b;
    };

    union
    {
        __IOM uint32_t DPHYPLOCR;      /*!< (@ 0x00000008) D-PHY PLL Operation Control Register                       */

        struct
        {
            __IOM uint32_t PLLSTP : 1; /*!< [0..0] D-PHY PLL Operation Control                                        */
            uint32_t              : 31;
        } DPHYPLOCR_b;
    };

    union
    {
        __IOM uint32_t DPHYESCCR;      /*!< (@ 0x0000000C) D-PHY Escape Mode Clock Control Register                   */

        struct
        {
            __IOM uint32_t ESCDIV : 5; /*!< [4..0] Escape Mode Transfer Clock Division Ratio                          */
            uint32_t              : 27;
        } DPHYESCCR_b;
    };

    union
    {
        __IOM uint32_t DPHYPWRCR;      /*!< (@ 0x00000010) D-PHY Power Supplying Control Register                     */

        struct
        {
            __IOM uint32_t PWRSEN : 1; /*!< [0..0] D-PHY Power Supplying Control                                      */
            uint32_t              : 31;
        } DPHYPWRCR_b;
    };
    __IM uint32_t RESERVED[2];

    union
    {
        __IM uint32_t DPHYSFR;         /*!< (@ 0x0000001C) D-PHY Status Flag Register                                 */

        struct
        {
            __IM uint32_t PWRSF : 1;   /*!< [0..0] D-PHY LDO Power-on Status Flag                                     */
            uint32_t            : 7;
            __IM uint32_t PLLSF : 1;   /*!< [8..8] D-PHY PLL Oscillation Stabilization Flag                           */
            uint32_t            : 23;
        } DPHYSFR_b;
    };

    union
    {
        __IOM uint32_t DPHYOCR;        /*!< (@ 0x00000020) D-PHY Operation Control Register                           */

        struct
        {
            __IOM uint32_t DPHYEN : 1; /*!< [0..0] D-PHY Operation Control                                            */
            uint32_t              : 31;
        } DPHYOCR_b;
    };

    union
    {
        __IOM uint32_t DPHYTIM1;       /*!< (@ 0x00000024) D-PHY Timing Control Register 1                            */

        struct
        {
            __IOM uint32_t TINIT : 19; /*!< [18..0] D-PHY T_INIT Parameter Setting                                    */
            uint32_t             : 13;
        } DPHYTIM1_b;
    };

    union
    {
        __IOM uint32_t DPHYTIM2;         /*!< (@ 0x00000028) D-PHY Timing Control Register 2                            */

        struct
        {
            __IOM uint32_t TCLKPREP : 8; /*!< [7..0] D-PHY T_CLK_PREPARE Parameter Setting                              */
            uint32_t                : 24;
        } DPHYTIM2_b;
    };

    union
    {
        __IOM uint32_t DPHYTIM3;        /*!< (@ 0x0000002C) D-PHY Timing Control Register 3                            */

        struct
        {
            __IOM uint32_t THSPREP : 8; /*!< [7..0] D-PHY T_THS_PREPARE Parameter Setting                              */
            uint32_t               : 24;
        } DPHYTIM3_b;
    };

    union
    {
        __IOM uint32_t DPHYTIM4;         /*!< (@ 0x00000030) D-PHY Timing Control Register 4                            */

        struct
        {
            __IOM uint32_t TCLKZERO : 8; /*!< [7..0] D-PHY T_CLK_ZERO Parameter Setting                                 */
            __IOM uint32_t TCLKPRE  : 8; /*!< [15..8] D-PHY T_TCLK_PRE Parameter Setting                                */
            __IOM uint32_t TCLKPOST : 8; /*!< [23..16] D-PHY T_TCLK_POST Parameter Setting                              */
            __IOM uint32_t TCLKTRL  : 8; /*!< [31..24] D-PHY T_TCLK_TRAIL Parameter Setting                             */
        } DPHYTIM4_b;
    };

    union
    {
        __IOM uint32_t DPHYTIM5;        /*!< (@ 0x00000034) D-PHY Timing Control Register 5                            */

        struct
        {
            __IOM uint32_t THSZERO : 8; /*!< [7..0] D-PHY T_THS_ZERO Parameter Setting                                 */
            __IOM uint32_t THSTRL  : 8; /*!< [15..8] D-PHY T_THS_TRAIL Parameter Setting                               */
            __IOM uint32_t THSEXIT : 8; /*!< [23..16] D-PHY T_THS_EXIT Parameter Setting                               */
            uint32_t               : 8;
        } DPHYTIM5_b;
    };

    union
    {
        __IOM uint32_t DPHYTIM6;       /*!< (@ 0x00000038) D-PHY Timing Control Register 6                            */

        struct
        {
            __IOM uint32_t TLPX : 8;   /*!< [7..0] D-PHY T_TLPX Parameter Setting                                     */
            uint32_t            : 24;
        } DPHYTIM6_b;
    };
} R_DPHYCNT_Type;                      /*!< Size = 60 (0x3c)                                                          */

/* =========================================================================================================================== */
/* ================                                         R_DSILINK                                         ================ */
/* =========================================================================================================================== */

/**
 * @brief DSI Link (R_DSILINK)
 */

typedef struct                         /*!< (@ 0x40346000) R_DSILINK Structure                                        */
{
    union
    {
        __IM uint32_t ISR;             /*!< (@ 0x00000000) Interrupt Status Register                                  */

        struct
        {
            __IM uint32_t SQ0  : 1;    /*!< [0..0] Sequence Channel-0 Interrupt Flag                                  */
            uint32_t           : 3;
            __IM uint32_t SQ1  : 1;    /*!< [4..4] Sequence Channel-1 Interrupt Flag                                  */
            uint32_t           : 3;
            __IM uint32_t VM   : 1;    /*!< [8..8] Video Mode Interrupt Flag                                          */
            uint32_t           : 3;
            __IM uint32_t RCV  : 1;    /*!< [12..12] Receive Interrupt Flag                                           */
            uint32_t           : 3;
            __IM uint32_t FERR : 1;    /*!< [16..16] Fatal Error Interrupt Flag                                       */
            uint32_t           : 3;
            __IM uint32_t PPI  : 1;    /*!< [20..20] PPI Interrupt Flag                                               */
            uint32_t           : 11;
        } ISR_b;
    };
    __IM uint32_t RESERVED[3];

    union
    {
        __IM uint32_t LINKSR;          /*!< (@ 0x00000010) Link Status Register                                       */

        struct
        {
            __IM uint32_t SQ0RUN : 1;  /*!< [0..0] Sequence Channel-0 Running Flag                                    */
            uint32_t             : 3;
            __IM uint32_t SQ1RUN : 1;  /*!< [4..4] Sequence Channel-1 Running Flag                                    */
            uint32_t             : 3;
            __IM uint32_t VRUN   : 1;  /*!< [8..8] Video Mode Operation Running Flag                                  */
            uint32_t             : 3;
            __IM uint32_t HSBUSY : 1;  /*!< [12..12] HS Operation Busy Flag                                           */
            __IM uint32_t LPBUSY : 1;  /*!< [13..13] LP Operation Busy Flag                                           */
            uint32_t             : 18;
        } LINKSR_b;
    };
    __IM uint32_t RESERVED1[59];

    union
    {
        __IOM uint32_t TXSETR;          /*!< (@ 0x00000100) Transmit Set Register                                      */

        struct
        {
            __IOM uint32_t NUMLANE : 2; /*!< [1..0] Number of Lane                                                     */
            uint32_t               : 6;
            __IOM uint32_t CLEN    : 1; /*!< [8..8] Clock Lane Enable                                                  */
            __IOM uint32_t DLEN    : 1; /*!< [9..9] Data Lane Enable                                                   */
            uint32_t               : 22;
        } TXSETR_b;
    };

    union
    {
        __IOM uint32_t HSCLKSETR;      /*!< (@ 0x00000104) HS Clock Set Register                                      */

        struct
        {
            __IOM uint32_t HSCLST : 1; /*!< [0..0] HS Clock Start                                                     */
            __IOM uint32_t HSCLMD : 1; /*!< [1..1] HS Clock Running Mode                                              */
            uint32_t              : 30;
        } HSCLKSETR_b;
    };

    union
    {
        __IOM uint32_t ULPSSETR;       /*!< (@ 0x00000108) ULPS Set Register                                          */

        struct
        {
            __IOM uint32_t WKUP : 8;   /*!< [7..0] ULPS Wakeup Period                                                 */
            uint32_t            : 24;
        } ULPSSETR_b;
    };

    union
    {
        __OM uint32_t ULPSCR;          /*!< (@ 0x0000010C) ULPS Control Register                                      */

        struct
        {
            uint32_t             : 24;
            __OM uint32_t CLENT  : 1;  /*!< [24..24] CL ULPS Enter                                                    */
            __OM uint32_t CLEXIT : 1;  /*!< [25..25] CL ULPS Exit                                                     */
            uint32_t             : 2;
            __OM uint32_t DLENT  : 1;  /*!< [28..28] DL ULPS Enter                                                    */
            __OM uint32_t DLEXIT : 1;  /*!< [29..29] DL ULPS Exit                                                     */
            uint32_t             : 2;
        } ULPSCR_b;
    };

    union
    {
        __IOM uint32_t RSTCR;          /*!< (@ 0x00000110) Reset Control Register                                     */

        struct
        {
            __IOM uint32_t SWRST  : 1; /*!< [0..0] Software Reset                                                     */
            uint32_t              : 15;
            __IOM uint32_t FTXSTP : 1; /*!< [16..16] Force Tx Stop Mode                                               */
            uint32_t              : 15;
        } RSTCR_b;
    };

    union
    {
        __IM uint32_t RSTSR;           /*!< (@ 0x00000114) Reset Status Register                                      */

        struct
        {
            __IM uint32_t RSTHS  : 1;  /*!< [0..0] HS Software Reset Status                                           */
            __IM uint32_t RSTLP  : 1;  /*!< [1..1] LP Software Reset Status                                           */
            __IM uint32_t RSTAPB : 1;  /*!< [2..2] APB Software Reset Status                                          */
            __IM uint32_t RSTAXI : 1;  /*!< [3..3] AXI Software Reset Status                                          */
            __IM uint32_t RSTV   : 1;  /*!< [4..4] Video Software Reset Status                                        */
            uint32_t             : 3;
            __IM uint32_t DL0STP : 1;  /*!< [8..8] Data Lane-0 Stop Status                                            */
            __IM uint32_t DL1STP : 1;  /*!< [9..9] Data Lane-1 Stop Status                                            */
            uint32_t             : 5;
            __IM uint32_t DL0DIR : 1;  /*!< [15..15] Data Lane-0 Direction                                            */
            uint32_t             : 16;
        } RSTSR_b;
    };
    __IM uint32_t RESERVED2[2];

    union
    {
        __IOM uint32_t DSISETR;           /*!< (@ 0x00000120) DSI Set Register                                           */

        struct
        {
            __IOM uint32_t MRPSZ    : 16; /*!< [15..0] Maximum Return Packet Size                                        */
            __IOM uint32_t ECCEN    : 1;  /*!< [16..16] ECC Check Enable                                                 */
            uint32_t                : 3;
            __IOM uint32_t VC0CRCEN : 1;  /*!< [20..20] VC-0 CRC Check Enable                                            */
            __IOM uint32_t VC1CRCEN : 1;  /*!< [21..21] VC-1 CRC Check Enable                                            */
            __IOM uint32_t VC2CRCEN : 1;  /*!< [22..22] VC-2 CRC Check Enable                                            */
            __IOM uint32_t VC3CRCEN : 1;  /*!< [23..23] VC-3 CRC Check Enable                                            */
            uint32_t                : 5;
            __IOM uint32_t SCREN    : 1;  /*!< [29..29] Data Scramble Enable                                             */
            __IOM uint32_t EXTEMD   : 1;  /*!< [30..30] External Tearing Effect Detection Sense Select                   */
            __IOM uint32_t EOTPEN   : 1;  /*!< [31..31] HS Transfer EoTp Enable                                          */
        } DSISETR_b;
    };
    __IM uint32_t RESERVED3[15];

    union
    {
        __IOM uint32_t TXPPD0R;        /*!< (@ 0x00000160) Transmit Packet Payload Data 0 Register                    */

        struct
        {
            __IOM uint32_t DATA0 : 8;  /*!< [7..0] Payload Data 0                                                     */
            __IOM uint32_t DATA1 : 8;  /*!< [15..8] Payload Data 1                                                    */
            __IOM uint32_t DATA2 : 8;  /*!< [23..16] Payload Data 2                                                   */
            __IOM uint32_t DATA3 : 8;  /*!< [31..24] Payload Data 3                                                   */
        } TXPPD0R_b;
    };

    union
    {
        __IOM uint32_t TXPPD1R;        /*!< (@ 0x00000164) Transmit Packet Payload Data 1 Register                    */

        struct
        {
            __IOM uint32_t DATA4 : 8;  /*!< [7..0] Payload Data 4                                                     */
            __IOM uint32_t DATA5 : 8;  /*!< [15..8] Payload Data 5                                                    */
            __IOM uint32_t DATA6 : 8;  /*!< [23..16] Payload Data 6                                                   */
            __IOM uint32_t DATA7 : 8;  /*!< [31..24] Payload Data 7                                                   */
        } TXPPD1R_b;
    };

    union
    {
        __IOM uint32_t TXPPD2R;        /*!< (@ 0x00000168) Transmit Packet Payload Data 2 Register                    */

        struct
        {
            __IOM uint32_t DATA8  : 8; /*!< [7..0] Payload Data 8                                                     */
            __IOM uint32_t DATA9  : 8; /*!< [15..8] Payload Data 9                                                    */
            __IOM uint32_t DATA10 : 8; /*!< [23..16] Payload Data 10                                                  */
            __IOM uint32_t DATA11 : 8; /*!< [31..24] Payload Data 11                                                  */
        } TXPPD2R_b;
    };

    union
    {
        __IOM uint32_t TXPPD3R;        /*!< (@ 0x0000016C) Transmit Packet Payload Data 3 Register                    */

        struct
        {
            __IOM uint32_t DATA12 : 8; /*!< [7..0] Payload Data 12                                                    */
            __IOM uint32_t DATA13 : 8; /*!< [15..8] Payload Data 13                                                   */
            __IOM uint32_t DATA14 : 8; /*!< [23..16] Payload Data 14                                                  */
            __IOM uint32_t DATA15 : 8; /*!< [31..24] Payload Data 15                                                  */
        } TXPPD3R_b;
    };
    __IM uint32_t RESERVED4[36];

    union
    {
        __IM uint32_t RXSR;             /*!< (@ 0x00000200) Receive Status Register                                    */

        struct
        {
            __IM uint32_t BTAREND  : 1; /*!< [0..0] BTA Request End Interrupt Flag                                     */
            __IM uint32_t LRXHTO   : 1; /*!< [1..1] LP-RX Host Processor Timeout Interrupt Flag                        */
            __IM uint32_t TATO     : 1; /*!< [2..2] Turnaround Acknowledge Timeout Interrupt Flag                      */
            uint32_t               : 5;
            __IM uint32_t RXRESP   : 1; /*!< [8..8] Response Packet Receive Interrupt Flag                             */
            uint32_t               : 1;
            __IM uint32_t RXEOTP   : 1; /*!< [10..10] EoTp Receive Interrupt Flag                                      */
            uint32_t               : 2;
            __IM uint32_t RXTE     : 1; /*!< [13..13] Tearing Effect Trigger Receive Interrupt Flag                    */
            __IM uint32_t RXACK    : 1; /*!< [14..14] ACK Trigger Receive Interrupt Flag                               */
            __IM uint32_t EXTEDET  : 1; /*!< [15..15] External Tearing Effect Detect Interrupt Flag                    */
            __IM uint32_t MLFERR   : 1; /*!< [16..16] Malform Error Interrupt Flag                                     */
            __IM uint32_t ECCERRM  : 1; /*!< [17..17] Multi Bit ECC Error Interrupt Flag                               */
            __IM uint32_t UNEXERR  : 1; /*!< [18..18] Unexpected Packet Error Interrupt Flag                           */
            uint32_t               : 1;
            __IM uint32_t WCERR    : 1; /*!< [20..20] Word Count Error Interrupt Flag                                  */
            __IM uint32_t CRCERR   : 1; /*!< [21..21] CRC Error Interrupt Flag                                         */
            __IM uint32_t IBERR    : 1; /*!< [22..22] Internal Bus Error Interrupt Flag                                */
            __IM uint32_t RXOVFERR : 1; /*!< [23..23] Receive Buffer Overflow Error Interrupt Flag                     */
            __IM uint32_t PRTOERR  : 1; /*!< [24..24] Peripheral Response Timeout Error Interrupt Flag                 */
            __IM uint32_t NORESERR : 1; /*!< [25..25] No Response Error Interrupt Flag                                 */
            __IM uint32_t RSIZEERR : 1; /*!< [26..26] Return Packet Size Error Interrupt Flag                          */
            uint32_t               : 1;
            __IM uint32_t ECCERRS  : 1; /*!< [28..28] Single Bit ECC Error Interrupt Flag                              */
            uint32_t               : 1;
            __IM uint32_t RXAKE    : 1; /*!< [30..30] Acknowledge and Error Report Receive Interrupt Flag              */
            uint32_t               : 1;
        } RXSR_b;
    };

    union
    {
        __IOM uint32_t RXSCR;            /*!< (@ 0x00000204) Receive Status Clear Register                              */

        struct
        {
            __IOM uint32_t BTAREND  : 1; /*!< [0..0] BTA Request End Interrupt Flag Clear                               */
            __IOM uint32_t LRXHTO   : 1; /*!< [1..1] LP-RX Host Processor Timeout Interrupt Flag Clear                  */
            __IOM uint32_t TATO     : 1; /*!< [2..2] Turnaround Acknowledge Timeout Interrupt Flag Clear                */
            uint32_t                : 5;
            __IOM uint32_t RXRESP   : 1; /*!< [8..8] Response Packet Receive Interrupt Flag Clear                       */
            uint32_t                : 1;
            __IOM uint32_t RXEOTP   : 1; /*!< [10..10] EoTp Receive Interrupt Flag Clear                                */
            uint32_t                : 2;
            __IOM uint32_t RXTE     : 1; /*!< [13..13] Tearing Effect Trigger Receive Interrupt Flag Clear              */
            __IOM uint32_t RXACK    : 1; /*!< [14..14] ACK Trigger Receive Interrupt Flag Clear                         */
            __IOM uint32_t EXTEDET  : 1; /*!< [15..15] External Tearing Effect Detect Interrupt Flag Clear              */
            __IOM uint32_t MLFERR   : 1; /*!< [16..16] Malform Error Interrupt Flag Clear                               */
            __IOM uint32_t ECCERRM  : 1; /*!< [17..17] Multi Bit ECC Error Interrupt Flag Clear                         */
            __IOM uint32_t UNEXERR  : 1; /*!< [18..18] Unexpected Packet Error Interrupt Flag Clear                     */
            uint32_t                : 1;
            __IOM uint32_t WCERR    : 1; /*!< [20..20] Word Count Error Interrupt Flag Clear                            */
            __IOM uint32_t CRCERR   : 1; /*!< [21..21] CRC Error Interrupt Flag Clear                                   */
            __IOM uint32_t IBERR    : 1; /*!< [22..22] Internal Bus Error Interrupt Flag Clear                          */
            __IOM uint32_t RXOVFERR : 1; /*!< [23..23] Receive Buffer Overflow Error Interrupt Flag Clear               */
            __IOM uint32_t PRTOERR  : 1; /*!< [24..24] Peripheral Response Timeout Error Interrupt Flag Clear           */
            __IOM uint32_t NORESERR : 1; /*!< [25..25] No Response Error Interrupt Flag Clear                           */
            __IOM uint32_t RSIZEERR : 1; /*!< [26..26] Return Packet Size Error Interrupt Flag Clear                    */
            uint32_t                : 1;
            __IOM uint32_t ECCERRS  : 1; /*!< [28..28] Single Bit ECC Error Interrupt Flag Clear                        */
            uint32_t                : 1;
            __IOM uint32_t RXAKE    : 1; /*!< [30..30] Acknowledge and Error Report Receive Interrupt Flag
                                          *   Clear                                                                     */
            uint32_t : 1;
        } RXSCR_b;
    };

