RT-Thread/rt-thread/bsp/renesas/ra8d1-vision-board/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8D1BH.h
    union
    {
        __IOM uint32_t RXIER;            /*!< (@ 0x00000208) Receive Interrupt Enable Register                          */

        struct
        {
            __IOM uint32_t BTAREND  : 1; /*!< [0..0] BTA Request End Interrupt Enable                                   */
            __IOM uint32_t LRXHTO   : 1; /*!< [1..1] LP-RX Host Processor Timeout Interrupt Enable                      */
            __IOM uint32_t TATO     : 1; /*!< [2..2] Turnaround Acknowledge Timeout Interrupt Enable                    */
            uint32_t                : 5;
            __IOM uint32_t RXRESP   : 1; /*!< [8..8] Response Packet Receive Interrupt Enable                           */
            uint32_t                : 1;
            __IOM uint32_t RXEOTP   : 1; /*!< [10..10] EoTp Receive Interrupt Enable                                    */
            uint32_t                : 2;
            __IOM uint32_t RXTE     : 1; /*!< [13..13] Tearing Effect Trigger Receive Interrupt Enable                  */
            __IOM uint32_t RXACK    : 1; /*!< [14..14] ACK Trigger Receive Interrupt Enable                             */
            __IOM uint32_t EXTEDET  : 1; /*!< [15..15] External Tearing Effect Detect Interrupt Enable                  */
            __IOM uint32_t MLFERR   : 1; /*!< [16..16] Malform Error Interrupt Enable                                   */
            __IOM uint32_t ECCERRM  : 1; /*!< [17..17] Multi Bit ECC Error Interrupt Enable                             */
            __IOM uint32_t UNEXERR  : 1; /*!< [18..18] Unexpected Packet Error Interrupt Enable                         */
            uint32_t                : 1;
            __IOM uint32_t WCERR    : 1; /*!< [20..20] Word Count Error Interrupt Enable                                */
            __IOM uint32_t CRCERR   : 1; /*!< [21..21] CRC Error Interrupt Enable                                       */
            __IOM uint32_t IBERR    : 1; /*!< [22..22] Internal Bus Error Interrupt Enable                              */
            __IOM uint32_t RXOVFERR : 1; /*!< [23..23] Receive Buffer Overflow Error Interrupt Enable                   */
            __IOM uint32_t PRTOERR  : 1; /*!< [24..24] Peripheral Response Timeout Error Interrupt Enable               */
            __IOM uint32_t NORESERR : 1; /*!< [25..25] No Response Error Interrupt Enable                               */
            __IOM uint32_t RSIZEERR : 1; /*!< [26..26] Return Packet Size Error Interrupt Enable                        */
            uint32_t                : 1;
            __IOM uint32_t ECCERRS  : 1; /*!< [28..28] Single Bit ECC Error Interrupt Enable                            */
            uint32_t                : 1;
            __IOM uint32_t RXAKE    : 1; /*!< [30..30] Acknowledge and Error Report Receive Interrupt Enable            */
            uint32_t                : 1;
        } RXIER_b;
    };
    __IM uint32_t RESERVED5;

    union
    {
        __IOM uint32_t PRESPTOBTASETR;  /*!< (@ 0x00000210) Peripheral Response Timeout BTA Set Register               */

        struct
        {
            __IOM uint32_t PRTBTA : 32; /*!< [31..0] Peripheral Response Timeout Count                                 */
        } PRESPTOBTASETR_b;
    };

    union
    {
        __IOM uint32_t PRESPTOLPSETR;  /*!< (@ 0x00000214) Peripheral Response Timeout LP Set Register                */

        struct
        {
            __IOM uint32_t LPWTO : 16; /*!< [15..0] LPDT WRITE Request Timeout                                        */
            __IOM uint32_t LPRTO : 16; /*!< [31..16] LPDT READ Request Timeout                                        */
        } PRESPTOLPSETR_b;
    };

    union
    {
        __IOM uint32_t PRESPTOHSSETR;  /*!< (@ 0x00000218) Peripheral Response Timeout HS Set Register                */

        struct
        {
            __IOM uint32_t HSWTO : 16; /*!< [15..0] HS WRITE Request Timeout                                          */
            __IOM uint32_t HSRTO : 16; /*!< [31..16] HS READ Request Timeout                                          */
        } PRESPTOHSSETR_b;
    };
    __IM uint32_t RESERVED6;

    union
    {
        __IM uint32_t AKEPLATIR;       /*!< (@ 0x00000220) Acknowledge and Error Report Packet Parameter
                                        *                  Latest Info Register                                       */

        struct
        {
            __IM uint32_t EREP : 16;   /*!< [15..0] Error Report                                                      */
            __IM uint32_t VC   : 4;    /*!< [19..16] Virtual Channel ID                                               */
            uint32_t           : 12;
        } AKEPLATIR_b;
    };

    union
    {
        __IM uint32_t AKEPACMSR;       /*!< (@ 0x00000224) Acknowledge and Error Report Packet Parameter
                                        *                  Accumulate Status Register                                 */

        struct
        {
            __IM uint32_t AEREP : 16;  /*!< [15..0] Accumulated Error Report                                          */
            __IM uint32_t AVC   : 4;   /*!< [19..16] Virtual Channel ID                                               */
            uint32_t            : 12;
        } AKEPACMSR_b;
    };

    union
    {
        __IOM uint32_t AKEPSCR;        /*!< (@ 0x00000228) Acknowledge and Error Report Packet Parameter
                                        *                  Status Clear Register                                      */

        struct
        {
            __IOM uint32_t AEREP : 16; /*!< [15..0] Accumulated Error Report Clear                                    */
            __IM uint32_t  AVC   : 4;  /*!< [19..16] Virtual Channel ID                                               */
            uint32_t             : 12;
        } AKEPSCR_b;
    };
    __IM uint32_t RESERVED7;

    union
    {
        __IM uint32_t RXRSSR;          /*!< (@ 0x00000230) Receive Result Saved Status Register                       */

        struct
        {
            __IM uint32_t SLT0VLD : 1; /*!< [0..0] Slot-0 Valid Flag                                                  */
            __IM uint32_t SLT1VLD : 1; /*!< [1..1] Slot-1 Valid Flag                                                  */
            __IM uint32_t SLT2VLD : 1; /*!< [2..2] Slot-2 Valid Flag                                                  */
            __IM uint32_t SLT3VLD : 1; /*!< [3..3] Slot-3 Valid Flag                                                  */
            uint32_t              : 28;
        } RXRSSR_b;
    };

    union
    {
        __IOM uint32_t RXRSSCR;         /*!< (@ 0x00000234) Receive Result Saved Status Clear Register                 */

        struct
        {
            __IOM uint32_t SLT0VLD : 1; /*!< [0..0] Slot-0 Valid Flag Clear                                            */
            __IOM uint32_t SLT1VLD : 1; /*!< [1..1] Slot-1 Valid Flag Clear                                            */
            __IOM uint32_t SLT2VLD : 1; /*!< [2..2] Slot-2 Valid Flag Clear                                            */
            __IOM uint32_t SLT3VLD : 1; /*!< [3..3] Slot-3 Valid Flag Clear                                            */
            uint32_t               : 28;
        } RXRSSCR_b;
    };

    union
    {
        __IM uint32_t RXRINFOOWSR;     /*!< (@ 0x00000238) Receive Result Info Overwrite Status Register              */

        struct
        {
            __IM uint32_t SL0OW : 1;   /*!< [0..0] Slot-0 Information Overwrite Flag                                  */
            __IM uint32_t SL1OW : 1;   /*!< [1..1] Slot-1 Information Overwrite Flag                                  */
            __IM uint32_t SL2OW : 1;   /*!< [2..2] Slot-2 Information Overwrite Flag                                  */
            __IM uint32_t SL3OW : 1;   /*!< [3..3] Slot-3 Information Overwrite Flag                                  */
            uint32_t            : 28;
        } RXRINFOOWSR_b;
    };

    union
    {
        __IOM uint32_t RXRINFOOWSCR;   /*!< (@ 0x0000023C) Receive Result Info Overwrite Status Clear Register        */

        struct
        {
            __IOM uint32_t SL0OW : 1;  /*!< [0..0] Slot-0 Information Overwrite Flag Clear                            */
            __IOM uint32_t SL1OW : 1;  /*!< [1..1] Slot-1 Information Overwrite Flag Clear                            */
            __IOM uint32_t SL2OW : 1;  /*!< [2..2] Slot-2 Information Overwrite Flag Clear                            */
            __IOM uint32_t SL3OW : 1;  /*!< [3..3] Slot-3 Information Overwrite Flag Clear                            */
            uint32_t             : 28;
        } RXRINFOOWSCR_b;
    };

    union
    {
        union
        {
            __IM uint32_t RXRSS0R;         /*!< (@ 0x00000240) Receive Result Save Slot-0 Register                        */

            struct
            {
                __IM uint32_t DATA0   : 8; /*!< [7..0] Data 0                                                             */
                __IM uint32_t DATA1   : 8; /*!< [15..8] Data 1                                                            */
                __IM uint32_t DT      : 6; /*!< [21..16] Data Type                                                        */
                __IM uint32_t VC      : 2; /*!< [23..22] Virtual Channel                                                  */
                __IM uint32_t FMT     : 1; /*!< [24..24] Packet Format                                                    */
                __IM uint32_t RXSUC   : 1; /*!< [25..25] Receive Success                                                  */
                __IM uint32_t RXFERR  : 1; /*!< [26..26] Fatal Error                                                      */
                __IM uint32_t RXFAIL  : 1; /*!< [27..27] Receive Fail                                                     */
                __IM uint32_t RXPFAIL : 1; /*!< [28..28] Receive Packet Data Fail                                         */
                __IM uint32_t RXCERR  : 1; /*!< [29..29] Receive Correctable Error                                        */
                __IM uint32_t RXAKE   : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet                      */
                __IM uint32_t INFOOW  : 1; /*!< [31..31] Information Overwrite                                            */
            } RXRSS0R_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IM uint16_t RXRSS0R_L;     /*!< (@ 0x00000240) Receive Result Save Slot-0 Register                        */

                    struct
                    {
                        __IM uint16_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        __IM uint16_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                    } RXRSS0R_L_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS0R_LL;    /*!< (@ 0x00000240) Receive Result Save Slot-0 Register                        */

                        struct
                        {
                            __IM uint8_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        } RXRSS0R_LL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS0R_LH;    /*!< (@ 0x00000241) Receive Result Save Slot-0 Register                        */

                        struct
                        {
                            __IM uint8_t DATA1 : 8; /*!< [7..0] Data 1                                                             */
                        } RXRSS0R_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IM uint16_t RXRSS0R_H;       /*!< (@ 0x00000242) Receive Result Save Slot-0 Register                        */

                    struct
                    {
                        __IM uint16_t DT      : 6; /*!< [5..0] Data Type                                                          */
                        __IM uint16_t VC      : 2; /*!< [7..6] Virtual Channel                                                    */
                        __IM uint16_t FMT     : 1; /*!< [8..8] Packet Format                                                      */
                        __IM uint16_t RXSUC   : 1; /*!< [9..9] Receive Success                                                    */
                        __IM uint16_t RXFERR  : 1; /*!< [10..10] Fatal Error                                                      */
                        __IM uint16_t RXFAIL  : 1; /*!< [11..11] Receive Fail                                                     */
                        __IM uint16_t RXPFAIL : 1; /*!< [12..12] Receive Packet Data Fail                                         */
                        __IM uint16_t RXCERR  : 1; /*!< [13..13] Receive Correctable Error                                        */
                        __IM uint16_t RXAKE   : 1; /*!< [14..14] Receive Acknowledge and Error Report Packet                      */
                        __IM uint16_t INFOOW  : 1; /*!< [15..15] Information Overwrite                                            */
                    } RXRSS0R_H_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS0R_HL; /*!< (@ 0x00000242) Receive Result Save Slot-0 Register                        */

                        struct
                        {
                            __IM uint8_t DT : 6; /*!< [5..0] Data Type                                                          */
                            __IM uint8_t VC : 2; /*!< [7..6] Virtual Channel                                                    */
                        } RXRSS0R_HL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS0R_HH;      /*!< (@ 0x00000243) Receive Result Save Slot-0 Register                        */

                        struct
                        {
                            __IM uint8_t FMT     : 1; /*!< [0..0] Packet Format                                                      */
                            __IM uint8_t RXSUC   : 1; /*!< [1..1] Receive Success                                                    */
                            __IM uint8_t RXFERR  : 1; /*!< [2..2] Fatal Error                                                        */
                            __IM uint8_t RXFAIL  : 1; /*!< [3..3] Receive Fail                                                       */
                            __IM uint8_t RXPFAIL : 1; /*!< [4..4] Receive Packet Data Fail                                           */
                            __IM uint8_t RXCERR  : 1; /*!< [5..5] Receive Correctable Error                                          */
                            __IM uint8_t RXAKE   : 1; /*!< [6..6] Receive Acknowledge and Error Report Packet                        */
                            __IM uint8_t INFOOW  : 1; /*!< [7..7] Information Overwrite                                              */
                        } RXRSS0R_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IM uint32_t RXRSS1R;         /*!< (@ 0x00000244) Receive Result Save Slot-1 Register                        */

            struct
            {
                __IM uint32_t DATA0   : 8; /*!< [7..0] Data 0                                                             */
                __IM uint32_t DATA1   : 8; /*!< [15..8] Data 1                                                            */
                __IM uint32_t DT      : 6; /*!< [21..16] Data Type                                                        */
                __IM uint32_t VC      : 2; /*!< [23..22] Virtual Channel                                                  */
                __IM uint32_t FMT     : 1; /*!< [24..24] Packet Format                                                    */
                __IM uint32_t RXSUC   : 1; /*!< [25..25] Receive Success                                                  */
                __IM uint32_t RXFERR  : 1; /*!< [26..26] Fatal Error                                                      */
                __IM uint32_t RXFAIL  : 1; /*!< [27..27] Receive Fail                                                     */
                __IM uint32_t RXPFAIL : 1; /*!< [28..28] Receive Packet Data Fail                                         */
                __IM uint32_t RXCERR  : 1; /*!< [29..29] Receive Correctable Error                                        */
                __IM uint32_t RXAKE   : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet                      */
                __IM uint32_t INFOOW  : 1; /*!< [31..31] Information Overwrite                                            */
            } RXRSS1R_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IM uint16_t RXRSS1R_L;     /*!< (@ 0x00000244) Receive Result Save Slot-1 Register                        */

                    struct
                    {
                        __IM uint16_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        __IM uint16_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                    } RXRSS1R_L_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS1R_LL;    /*!< (@ 0x00000244) Receive Result Save Slot-1 Register                        */

                        struct
                        {
                            __IM uint8_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        } RXRSS1R_LL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS1R_LH;    /*!< (@ 0x00000245) Receive Result Save Slot-1 Register                        */

                        struct
                        {
                            __IM uint8_t DATA1 : 8; /*!< [7..0] Data 1                                                             */
                        } RXRSS1R_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IM uint16_t RXRSS1R_H;       /*!< (@ 0x00000246) Receive Result Save Slot-1 Register                        */

                    struct
                    {
                        __IM uint16_t DT      : 6; /*!< [5..0] Data Type                                                          */
                        __IM uint16_t VC      : 2; /*!< [7..6] Virtual Channel                                                    */
                        __IM uint16_t FMT     : 1; /*!< [8..8] Packet Format                                                      */
                        __IM uint16_t RXSUC   : 1; /*!< [9..9] Receive Success                                                    */
                        __IM uint16_t RXFERR  : 1; /*!< [10..10] Fatal Error                                                      */
                        __IM uint16_t RXFAIL  : 1; /*!< [11..11] Receive Fail                                                     */
                        __IM uint16_t RXPFAIL : 1; /*!< [12..12] Receive Packet Data Fail                                         */
                        __IM uint16_t RXCERR  : 1; /*!< [13..13] Receive Correctable Error                                        */
                        __IM uint16_t RXAKE   : 1; /*!< [14..14] Receive Acknowledge and Error Report Packet                      */
                        __IM uint16_t INFOOW  : 1; /*!< [15..15] Information Overwrite                                            */
                    } RXRSS1R_H_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS1R_HL; /*!< (@ 0x00000246) Receive Result Save Slot-1 Register                        */

                        struct
                        {
                            __IM uint8_t DT : 6; /*!< [5..0] Data Type                                                          */
                            __IM uint8_t VC : 2; /*!< [7..6] Virtual Channel                                                    */
                        } RXRSS1R_HL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS1R_HH;      /*!< (@ 0x00000247) Receive Result Save Slot-1 Register                        */

                        struct
                        {
                            __IM uint8_t FMT     : 1; /*!< [0..0] Packet Format                                                      */
                            __IM uint8_t RXSUC   : 1; /*!< [1..1] Receive Success                                                    */
                            __IM uint8_t RXFERR  : 1; /*!< [2..2] Fatal Error                                                        */
                            __IM uint8_t RXFAIL  : 1; /*!< [3..3] Receive Fail                                                       */
                            __IM uint8_t RXPFAIL : 1; /*!< [4..4] Receive Packet Data Fail                                           */
                            __IM uint8_t RXCERR  : 1; /*!< [5..5] Receive Correctable Error                                          */
                            __IM uint8_t RXAKE   : 1; /*!< [6..6] Receive Acknowledge and Error Report Packet                        */
                            __IM uint8_t INFOOW  : 1; /*!< [7..7] Information Overwrite                                              */
                        } RXRSS1R_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IM uint32_t RXRSS2R;         /*!< (@ 0x00000248) Receive Result Save Slot-2 Register                        */

