RT-Thread/rt-thread/bsp/renesas/ra8d1-vision-board/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8D1BH.h
            struct
            {
                __IM uint32_t DATA0   : 8; /*!< [7..0] Data 0                                                             */
                __IM uint32_t DATA1   : 8; /*!< [15..8] Data 1                                                            */
                __IM uint32_t DT      : 6; /*!< [21..16] Data Type                                                        */
                __IM uint32_t VC      : 2; /*!< [23..22] Virtual Channel                                                  */
                __IM uint32_t FMT     : 1; /*!< [24..24] Packet Format                                                    */
                __IM uint32_t RXSUC   : 1; /*!< [25..25] Receive Success                                                  */
                __IM uint32_t RXFERR  : 1; /*!< [26..26] Fatal Error                                                      */
                __IM uint32_t RXFAIL  : 1; /*!< [27..27] Receive Fail                                                     */
                __IM uint32_t RXPFAIL : 1; /*!< [28..28] Receive Packet Data Fail                                         */
                __IM uint32_t RXCERR  : 1; /*!< [29..29] Receive Correctable Error                                        */
                __IM uint32_t RXAKE   : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet                      */
                __IM uint32_t INFOOW  : 1; /*!< [31..31] Information Overwrite                                            */
            } RXRSS2R_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IM uint16_t RXRSS2R_L;     /*!< (@ 0x00000248) Receive Result Save Slot-2 Register                        */

                    struct
                    {
                        __IM uint16_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        __IM uint16_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                    } RXRSS2R_L_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS2R_LL;    /*!< (@ 0x00000248) Receive Result Save Slot-2 Register                        */

                        struct
                        {
                            __IM uint8_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        } RXRSS2R_LL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS2R_LH;    /*!< (@ 0x00000249) Receive Result Save Slot-2 Register                        */

                        struct
                        {
                            __IM uint8_t DATA1 : 8; /*!< [7..0] Data 1                                                             */
                        } RXRSS2R_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IM uint16_t RXRSS2R_H;       /*!< (@ 0x0000024A) Receive Result Save Slot-2 Register                        */

                    struct
                    {
                        __IM uint16_t DT      : 6; /*!< [5..0] Data Type                                                          */
                        __IM uint16_t VC      : 2; /*!< [7..6] Virtual Channel                                                    */
                        __IM uint16_t FMT     : 1; /*!< [8..8] Packet Format                                                      */
                        __IM uint16_t RXSUC   : 1; /*!< [9..9] Receive Success                                                    */
                        __IM uint16_t RXFERR  : 1; /*!< [10..10] Fatal Error                                                      */
                        __IM uint16_t RXFAIL  : 1; /*!< [11..11] Receive Fail                                                     */
                        __IM uint16_t RXPFAIL : 1; /*!< [12..12] Receive Packet Data Fail                                         */
                        __IM uint16_t RXCERR  : 1; /*!< [13..13] Receive Correctable Error                                        */
                        __IM uint16_t RXAKE   : 1; /*!< [14..14] Receive Acknowledge and Error Report Packet                      */
                        __IM uint16_t INFOOW  : 1; /*!< [15..15] Information Overwrite                                            */
                    } RXRSS2R_H_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS2R_HL; /*!< (@ 0x0000024A) Receive Result Save Slot-2 Register                        */

                        struct
                        {
                            __IM uint8_t DT : 6; /*!< [5..0] Data Type                                                          */
                            __IM uint8_t VC : 2; /*!< [7..6] Virtual Channel                                                    */
                        } RXRSS2R_HL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS2R_HH;      /*!< (@ 0x0000024B) Receive Result Save Slot-2 Register                        */

                        struct
                        {
                            __IM uint8_t FMT     : 1; /*!< [0..0] Packet Format                                                      */
                            __IM uint8_t RXSUC   : 1; /*!< [1..1] Receive Success                                                    */
                            __IM uint8_t RXFERR  : 1; /*!< [2..2] Fatal Error                                                        */
                            __IM uint8_t RXFAIL  : 1; /*!< [3..3] Receive Fail                                                       */
                            __IM uint8_t RXPFAIL : 1; /*!< [4..4] Receive Packet Data Fail                                           */
                            __IM uint8_t RXCERR  : 1; /*!< [5..5] Receive Correctable Error                                          */
                            __IM uint8_t RXAKE   : 1; /*!< [6..6] Receive Acknowledge and Error Report Packet                        */
                            __IM uint8_t INFOOW  : 1; /*!< [7..7] Information Overwrite                                              */
                        } RXRSS2R_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IM uint32_t RXRSS3R;         /*!< (@ 0x0000024C) Receive Result Save Slot-3 Register                        */

            struct
            {
                __IM uint32_t DATA0   : 8; /*!< [7..0] Data 0                                                             */
                __IM uint32_t DATA1   : 8; /*!< [15..8] Data 1                                                            */
                __IM uint32_t DT      : 6; /*!< [21..16] Data Type                                                        */
                __IM uint32_t VC      : 2; /*!< [23..22] Virtual Channel                                                  */
                __IM uint32_t FMT     : 1; /*!< [24..24] Packet Format                                                    */
                __IM uint32_t RXSUC   : 1; /*!< [25..25] Receive Success                                                  */
                __IM uint32_t RXFERR  : 1; /*!< [26..26] Fatal Error                                                      */
                __IM uint32_t RXFAIL  : 1; /*!< [27..27] Receive Fail                                                     */
                __IM uint32_t RXPFAIL : 1; /*!< [28..28] Receive Packet Data Fail                                         */
                __IM uint32_t RXCERR  : 1; /*!< [29..29] Receive Correctable Error                                        */
                __IM uint32_t RXAKE   : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet                      */
                __IM uint32_t INFOOW  : 1; /*!< [31..31] Information Overwrite                                            */
            } RXRSS3R_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IM uint16_t RXRSS3R_L;     /*!< (@ 0x0000024C) Receive Result Save Slot-3 Register                        */

                    struct
                    {
                        __IM uint16_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        __IM uint16_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                    } RXRSS3R_L_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS3R_LL;    /*!< (@ 0x0000024C) Receive Result Save Slot-3 Register                        */

                        struct
                        {
                            __IM uint8_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        } RXRSS3R_LL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS3R_LH;    /*!< (@ 0x0000024D) Receive Result Save Slot-3 Register                        */

                        struct
                        {
                            __IM uint8_t DATA1 : 8; /*!< [7..0] Data 1                                                             */
                        } RXRSS3R_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IM uint16_t RXRSS3R_H;       /*!< (@ 0x0000024E) Receive Result Save Slot-3 Register                        */

                    struct
                    {
                        __IM uint16_t DT      : 6; /*!< [5..0] Data Type                                                          */
                        __IM uint16_t VC      : 2; /*!< [7..6] Virtual Channel                                                    */
                        __IM uint16_t FMT     : 1; /*!< [8..8] Packet Format                                                      */
                        __IM uint16_t RXSUC   : 1; /*!< [9..9] Receive Success                                                    */
                        __IM uint16_t RXFERR  : 1; /*!< [10..10] Fatal Error                                                      */
                        __IM uint16_t RXFAIL  : 1; /*!< [11..11] Receive Fail                                                     */
                        __IM uint16_t RXPFAIL : 1; /*!< [12..12] Receive Packet Data Fail                                         */
                        __IM uint16_t RXCERR  : 1; /*!< [13..13] Receive Correctable Error                                        */
                        __IM uint16_t RXAKE   : 1; /*!< [14..14] Receive Acknowledge and Error Report Packet                      */
                        __IM uint16_t INFOOW  : 1; /*!< [15..15] Information Overwrite                                            */
                    } RXRSS3R_H_b;
                };

                struct
                {
                    union
                    {
                        __IM uint8_t RXRSS3R_HL; /*!< (@ 0x0000024E) Receive Result Save Slot-3 Register                        */

                        struct
                        {
                            __IM uint8_t DT : 6; /*!< [5..0] Data Type                                                          */
                            __IM uint8_t VC : 2; /*!< [7..6] Virtual Channel                                                    */
                        } RXRSS3R_HL_b;
                    };

                    union
                    {
                        __IM uint8_t RXRSS3R_HH;      /*!< (@ 0x0000024F) Receive Result Save Slot-3 Register                        */

                        struct
                        {
                            __IM uint8_t FMT     : 1; /*!< [0..0] Packet Format                                                      */
                            __IM uint8_t RXSUC   : 1; /*!< [1..1] Receive Success                                                    */
                            __IM uint8_t RXFERR  : 1; /*!< [2..2] Fatal Error                                                        */
                            __IM uint8_t RXFAIL  : 1; /*!< [3..3] Receive Fail                                                       */
                            __IM uint8_t RXPFAIL : 1; /*!< [4..4] Receive Packet Data Fail                                           */
                            __IM uint8_t RXCERR  : 1; /*!< [5..5] Receive Correctable Error                                          */
                            __IM uint8_t RXAKE   : 1; /*!< [6..6] Receive Acknowledge and Error Report Packet                        */
                            __IM uint8_t INFOOW  : 1; /*!< [7..7] Information Overwrite                                              */
                        } RXRSS3R_HH_b;
                    };
                };
            };
        };
    };
    __IM uint32_t RESERVED8[28];

    union
    {
        __IM uint32_t RXPPD0R;         /*!< (@ 0x000002C0) Receive Packet Payload Data 0 Register                     */

        struct
        {
            __IM uint32_t DATA0 : 8;   /*!< [7..0] Payload Data 0                                                     */
            __IM uint32_t DATA1 : 8;   /*!< [15..8] Payload Data 1                                                    */
            __IM uint32_t DATA2 : 8;   /*!< [23..16] Payload Data 2                                                   */
            __IM uint32_t DATA3 : 8;   /*!< [31..24] Payload Data 3                                                   */
        } RXPPD0R_b;
    };

    union
    {
        __IM uint32_t RXPPD1R;         /*!< (@ 0x000002C4) Receive Packet Payload Data 1 Register                     */

        struct
        {
            __IM uint32_t DATA4 : 8;   /*!< [7..0] Payload Data 0                                                     */
            __IM uint32_t DATA5 : 8;   /*!< [15..8] Payload Data 1                                                    */
            __IM uint32_t DATA6 : 8;   /*!< [23..16] Payload Data 2                                                   */
            __IM uint32_t DATA7 : 8;   /*!< [31..24] Payload Data 3                                                   */
        } RXPPD1R_b;
    };

    union
    {
        __IM uint32_t RXPPD2R;         /*!< (@ 0x000002C8) Receive Packet Payload Data 2 Register                     */

        struct
        {
            __IM uint32_t DATA8  : 8;  /*!< [7..0] Payload Data 8                                                     */
            __IM uint32_t DATA9  : 8;  /*!< [15..8] Payload Data 9                                                    */
            __IM uint32_t DATA10 : 8;  /*!< [23..16] Payload Data 10                                                  */
            __IM uint32_t DATA11 : 8;  /*!< [31..24] Payload Data 11                                                  */
        } RXPPD2R_b;
    };

    union
    {
        __IM uint32_t RXPPD3R;         /*!< (@ 0x000002CC) Receive Packet Payload Data 3 Register                     */

        struct
        {
            __IM uint32_t DATA12 : 8;  /*!< [7..0] Payload Data 12                                                    */
            __IM uint32_t DATA13 : 8;  /*!< [15..8] Payload Data 13                                                   */
            __IM uint32_t DATA14 : 8;  /*!< [23..16] Payload Data 14                                                  */
            __IM uint32_t DATA15 : 8;  /*!< [31..24] Payload Data 15                                                  */
        } RXPPD3R_b;
    };
    __IM uint32_t RESERVED9[4];

    union
    {
        __IOM uint32_t HSTXTOSETR;     /*!< (@ 0x000002E0) HS TX Timeout Set Register                                 */

        struct
        {
            __IOM uint32_t HTXTO : 32; /*!< [31..0] HS TX Timeout Count                                               */
        } HSTXTOSETR_b;
    };

    union
    {
        __IOM uint32_t LRXHTOSETR;      /*!< (@ 0x000002E4) LRX-H Timeout Set Register                                 */

        struct
        {
            __IOM uint32_t LRXHTO : 32; /*!< [31..0] LP-RX Host Processor Timeout                                      */
        } LRXHTOSETR_b;
    };

    union
    {
        __IOM uint32_t TATOSETR;       /*!< (@ 0x000002E8) TA Timeout Set Register                                    */

        struct
        {
            __IOM uint32_t TATO : 32;  /*!< [31..0] Turnaround Acknowledge Timeout                                    */
        } TATOSETR_b;
    };
    __IM uint32_t RESERVED10[5];

    union
    {
        __IM uint32_t FERRSR;          /*!< (@ 0x00000300) Fatal Error Status Register                                */

        struct
        {
            __IM uint32_t HTXTO   : 1; /*!< [0..0] HS TX Timeout Interrupt Flag                                       */
            __IM uint32_t LRXHTO  : 1; /*!< [1..1] LP-RX Host Processor Timeout Interrupt Flag                        */
            __IM uint32_t TATO    : 1; /*!< [2..2] Turnaround Acknowledge Timeout Interrupt Flag                      */
            uint32_t              : 13;
            __IM uint32_t ESCENT  : 1; /*!< [16..16] Escape mode Entry Error Interrupt Flag                           */
            __IM uint32_t SYNCESC : 1; /*!< [17..17] LPDT Sync Error Interrupt Flag                                   */
            __IM uint32_t CTRL    : 1; /*!< [18..18] Control Error Interrupt Flag                                     */
            __IM uint32_t CLP0    : 1; /*!< [19..19] LP0 Contention Error Interrupt Flag                              */
            __IM uint32_t CLP1    : 1; /*!< [20..20] LP1 Contention Error Interrupt Flag                              */
            uint32_t              : 6;
            __IM uint32_t CLP0S   : 1; /*!< [27..27] LP0 Contention Error Status                                      */
            __IM uint32_t CLP1S   : 1; /*!< [28..28] LP1 Contention Error Status                                      */
            uint32_t              : 3;
        } FERRSR_b;
    };

    union
    {
        __IOM uint32_t FERRSCR;         /*!< (@ 0x00000304) Fatal Error Status Clear Register                          */

        struct
        {
            __IOM uint32_t HTXTO   : 1; /*!< [0..0] HS TX Timeout Interrupt Flag Clear                                 */
            __IOM uint32_t LRXHTO  : 1; /*!< [1..1] LP-RX Host Processor Timeout Interrupt Flag Clear                  */
            __IOM uint32_t TATO    : 1; /*!< [2..2] Turnaround Acknowledge Timeout Interrupt Flag Clear                */
            uint32_t               : 13;
            __IOM uint32_t ESCENT  : 1; /*!< [16..16] Escape mode Entry Error Interrupt Flag Clear                     */
            __IOM uint32_t SYNCESC : 1; /*!< [17..17] LPDT Sync Error Interrupt Flag Clear                             */
            __IOM uint32_t CTRL    : 1; /*!< [18..18] Control Error Interrupt Flag Clear                               */
            __IOM uint32_t CLP0    : 1; /*!< [19..19] LP0 Contention Error Interrupt Flag Clear                        */
            __IOM uint32_t CLP1    : 1; /*!< [20..20] LP1 Contention Error Interrupt Flag Clear                        */
            uint32_t               : 11;
        } FERRSCR_b;
    };

    union
    {
        __IOM uint32_t FERRIER;         /*!< (@ 0x00000308) Fatal Error Interrupt Enable Register                      */

        struct
        {
            __IOM uint32_t HTXTO   : 1; /*!< [0..0] HS TX Timeout Interrupt Enable                                     */
            __IOM uint32_t LRXHTO  : 1; /*!< [1..1] LP-RX Host Processor Timeout Interrupt Enable                      */
            __IOM uint32_t TATO    : 1; /*!< [2..2] Turnaround Acknowledge Timeout Interrupt Enable                    */
            uint32_t               : 13;
            __IOM uint32_t ESCENT  : 1; /*!< [16..16] Escape mode Entry Error Interrupt Enable                         */
            __IOM uint32_t SYNCESC : 1; /*!< [17..17] LPDT Sync Error Interrupt Enable                                 */
            __IOM uint32_t CTRL    : 1; /*!< [18..18] Control Error Interrupt Enable                                   */
            __IOM uint32_t CLP0    : 1; /*!< [19..19] LP0 Contention Error Interrupt Enable                            */
            __IOM uint32_t CLP1    : 1; /*!< [20..20] LP1 Contention Error Interrupt Enable                            */
            uint32_t               : 11;
        } FERRIER_b;
    };
    __IM uint32_t RESERVED11[2];

    union
    {
        __IOM uint32_t CLSTPTSETR;     /*!< (@ 0x00000314) Clock Lane Stop Time Set Register                          */

        struct
        {
            uint32_t               : 2;
            __IOM uint32_t CLKSTPT : 10; /*!< [11..2] Clock Stop Time                                                   */
            uint32_t               : 4;
            __IOM uint32_t CLKBFHT : 8;  /*!< [23..16] Clock Beforehand Time                                            */
            __IOM uint32_t CLKKPT  : 8;  /*!< [31..24] Clock Keep Time                                                  */
        } CLSTPTSETR_b;
    };

    union
    {
        __IOM uint32_t LPTRNSTSETR;      /*!< (@ 0x00000318) LP Transition Time Set Register                            */

        struct
        {
            __IOM uint32_t GOLPBKT : 10; /*!< [9..0] Go LP and Back Time                                                */
            uint32_t               : 22;
        } LPTRNSTSETR_b;
    };
    __IM uint32_t RESERVED12;

    union
    {
        __IM uint32_t PLSR;             /*!< (@ 0x00000320) Physical Lane Status Register                              */

