RT-Thread/rt-thread/bsp/renesas/ra8d1-vision-board/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8D1BH.h
        struct
        {
            __IM uint32_t CLUAN    : 1; /*!< [0..0] Clock Lane UlpsActiveNot Status                                    */
            __IM uint32_t CLSTP    : 1; /*!< [1..1] Clock Lane Stop Status                                             */
            __IM uint32_t DL0RLE   : 1; /*!< [2..2] Data Lane-0 RxLpdtEsc Status                                       */
            __IM uint32_t DL0RUE   : 1; /*!< [3..3] Data Lane-0 RxUlpsEsc Status                                       */
            __IM uint32_t DL0UAN   : 1; /*!< [4..4] Data Lane-0 UlpsActiveNot Status                                   */
            __IM uint32_t DL1UAN   : 1; /*!< [5..5] Data Lane-1 UlpsActiveNot Status                                   */
            uint32_t               : 2;
            __IM uint32_t DL0STP   : 1; /*!< [8..8] Data Lane-0 Stop Status                                            */
            __IM uint32_t DL1STP   : 1; /*!< [9..9] Data Lane-1 Stop Status                                            */
            uint32_t               : 2;
            __IM uint32_t DL0RX2TX : 1; /*!< [12..12] Data Lane-0 RX to TX Transition Interrupt Flag                   */
            __IM uint32_t DL0TX2RX : 1; /*!< [13..13] Data Lane-0 TX to RX Transition Interrupt Flag                   */
            uint32_t               : 1;
            __IM uint32_t DL0DIR   : 1; /*!< [15..15] Data Lane-0 Direction                                            */
            uint32_t               : 8;
            __IM uint32_t CLULPENT : 1; /*!< [24..24] Clock Lane ULPS Enter Interrupt Flag                             */
            __IM uint32_t CLULPEXT : 1; /*!< [25..25] Clock Lane ULPS Exit Interrupt Flag                              */
            __IM uint32_t CLLP2HS  : 1; /*!< [26..26] Clock Lane LP to HS Transition Interrupt Flag                    */
            __IM uint32_t CLHS2LP  : 1; /*!< [27..27] Clock Lane HS to LP Transition Interrupt Flag                    */
            __IM uint32_t DLULPENT : 1; /*!< [28..28] Data Lane ULPS Enter Interrupt Flag                              */
            __IM uint32_t DLULPEXT : 1; /*!< [29..29] Data Lane ULPS Exit Interrupt Flag                               */
            uint32_t               : 2;
        } PLSR_b;
    };

    union
    {
        __IOM uint32_t PLSCR;          /*!< (@ 0x00000324) Physical Lane Status Clear Register                        */

        struct
        {
            uint32_t                : 12;
            __IOM uint32_t DL0RX2TX : 1; /*!< [12..12] Data Lane-0 RX to TX Transition Interrupt Flag Clear             */
            __IOM uint32_t DL0TX2RX : 1; /*!< [13..13] Data Lane-0 TX to RX Transition Interrupt Flag Clear             */
            uint32_t                : 10;
            __IOM uint32_t CLULPENT : 1; /*!< [24..24] Clock Lane ULPS Enter Interrupt Flag Clear                       */
            __IOM uint32_t CLULPEXT : 1; /*!< [25..25] Clock Lane ULPS Exit Interrupt Flag Clear                        */
            __IOM uint32_t CLLP2HS  : 1; /*!< [26..26] Clock Lane LP to HS Transition Interrupt Flag Clear              */
            __IOM uint32_t CLHS2LP  : 1; /*!< [27..27] Clock Lane HS to LP Transition Interrupt Flag Clear              */
            __IOM uint32_t DLULPENT : 1; /*!< [28..28] Data Lane ULPS Enter Interrupt Flag Clear                        */
            __IOM uint32_t DLULPEXT : 1; /*!< [29..29] Data Lane ULPS Exit Interrupt Flag Clear                         */
            uint32_t                : 2;
        } PLSCR_b;
    };

    union
    {
        __IOM uint32_t PLIER;          /*!< (@ 0x00000328) Physical Lane Interrupt Enable Register                    */

        struct
        {
            uint32_t                : 12;
            __IOM uint32_t DL0RX2TX : 1; /*!< [12..12] Data Lane-0 RX to TX Transition Interrupt Enable                 */
            __IOM uint32_t DL0TX2RX : 1; /*!< [13..13] Data Lane-0 TX to RX Transition Interrupt Enable                 */
            uint32_t                : 10;
            __IOM uint32_t CLULPENT : 1; /*!< [24..24] Clock Lane ULPS Enter Interrupt Enable                           */
            __IOM uint32_t CLULPEXT : 1; /*!< [25..25] Clock Lane ULPS Exit Interrupt Enable                            */
            __IOM uint32_t CLLP2HS  : 1; /*!< [26..26] Clock Lane LP to HS Transition Interrupt Enable                  */
            __IOM uint32_t CLHS2LP  : 1; /*!< [27..27] Clock Lane HS to LP Transition Interrupt Enable                  */
            __IOM uint32_t DLULPENT : 1; /*!< [28..28] Data Lane ULPS Enter Interrupt Enable                            */
            __IOM uint32_t DLULPEXT : 1; /*!< [29..29] Data Lane ULPS Exit Interrupt Enable                             */
            uint32_t                : 2;
        } PLIER_b;
    };
    __IM uint32_t RESERVED13[53];

    union
    {
        __IOM uint32_t VMSET0R;         /*!< (@ 0x00000400) Video Mode Set 0 Register                                  */

        struct
        {
            __OM uint32_t VSTART   : 1; /*!< [0..0] Video Mode Operation Start                                         */
            __OM uint32_t VSTOP    : 1; /*!< [1..1] Video Mode Operation Stop                                          */
            uint32_t               : 6;
            __IOM uint32_t HSANOLP : 1; /*!< [8..8] HSA period No LP                                                   */
            __IOM uint32_t HBPNOLP : 1; /*!< [9..9] HBP period No LP                                                   */
            __IOM uint32_t HFPNOLP : 1; /*!< [10..10] HFP period No LP                                                 */
            uint32_t               : 21;
        } VMSET0R_b;
    };

    union
    {
        __IOM uint32_t VMSET1R;        /*!< (@ 0x00000404) Video Mode Set 1 Register                                  */

        struct
        {
            uint32_t           : 2;
            __IOM uint32_t DLY : 12;   /*!< [13..2] Delay Value                                                       */
            uint32_t           : 18;
        } VMSET1R_b;
    };
    __IM uint32_t RESERVED14[2];

    union
    {
        __IM uint32_t VMSR;            /*!< (@ 0x00000410) Video Mode Status Register                                 */

        struct
        {
            __IM uint32_t START   : 1; /*!< [0..0] Video Mode Operation Start Interrupt Flag                          */
            __IM uint32_t STOP    : 1; /*!< [1..1] Video Mode Operation Stop Interrupt Flag                           */
            __IM uint32_t RUNNING : 1; /*!< [2..2] Video Mode Operation Running Status                                */
            __IM uint32_t VIRDY   : 1; /*!< [3..3] Video Mode Operation Ready Interrupt Flag                          */
            uint32_t              : 16;
            __IM uint32_t TIMERR  : 1; /*!< [20..20] Timing Error Interrupt Flag                                      */
            uint32_t              : 1;
            __IM uint32_t VBUFUDF : 1; /*!< [22..22] Video Buffer Underflow Error Interrupt Flag                      */
            __IM uint32_t VBUFOVF : 1; /*!< [23..23] Video Buffer Overflow Error Interrupt Flag                       */
            uint32_t              : 8;
        } VMSR_b;
    };

    union
    {
        __IOM uint32_t VMSCR;           /*!< (@ 0x00000414) Video Mode Status Clear Register                           */

        struct
        {
            __IOM uint32_t START   : 1; /*!< [0..0] Video Mode Operation Start Interrupt Flag Clear                    */
            __IOM uint32_t STOP    : 1; /*!< [1..1] Video Mode Operation Stop Interrupt Flag Clear                     */
            uint32_t               : 1;
            __IOM uint32_t VIRDY   : 1; /*!< [3..3] Video Mode Operation Ready Interrupt Flag Clear                    */
            uint32_t               : 16;
            __IOM uint32_t TIMERR  : 1; /*!< [20..20] Timing Error Interrupt Flag Clear                                */
            uint32_t               : 1;
            __IOM uint32_t VBUFUDF : 1; /*!< [22..22] Video Buffer Underflow Error Interrupt Flag Clear                */
            __IOM uint32_t VBUFOVF : 1; /*!< [23..23] Video Buffer Overflow Error Interrupt Flag Clear                 */
            uint32_t               : 8;
        } VMSCR_b;
    };

    union
    {
        __IOM uint32_t VMIER;           /*!< (@ 0x00000418) Video Mode Interrupt Enable Register                       */

        struct
        {
            __IOM uint32_t START   : 1; /*!< [0..0] Video Mode Operation Start Interrupt Enable                        */
            __IOM uint32_t STOP    : 1; /*!< [1..1] Video Mode Operation Stop Interrupt Enable                         */
            uint32_t               : 1;
            __IOM uint32_t VIRDY   : 1; /*!< [3..3] Video Mode Operation Ready Interrupt Enable                        */
            uint32_t               : 16;
            __IOM uint32_t TIMERR  : 1; /*!< [20..20] Timing Error Interrupt Enable                                    */
            uint32_t               : 1;
            __IOM uint32_t VBUFUDF : 1; /*!< [22..22] Video Buffer Underflow Error Interrupt Enable                    */
            __IOM uint32_t VBUFOVF : 1; /*!< [23..23] Video Buffer Overflow Error Interrupt Enable                     */
            uint32_t               : 8;
        } VMIER_b;
    };
    __IM uint32_t RESERVED15;

    union
    {
        __IOM uint32_t VMPPSETR;       /*!< (@ 0x00000420) Video Mode Pixel Packet Set Register                       */

        struct
        {
            uint32_t               : 15;
            __IOM uint32_t TXESYNC : 1; /*!< [15..15] Transmit End of Sync Pulse                                       */
            __IOM uint32_t DT      : 6; /*!< [21..16] Video Mode Data Type                                             */
            __IOM uint32_t VC      : 2; /*!< [23..22] Video Mode Virtual Channel                                       */
            uint32_t               : 8;
        } VMPPSETR_b;
    };
    __IM uint32_t RESERVED16;

    union
    {
        __IOM uint32_t VMVSSETR;       /*!< (@ 0x00000428) Video Mode Vertical Size Set Register                      */

        struct
        {
            __IOM uint32_t VSA   : 12; /*!< [11..0] VSA Lines                                                         */
            uint32_t             : 3;
            __IOM uint32_t VSPOL : 1;  /*!< [15..15] VSYNC Polarity                                                   */
            __IOM uint32_t VACT  : 15; /*!< [30..16] Vertical Active Lines                                            */
            uint32_t             : 1;
        } VMVSSETR_b;
    };

    union
    {
        __IOM uint32_t VMVPSETR;       /*!< (@ 0x0000042C) Video Mode Vertical Porch Set Register                     */

        struct
        {
            __IOM uint32_t VBP : 13;   /*!< [12..0] VBP Lines                                                         */
            uint32_t           : 3;
            __IOM uint32_t VFP : 13;   /*!< [28..16] VFP Lines                                                        */
            uint32_t           : 3;
        } VMVPSETR_b;
    };

    union
    {
        __IOM uint32_t VMHSSETR;       /*!< (@ 0x00000430) Video Mode Horizontal Size Set Register                    */

        struct
        {
            __IOM uint32_t HSA   : 12; /*!< [11..0] HSA Pixels                                                        */
            uint32_t             : 3;
            __IOM uint32_t HSPOL : 1;  /*!< [15..15] HSYNC Polarity                                                   */
            __IOM uint32_t HACT  : 15; /*!< [30..16] HACT Pixels                                                      */
            uint32_t             : 1;
        } VMHSSETR_b;
    };

    union
    {
        __IOM uint32_t VMHPSETR;       /*!< (@ 0x00000434) Video Mode Horizontal Porch Set Register                   */

        struct
        {
            __IOM uint32_t HBP : 13;   /*!< [12..0] HBP Pixels                                                        */
            uint32_t           : 3;
            __IOM uint32_t HFP : 13;   /*!< [28..16] HFP Pixels                                                       */
            uint32_t           : 3;
        } VMHPSETR_b;
    };
    __IM uint32_t RESERVED17[98];

    union
    {
        __IOM uint32_t SQCH0SET0R;     /*!< (@ 0x000005C0) Sequence Channel 0 Set 0 Register                          */

        struct
        {
            __OM uint32_t START : 1;   /*!< [0..0] Sequence Operation Start                                           */
            uint32_t            : 31;
        } SQCH0SET0R_b;
    };
    __IM uint32_t RESERVED18[3];

    union
    {
        __IM uint32_t SQCH0SR;         /*!< (@ 0x000005D0) Sequence Channel 0 Status Register                         */

        struct
        {
            uint32_t               : 2;
            __IM uint32_t RUNNING  : 1; /*!< [2..2] Sequence Operation Running Status                                  */
            uint32_t               : 1;
            __IM uint32_t AACTFIN  : 1; /*!< [4..4] All Actions Finish Interrupt Flag                                  */
            uint32_t               : 3;
            __IM uint32_t ADESFIN  : 1; /*!< [8..8] All-Descriptors Finish Interrupt Flag                              */
            uint32_t               : 7;
            __IM uint32_t DABORT   : 1; /*!< [16..16] Descriptor Abort Interrupt Flag                                  */
            uint32_t               : 2;
            __IM uint32_t SIZEERR  : 1; /*!< [19..19] Packet Size Error Interrupt Flag                                 */
            uint32_t               : 4;
            __IM uint32_t TXIBERR  : 1; /*!< [24..24] Tx Internal Bus Error Interrupt Flag                             */
            uint32_t               : 1;
            __IM uint32_t RXFERR   : 1; /*!< [26..26] Receive Fatal Error Interrupt Flag                               */
            __IM uint32_t RXFAIL   : 1; /*!< [27..27] Receive Fail Interrupt Flag                                      */
            __IM uint32_t RXPFAIL  : 1; /*!< [28..28] Receive Packet Data Fail Interrupt Flag                          */
            __IM uint32_t RXCORERR : 1; /*!< [29..29] Receive Correctable Error Interrupt Flag                         */
            __IM uint32_t RXAKE    : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet Interrupt
                                         *   Flag                                                                      */
            uint32_t : 1;
        } SQCH0SR_b;
    };

    union
    {
        __IOM uint32_t SQCH0SCR;       /*!< (@ 0x000005D4) Sequence Channel 0 Status Clear Register                   */

        struct
        {
            uint32_t                : 4;
            __IOM uint32_t AACTFIN  : 1; /*!< [4..4] All Actions Finish Interrupt Flag Clear                            */
            uint32_t                : 3;
            __IOM uint32_t ADESFIN  : 1; /*!< [8..8] All-Descriptors Finish Interrupt Flag Clear                        */
            uint32_t                : 7;
            __IOM uint32_t DABORT   : 1; /*!< [16..16] Descriptor Abort Interrupt Flag Clear                            */
            uint32_t                : 2;
            __IOM uint32_t SIZEERR  : 1; /*!< [19..19] Packet Size Error Interrupt Flag Clear                           */
            uint32_t                : 4;
            __IOM uint32_t TXIBERR  : 1; /*!< [24..24] Tx Internal Bus Error Interrupt Flag Clear                       */
            uint32_t                : 1;
            __IOM uint32_t RXFERR   : 1; /*!< [26..26] Receive Fatal Error Interrupt Flag Clear                         */
            __IOM uint32_t RXFAIL   : 1; /*!< [27..27] Receive Fail Interrupt Flag Clear                                */
            __IOM uint32_t RXPFAIL  : 1; /*!< [28..28] Receive Packet Data Fail Interrupt Flag Clear                    */
            __IOM uint32_t RXCORERR : 1; /*!< [29..29] Receive Correctable Error Interrupt Flag Clear                   */
            __IOM uint32_t RXAKE    : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet Interrupt
                                          *   Flag Clear                                                                */
            uint32_t : 1;
        } SQCH0SCR_b;
    };

    union
    {
        __IOM uint32_t SQCH0IER;       /*!< (@ 0x000005D8) Sequence Channel 0 Interrupt Enable Register               */

        struct
        {
            uint32_t                : 4;
            __IOM uint32_t AACTFIN  : 1; /*!< [4..4] All Actions Finish Interrupt Enable                                */
            uint32_t                : 3;
            __IOM uint32_t ADESFIN  : 1; /*!< [8..8] All-Descriptors Finish Interrupt Enable                            */
            uint32_t                : 7;
            __IOM uint32_t DABORT   : 1; /*!< [16..16] Descriptor Abort Interrupt Enable                                */
            uint32_t                : 2;
            __IOM uint32_t SIZEERR  : 1; /*!< [19..19] Packet Size Error Interrupt Enable                               */
            uint32_t                : 4;
            __IOM uint32_t TXIBERR  : 1; /*!< [24..24] Tx Internal Bus Error Interrupt Enable                           */
            uint32_t                : 1;
            __IOM uint32_t RXFERR   : 1; /*!< [26..26] Receive Fatal Error Interrupt Enable                             */
            __IOM uint32_t RXFAIL   : 1; /*!< [27..27] Receive Fail Interrupt Enable                                    */
            __IOM uint32_t RXPFAIL  : 1; /*!< [28..28] Receive Packet Data Fail Interrupt Enable                        */
            __IOM uint32_t RXCORERR : 1; /*!< [29..29] Receive Correctable Error Interrupt Enable                       */
            __IOM uint32_t RXAKE    : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet Interrupt
                                          *   Enable                                                                    */
            uint32_t : 1;
        } SQCH0IER_b;
    };
    __IM uint32_t RESERVED19[9];

    union
    {
        __IOM uint32_t SQCH1SET0R;     /*!< (@ 0x00000600) Sequence Channel 1 Set 0 Register                          */

        struct
        {
            __OM uint32_t START : 1;   /*!< [0..0] Sequence Operation Start                                           */
            uint32_t            : 31;
        } SQCH1SET0R_b;
    };
    __IM uint32_t RESERVED20[3];

    union
    {
        __IM uint32_t SQCH1SR;         /*!< (@ 0x00000610) Sequence Channel 1 Status Register                         */

        struct
        {
            uint32_t               : 2;
            __IM uint32_t RUNNING  : 1; /*!< [2..2] Sequence Operation Running Status                                  */
            uint32_t               : 1;
            __IM uint32_t AACTFIN  : 1; /*!< [4..4] All Actions Finish Interrupt Flag                                  */
            uint32_t               : 3;
            __IM uint32_t ADESFIN  : 1; /*!< [8..8] All-Descriptors Finish Interrupt Flag                              */
            uint32_t               : 7;
            __IM uint32_t DABORT   : 1; /*!< [16..16] Descriptor Abort Interrupt Flag                                  */
            uint32_t               : 2;
            __IM uint32_t SIZEERR  : 1; /*!< [19..19] Packet Size Error Interrupt Flag                                 */
            uint32_t               : 4;
            __IM uint32_t TXIBERR  : 1; /*!< [24..24] Tx Internal Bus Error Interrupt Flag                             */
            uint32_t               : 1;
            __IM uint32_t RXFERR   : 1; /*!< [26..26] Receive Fatal Error Interrupt Flag                               */
            __IM uint32_t RXFAIL   : 1; /*!< [27..27] Receive Fail Interrupt Flag                                      */
            __IM uint32_t RXPFAIL  : 1; /*!< [28..28] Receive Packet Data Fail Interrupt Flag                          */
            __IM uint32_t RXCORERR : 1; /*!< [29..29] Receive Correctable Error Interrupt Flag                         */
            __IM uint32_t RXAKE    : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet Interrupt
                                         *   Flag                                                                      */
            uint32_t : 1;
        } SQCH1SR_b;
    };

    union
    {
        __IOM uint32_t SQCH1SCR;       /*!< (@ 0x00000614) Sequence Channel 1 Status Clear Register                   */

        struct
        {
            uint32_t                : 4;
            __IOM uint32_t AACTFIN  : 1; /*!< [4..4] All Actions Finish Interrupt Flag Clear                            */
            uint32_t                : 3;
            __IOM uint32_t ADESFIN  : 1; /*!< [8..8] All-Descriptors Finish Interrupt Flag Clear                        */
            uint32_t                : 7;
            __IOM uint32_t DABORT   : 1; /*!< [16..16] Descriptor Abort Interrupt Flag Clear                            */
            uint32_t                : 2;
            __IOM uint32_t SIZEERR  : 1; /*!< [19..19] Packet Size Error Interrupt Flag Clear                           */
            uint32_t                : 4;
            __IOM uint32_t TXIBERR  : 1; /*!< [24..24] Tx Internal Bus Error Interrupt Flag Clear                       */
            uint32_t                : 1;
            __IOM uint32_t RXFERR   : 1; /*!< [26..26] Receive Fatal Error Interrupt Flag Clear                         */
            __IOM uint32_t RXFAIL   : 1; /*!< [27..27] Receive Fail Interrupt Flag Clear                                */
            __IOM uint32_t RXPFAIL  : 1; /*!< [28..28] Receive Packet Data Fail Interrupt Flag Clear                    */
            __IOM uint32_t RXCORERR : 1; /*!< [29..29] Receive Correctable Error Interrupt Flag Clear                   */
            __IOM uint32_t RXAKE    : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet Interrupt
                                          *   Flag Clear                                                                */
            uint32_t : 1;
        } SQCH1SCR_b;
    };

    union
    {
        __IOM uint32_t SQCH1IER;       /*!< (@ 0x00000618) Sequence Channel 1 Interrupt Enable Register               */

