RT-Thread/rt-thread/bsp/renesas/ra8d1-vision-board/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8D1BH.h
    union
    {
        union
        {
            __IOM uint32_t SQCH0DSC1DR;    /*!< (@ 0x0000079C) Sequence Channel 0 Descriptor-1 D Register                 */

            struct
            {
                __IOM uint32_t LADDR : 32; /*!< [31..0] Lower Address                                                     */
            } SQCH0DSC1DR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC1DR_L;  /*!< (@ 0x0000079C) Sequence Channel 0 Descriptor-1 D Register                 */

                    struct
                    {
                        __IOM uint16_t LADDR : 16; /*!< [15..0] Lower Address                                                     */
                    } SQCH0DSC1DR_L_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC1DR_LL; /*!< (@ 0x0000079C) Sequence Channel 0 Descriptor-1 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC1DR_LL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC1DR_LH; /*!< (@ 0x0000079D) Sequence Channel 0 Descriptor-1 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC1DR_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC1DR_H;  /*!< (@ 0x0000079E) Sequence Channel 0 Descriptor-1 D Register                 */

                    struct
                    {
                        __IOM uint16_t LADDR : 16; /*!< [15..0] Lower Address                                                     */
                    } SQCH0DSC1DR_H_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC1DR_HL; /*!< (@ 0x0000079E) Sequence Channel 0 Descriptor-1 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC1DR_HL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC1DR_HH; /*!< (@ 0x0000079F) Sequence Channel 0 Descriptor-1 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC1DR_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IOM uint32_t SQCH0DSC2AR;   /*!< (@ 0x000007A0) Sequence Channel 0 Descriptor-2 A Register                 */

            struct
            {
                __IOM uint32_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                __IOM uint32_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                __IOM uint32_t DT    : 6; /*!< [21..16] Data Type                                                        */
                __IOM uint32_t VC    : 2; /*!< [23..22] Virtual Channel                                                  */
                __IOM uint32_t FMT   : 1; /*!< [24..24] Format                                                           */
                __IOM uint32_t SPD   : 1; /*!< [25..25] Speed                                                            */
                __IOM uint32_t BTA   : 2; /*!< [27..26] Bus Turn Around                                                  */
                __IOM uint32_t NXACT : 2; /*!< [29..28] Next Action                                                      */
                uint32_t             : 2;
            } SQCH0DSC2AR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC2AR_L; /*!< (@ 0x000007A0) Sequence Channel 0 Descriptor-2 A Register                 */

                    struct
                    {
                        __IOM uint16_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        __IOM uint16_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                    } SQCH0DSC2AR_L_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC2AR_LL; /*!< (@ 0x000007A0) Sequence Channel 0 Descriptor-2 A Register                 */

                        struct
                        {
                            __IOM uint8_t DATA0 : 8;  /*!< [7..0] Data 0                                                             */
                        } SQCH0DSC2AR_LL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC2AR_LH; /*!< (@ 0x000007A1) Sequence Channel 0 Descriptor-2 A Register                 */

                        struct
                        {
                            __IOM uint8_t DATA1 : 8;  /*!< [7..0] Data 1                                                             */
                        } SQCH0DSC2AR_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC2AR_H; /*!< (@ 0x000007A2) Sequence Channel 0 Descriptor-2 A Register                 */

                    struct
                    {
                        __IOM uint16_t DT    : 6; /*!< [5..0] Data Type                                                          */
                        __IOM uint16_t VC    : 2; /*!< [7..6] Virtual Channel                                                    */
                        __IOM uint16_t FMT   : 1; /*!< [8..8] Format                                                             */
                        __IOM uint16_t SPD   : 1; /*!< [9..9] Speed                                                              */
                        __IOM uint16_t BTA   : 2; /*!< [11..10] Bus Turn Around                                                  */
                        __IOM uint16_t NXACT : 2; /*!< [13..12] Next Action                                                      */
                        uint16_t             : 2;
                    } SQCH0DSC2AR_H_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC2AR_HL; /*!< (@ 0x000007A2) Sequence Channel 0 Descriptor-2 A Register                 */

                        struct
                        {
                            __IOM uint8_t DT : 6;     /*!< [5..0] Data Type                                                          */
                            __IOM uint8_t VC : 2;     /*!< [7..6] Virtual Channel                                                    */
                        } SQCH0DSC2AR_HL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC2AR_HH; /*!< (@ 0x000007A3) Sequence Channel 0 Descriptor-2 A Register                 */

                        struct
                        {
                            __IOM uint8_t FMT   : 1;  /*!< [0..0] Format                                                             */
                            __IOM uint8_t SPD   : 1;  /*!< [1..1] Speed                                                              */
                            __IOM uint8_t BTA   : 2;  /*!< [3..2] Bus Turn Around                                                    */
                            __IOM uint8_t NXACT : 2;  /*!< [5..4] Next Action                                                        */
                            uint8_t             : 2;
                        } SQCH0DSC2AR_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        __IOM uint32_t SQCH0DSC2BR;    /*!< (@ 0x000007A4) Sequence Channel 0 Descriptor-2 B Register                 */

        struct
        {
            uint32_t             : 24;
            __IOM uint32_t DTSEL : 2;  /*!< [25..24] Data Select                                                      */
            uint32_t             : 6;
        } SQCH0DSC2BR_b;
    };

    union
    {
        union
        {
            __IOM uint32_t SQCH0DSC2CR;     /*!< (@ 0x000007A8) Sequence Channel 0 Descriptor-2 C Register                 */

            struct
            {
                __IOM uint32_t FINACT  : 1; /*!< [0..0] Finish Action                                                      */
                uint32_t               : 21;
                __IOM uint32_t AUXOP   : 1; /*!< [22..22] Auxiliary Operation                                              */
                uint32_t               : 1;
                __IOM uint32_t ACTCODE : 8; /*!< [31..24] Action Code                                                      */
            } SQCH0DSC2CR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC2CR_L;  /*!< (@ 0x000007A8) Sequence Channel 0 Descriptor-2 C Register                 */

                    struct
                    {
                        __IOM uint16_t FINACT : 1; /*!< [0..0] Finish Action                                                      */
                        uint16_t              : 15;
                    } SQCH0DSC2CR_L_b;
                };

                union
                {
                    __IOM uint8_t SQCH0DSC2CR_LL; /*!< (@ 0x000007A8) Sequence Channel 0 Descriptor-2 C Register                 */

                    struct
                    {
                        __IOM uint8_t FINACT : 1; /*!< [0..0] Finish Action                                                      */
                        uint8_t              : 7;
                    } SQCH0DSC2CR_LL_b;
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC2CR_H; /*!< (@ 0x000007AA) Sequence Channel 0 Descriptor-2 C Register                 */

                    struct
                    {
                        uint16_t               : 6;
                        __IOM uint16_t AUXOP   : 1; /*!< [6..6] Auxiliary Operation                                                */
                        uint16_t               : 1;
                        __IOM uint16_t ACTCODE : 8; /*!< [15..8] Action Code                                                       */
                    } SQCH0DSC2CR_H_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC2CR_HL; /*!< (@ 0x000007AA) Sequence Channel 0 Descriptor-2 C Register                 */

                        struct
                        {
                            uint8_t             : 6;
                            __IOM uint8_t AUXOP : 1; /*!< [6..6] Auxiliary Operation                                                */
                            uint8_t             : 1;
                        } SQCH0DSC2CR_HL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC2CR_HH;  /*!< (@ 0x000007AB) Sequence Channel 0 Descriptor-2 C Register                 */

                        struct
                        {
                            __IOM uint8_t ACTCODE : 8; /*!< [7..0] Action Code                                                        */
                        } SQCH0DSC2CR_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IOM uint32_t SQCH0DSC2DR;    /*!< (@ 0x000007AC) Sequence Channel 0 Descriptor-2 D Register                 */

            struct
            {
                __IOM uint32_t LADDR : 32; /*!< [31..0] Lower Address                                                     */
            } SQCH0DSC2DR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC2DR_L;  /*!< (@ 0x000007AC) Sequence Channel 0 Descriptor-2 D Register                 */

                    struct
                    {
                        __IOM uint16_t LADDR : 16; /*!< [15..0] Lower Address                                                     */
                    } SQCH0DSC2DR_L_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC2DR_LL; /*!< (@ 0x000007AC) Sequence Channel 0 Descriptor-2 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC2DR_LL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC2DR_LH; /*!< (@ 0x000007AD) Sequence Channel 0 Descriptor-2 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC2DR_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC2DR_H;  /*!< (@ 0x000007AE) Sequence Channel 0 Descriptor-2 D Register                 */

                    struct
                    {
                        __IOM uint16_t LADDR : 16; /*!< [15..0] Lower Address                                                     */
                    } SQCH0DSC2DR_H_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC2DR_HL; /*!< (@ 0x000007AE) Sequence Channel 0 Descriptor-2 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC2DR_HL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC2DR_HH; /*!< (@ 0x000007AF) Sequence Channel 0 Descriptor-2 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC2DR_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IOM uint32_t SQCH0DSC3AR;   /*!< (@ 0x000007B0) Sequence Channel 0 Descriptor-3 A Register                 */

            struct
            {
                __IOM uint32_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                __IOM uint32_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                __IOM uint32_t DT    : 6; /*!< [21..16] Data Type                                                        */
                __IOM uint32_t VC    : 2; /*!< [23..22] Virtual Channel                                                  */
                __IOM uint32_t FMT   : 1; /*!< [24..24] Format                                                           */
                __IOM uint32_t SPD   : 1; /*!< [25..25] Speed                                                            */
                __IOM uint32_t BTA   : 2; /*!< [27..26] Bus Turn Around                                                  */
                __IOM uint32_t NXACT : 2; /*!< [29..28] Next Action                                                      */
                uint32_t             : 2;
            } SQCH0DSC3AR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC3AR_L; /*!< (@ 0x000007B0) Sequence Channel 0 Descriptor-3 A Register                 */

                    struct
                    {
                        __IOM uint16_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        __IOM uint16_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                    } SQCH0DSC3AR_L_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC3AR_LL; /*!< (@ 0x000007B0) Sequence Channel 0 Descriptor-3 A Register                 */

                        struct
                        {
                            __IOM uint8_t DATA0 : 8;  /*!< [7..0] Data 0                                                             */
                        } SQCH0DSC3AR_LL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC3AR_LH; /*!< (@ 0x000007B1) Sequence Channel 0 Descriptor-3 A Register                 */

                        struct
                        {
                            __IOM uint8_t DATA1 : 8;  /*!< [7..0] Data 1                                                             */
                        } SQCH0DSC3AR_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC3AR_H; /*!< (@ 0x000007B2) Sequence Channel 0 Descriptor-3 A Register                 */

                    struct
                    {
                        __IOM uint16_t DT    : 6; /*!< [5..0] Data Type                                                          */
                        __IOM uint16_t VC    : 2; /*!< [7..6] Virtual Channel                                                    */
                        __IOM uint16_t FMT   : 1; /*!< [8..8] Format                                                             */
                        __IOM uint16_t SPD   : 1; /*!< [9..9] Speed                                                              */
                        __IOM uint16_t BTA   : 2; /*!< [11..10] Bus Turn Around                                                  */
                        __IOM uint16_t NXACT : 2; /*!< [13..12] Next Action                                                      */
                        uint16_t             : 2;
                    } SQCH0DSC3AR_H_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC3AR_HL; /*!< (@ 0x000007B2) Sequence Channel 0 Descriptor-3 A Register                 */

                        struct
                        {
                            __IOM uint8_t DT : 6;     /*!< [5..0] Data Type                                                          */
                            __IOM uint8_t VC : 2;     /*!< [7..6] Virtual Channel                                                    */
                        } SQCH0DSC3AR_HL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC3AR_HH; /*!< (@ 0x000007B3) Sequence Channel 0 Descriptor-3 A Register                 */

                        struct
                        {
                            __IOM uint8_t FMT   : 1;  /*!< [0..0] Format                                                             */
                            __IOM uint8_t SPD   : 1;  /*!< [1..1] Speed                                                              */
                            __IOM uint8_t BTA   : 2;  /*!< [3..2] Bus Turn Around                                                    */
                            __IOM uint8_t NXACT : 2;  /*!< [5..4] Next Action                                                        */
                            uint8_t             : 2;
                        } SQCH0DSC3AR_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        __IOM uint32_t SQCH0DSC3BR;    /*!< (@ 0x000007B4) Sequence Channel 0 Descriptor-3 B Register                 */

        struct
        {
            uint32_t             : 24;
            __IOM uint32_t DTSEL : 2;  /*!< [25..24] Data Select                                                      */
            uint32_t             : 6;
        } SQCH0DSC3BR_b;
    };

    union
    {
        union
        {
            __IOM uint32_t SQCH0DSC3CR;     /*!< (@ 0x000007B8) Sequence Channel 0 Descriptor-3 C Register                 */

            struct
            {
                __IOM uint32_t FINACT  : 1; /*!< [0..0] Finish Action                                                      */
                uint32_t               : 21;
                __IOM uint32_t AUXOP   : 1; /*!< [22..22] Auxiliary Operation                                              */
                uint32_t               : 1;
                __IOM uint32_t ACTCODE : 8; /*!< [31..24] Action Code                                                      */
            } SQCH0DSC3CR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC3CR_L;  /*!< (@ 0x000007B8) Sequence Channel 0 Descriptor-3 C Register                 */

                    struct
                    {
                        __IOM uint16_t FINACT : 1; /*!< [0..0] Finish Action                                                      */
                        uint16_t              : 15;
                    } SQCH0DSC3CR_L_b;
                };

                union
                {
                    __IOM uint8_t SQCH0DSC3CR_LL; /*!< (@ 0x000007B8) Sequence Channel 0 Descriptor-3 C Register                 */

                    struct
                    {
                        __IOM uint8_t FINACT : 1; /*!< [0..0] Finish Action                                                      */
                        uint8_t              : 7;
                    } SQCH0DSC3CR_LL_b;
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC3CR_H; /*!< (@ 0x000007BA) Sequence Channel 0 Descriptor-3 C Register                 */

