RT-Thread/rt-thread/bsp/renesas/ra8d1-vision-board/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8D1BH.h
                    union
                    {
                        __IOM uint8_t SQCH1DSC7AR_LH; /*!< (@ 0x00000871) Sequence Channel 1 Descriptor-7 A Register                 */

                        struct
                        {
                            __IOM uint8_t DATA1 : 8;  /*!< [7..0] Data 1                                                             */
                        } SQCH1DSC7AR_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH1DSC7AR_H; /*!< (@ 0x00000872) Sequence Channel 1 Descriptor-7 A Register                 */

                    struct
                    {
                        __IOM uint16_t DT    : 6; /*!< [5..0] Data Type                                                          */
                        __IOM uint16_t VC    : 2; /*!< [7..6] Virtual Channel                                                    */
                        __IOM uint16_t FMT   : 1; /*!< [8..8] Format                                                             */
                        __IOM uint16_t SPD   : 1; /*!< [9..9] Speed                                                              */
                        __IOM uint16_t BTA   : 2; /*!< [11..10] Bus Turn Around                                                  */
                        __IOM uint16_t NXACT : 2; /*!< [13..12] Next Action                                                      */
                        uint16_t             : 2;
                    } SQCH1DSC7AR_H_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH1DSC7AR_HL; /*!< (@ 0x00000872) Sequence Channel 1 Descriptor-7 A Register                 */

                        struct
                        {
                            __IOM uint8_t DT : 6;     /*!< [5..0] Data Type                                                          */
                            __IOM uint8_t VC : 2;     /*!< [7..6] Virtual Channel                                                    */
                        } SQCH1DSC7AR_HL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH1DSC7AR_HH; /*!< (@ 0x00000873) Sequence Channel 1 Descriptor-7 A Register                 */

                        struct
                        {
                            __IOM uint8_t FMT   : 1;  /*!< [0..0] Format                                                             */
                            __IOM uint8_t SPD   : 1;  /*!< [1..1] Speed                                                              */
                            __IOM uint8_t BTA   : 2;  /*!< [3..2] Bus Turn Around                                                    */
                            __IOM uint8_t NXACT : 2;  /*!< [5..4] Next Action                                                        */
                            uint8_t             : 2;
                        } SQCH1DSC7AR_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        __IOM uint32_t SQCH1DSC7BR;    /*!< (@ 0x00000874) Sequence Channel 1 Descriptor-7 B Register                 */

        struct
        {
            uint32_t             : 24;
            __IOM uint32_t DTSEL : 2;  /*!< [25..24] Data Select                                                      */
            uint32_t             : 6;
        } SQCH1DSC7BR_b;
    };

    union
    {
        union
        {
            __IOM uint32_t SQCH1DSC7CR;     /*!< (@ 0x00000878) Sequence Channel 1 Descriptor-7 C Register                 */

            struct
            {
                __IOM uint32_t FINACT  : 1; /*!< [0..0] Finish Action                                                      */
                uint32_t               : 21;
                __IOM uint32_t AUXOP   : 1; /*!< [22..22] Auxiliary Operation                                              */
                uint32_t               : 1;
                __IOM uint32_t ACTCODE : 8; /*!< [31..24] Action Code                                                      */
            } SQCH1DSC7CR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH1DSC7CR_L;  /*!< (@ 0x00000878) Sequence Channel 1 Descriptor-7 C Register                 */

                    struct
                    {
                        __IOM uint16_t FINACT : 1; /*!< [0..0] Finish Action                                                      */
                        uint16_t              : 15;
                    } SQCH1DSC7CR_L_b;
                };

                union
                {
                    __IOM uint8_t SQCH1DSC7CR_LL; /*!< (@ 0x00000878) Sequence Channel 1 Descriptor-7 C Register                 */

                    struct
                    {
                        __IOM uint8_t FINACT : 1; /*!< [0..0] Finish Action                                                      */
                        uint8_t              : 7;
                    } SQCH1DSC7CR_LL_b;
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH1DSC7CR_H; /*!< (@ 0x0000087A) Sequence Channel 1 Descriptor-7 C Register                 */

                    struct
                    {
                        uint16_t               : 6;
                        __IOM uint16_t AUXOP   : 1; /*!< [6..6] Auxiliary Operation                                                */
                        uint16_t               : 1;
                        __IOM uint16_t ACTCODE : 8; /*!< [15..8] Action Code                                                       */
                    } SQCH1DSC7CR_H_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH1DSC7CR_HL; /*!< (@ 0x0000087A) Sequence Channel 1 Descriptor-7 C Register                 */

                        struct
                        {
                            uint8_t             : 6;
                            __IOM uint8_t AUXOP : 1; /*!< [6..6] Auxiliary Operation                                                */
                            uint8_t             : 1;
                        } SQCH1DSC7CR_HL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH1DSC7CR_HH;  /*!< (@ 0x0000087B) Sequence Channel 1 Descriptor-7 C Register                 */

                        struct
                        {
                            __IOM uint8_t ACTCODE : 8; /*!< [7..0] Action Code                                                        */
                        } SQCH1DSC7CR_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IOM uint32_t SQCH1DSC7DR;    /*!< (@ 0x0000087C) Sequence Channel 1 Descriptor-7 D Register                 */

            struct
            {
                __IOM uint32_t LADDR : 32; /*!< [31..0] Lower Address                                                     */
            } SQCH1DSC7DR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH1DSC7DR_L;  /*!< (@ 0x0000087C) Sequence Channel 1 Descriptor-7 D Register                 */

                    struct
                    {
                        __IOM uint16_t LADDR : 16; /*!< [15..0] Lower Address                                                     */
                    } SQCH1DSC7DR_L_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH1DSC7DR_LL; /*!< (@ 0x0000087C) Sequence Channel 1 Descriptor-7 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH1DSC7DR_LL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH1DSC7DR_LH; /*!< (@ 0x0000087D) Sequence Channel 1 Descriptor-7 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH1DSC7DR_LH_b;
                    };
                };
            };

            union
            {
                __IOM uint8_t SQCH1DSC7DR_HL; /*!< (@ 0x0000087E) Sequence Channel 1 Descriptor-7 D Register                 */

                struct
                {
                    __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                } SQCH1DSC7DR_HL_b;
            };

            union
            {
                __IOM uint8_t SQCH1DSC7DR_HH; /*!< (@ 0x0000087F) Sequence Channel 1 Descriptor-7 D Register                 */

                struct
                {
                    __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                } SQCH1DSC7DR_HH_b;
            };
        };
    };
} R_DSILINK_Type;                      /*!< Size = 2176 (0x880)                                                       */

/* =========================================================================================================================== */
/* ================                                          R_FLAD                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Data Flash (R_FLAD)
 */

typedef struct                         /*!< (@ 0x4011C000) R_FLAD Structure                                           */
{
    __IM uint8_t RESERVED[64];

    union
    {
        __IOM uint8_t FCKMHZ;          /*!< (@ 0x00000040) Data Flash Access Frequency Register                       */

        struct
        {
            __IOM uint8_t FCKMHZ : 8;  /*!< [7..0] Data Flash Access Frequency Register                               */
        } FCKMHZ_b;
    };
} R_FLAD_Type;                         /*!< Size = 65 (0x41)                                                          */

/* =========================================================================================================================== */
/* ================                                      R_OFS_DATAFLASH                                      ================ */
/* =========================================================================================================================== */

/**
 * @brief Data Flash Option-Setting Memory (R_OFS_DATAFLASH)
 */

typedef struct                         /*!< (@ 0x27030000) R_OFS_DATAFLASH Structure                                  */
{
    __IM uint32_t RESERVED[32];

    union
    {
        __IM uint32_t FSBLCTRL0;          /*!< (@ 0x00000080) FSBL Control Register 0                                    */

        struct
        {
            __IM uint32_t FSBLEN     : 3; /*!< [2..0] FSBL Enable                                                        */
            __IM uint32_t FSBLSKIPSW : 3; /*!< [5..3] FSBL Skip Enable for Software Reset                                */
            __IM uint32_t FSBLSKIPDS : 3; /*!< [8..6] FSBL Skip Enable for Deep Software Standby Reset                   */
            __IM uint32_t FSBLCLK    : 3; /*!< [11..9] Clock Frequency Selection during FSBL Execution                   */
            uint32_t                 : 20;
        } FSBLCTRL0_b;
    };

    union
    {
        __IM uint32_t FSBLCTRL1;        /*!< (@ 0x00000084) FSBL Control Register 1                                    */

        struct
        {
            __IM uint32_t FSBLEXMD : 2; /*!< [1..0] FSBL Execution Mode                                                */
            uint32_t               : 30;
        } FSBLCTRL1_b;
    };

    union
    {
        __IM uint32_t FSBLCTRL2;                  /*!< (@ 0x00000088) FSBL Control Register 2                                    */

        struct
        {
            __IM uint32_t PORTPN : 4;             /*!< [3..0] FSBL Error Notification Port Pin Number                            */
            __IM uint32_t PORTGN : 5;             /*!< [8..4] FSBL Error Notification Port Group Name                            */
            uint32_t             : 23;
        } FSBLCTRL2_b;
    };
    __IOM uint32_t SACC0;                         /*!< (@ 0x0000008C) Start Address of Code Certification 0                      */
    __IOM uint32_t SACC1;                         /*!< (@ 0x00000090) Start Address of Code Certification 1                      */
    __IOM uint32_t SAMR;                          /*!< (@ 0x00000094) Start Address of Measurement Report                        */
    __IM uint32_t  RESERVED1[178];
    __IM uint32_t  HOEMRTPK;                      /*!< (@ 0x00000360) Hask of OEM_ROOT_PK                                        */
    __IM uint32_t  RESERVED2[7];
    __IOM R_OFS_DATAFLASH_CFGDLOCK_Type CFGDLOCK; /*!< (@ 0x00000380) Configuration Data Lock Bits                               */
    __IM uint32_t RESERVED3[11];

    union
    {
        __IOM uint16_t ARCLS;            /*!< (@ 0x000003C0) Anti-Rollback Counter Lock Setting                         */

        struct
        {
            __IOM uint16_t ARCS_LK  : 1; /*!< [0..0] ARC_SEC Lock                                                       */
            __IOM uint16_t ARCNS_LK : 4; /*!< [4..1] ARC_NSEC Lock                                                      */
            __IOM uint16_t ARCBL_LK : 1; /*!< [5..5] ARC_OEMBL Lock                                                     */
            uint16_t                : 10;
        } ARCLS_b;
    };

    union
    {
        __IOM uint16_t ARCCS;             /*!< (@ 0x000003C2) ARCCS                                                      */

        struct
        {
            __IOM uint16_t CNF_ARCNS : 2; /*!< [1..0] Configuation setting for ARC_NSEC                                  */
            uint16_t                 : 14;
        } ARCCS_b;
    };
    __IM uint32_t RESERVED4[291];

    union
    {
        __IOM uint32_t ARC_SEC[2];       /*!< (@ 0x00000850) Anti-Rollback Counter for Secure Application
                                          *                  n                                                          */

        struct
        {
            __IOM uint32_t ARC_SEC : 32; /*!< [31..0] ARC_SEC                                                           */
        } ARC_SEC_b[2];
    };

    union
    {
        __IOM uint32_t ARC_NSEC[8];       /*!< (@ 0x00000858) Anti-Rollback Counter for Non-Secure Application           */

        struct
        {
            __IOM uint32_t ARC_NSEC : 32; /*!< [31..0] Anti-Rollback Counter for Non-secure Application                  */
        } ARC_NSEC_b[8];
    };

    union
    {
        __IOM uint32_t ARC_OEMBL[2];       /*!< (@ 0x00000878) Anti-Rollback Counter for OEMBL                            */

        struct
        {
            __IOM uint32_t ARC_OEMBL : 32; /*!< [31..0] Anti-Rollback Counter for OEM_BL Application                      */
        } ARC_OEMBL_b[2];
    };
} R_OFS_DATAFLASH_Type;                    /*!< Size = 2176 (0x880)                                                       */

