RT-Thread/rt-thread/bsp/renesas/ra8d1-vision-board/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8D1BH.h
 #define R_XSPI_INTE_PATCMPE_Msk          (0x2UL)        /*!< PATCMPE (Bitfield-Mask: 0x01)                         */
 #define R_XSPI_INTE_INICMPE_Pos          (2UL)          /*!< INICMPE (Bit 2)                                       */
 #define R_XSPI_INTE_INICMPE_Msk          (0x4UL)        /*!< INICMPE (Bitfield-Mask: 0x01)                         */
 #define R_XSPI_INTE_PERTOE_Pos           (3UL)          /*!< PERTOE (Bit 3)                                        */
 #define R_XSPI_INTE_PERTOE_Msk           (0x8UL)        /*!< PERTOE (Bitfield-Mask: 0x01)                          */
 #define R_XSPI_INTE_DSTOCSE_Pos          (4UL)          /*!< DSTOCSE (Bit 4)                                       */
 #define R_XSPI_INTE_DSTOCSE_Msk          (0x10UL)       /*!< DSTOCSE (Bitfield-Mask: 0x01)                         */
 #define R_XSPI_INTE_ECSCSE_Pos           (8UL)          /*!< ECSCSE (Bit 8)                                        */
 #define R_XSPI_INTE_ECSCSE_Msk           (0x100UL)      /*!< ECSCSE (Bitfield-Mask: 0x01)                          */
 #define R_XSPI_INTE_INTCSE_Pos           (12UL)         /*!< INTCSE (Bit 12)                                       */
 #define R_XSPI_INTE_INTCSE_Msk           (0x1000UL)     /*!< INTCSE (Bitfield-Mask: 0x01)                          */
 #define R_XSPI_INTE_BRGOFCHE_Pos         (16UL)         /*!< BRGOFCHE (Bit 16)                                     */
 #define R_XSPI_INTE_BRGOFCHE_Msk         (0x10000UL)    /*!< BRGOFCHE (Bitfield-Mask: 0x01)                        */
 #define R_XSPI_INTE_BRGUFCHE_Pos         (18UL)         /*!< BRGUFCHE (Bit 18)                                     */
 #define R_XSPI_INTE_BRGUFCHE_Msk         (0x40000UL)    /*!< BRGUFCHE (Bitfield-Mask: 0x01)                        */
 #define R_XSPI_INTE_BUSERRCHE_Pos        (20UL)         /*!< BUSERRCHE (Bit 20)                                    */
 #define R_XSPI_INTE_BUSERRCHE_Msk        (0x100000UL)   /*!< BUSERRCHE (Bitfield-Mask: 0x01)                       */
 #define R_XSPI_INTE_CAFAILCSE_Pos        (28UL)         /*!< CAFAILCSE (Bit 28)                                    */
 #define R_XSPI_INTE_CAFAILCSE_Msk        (0x10000000UL) /*!< CAFAILCSE (Bitfield-Mask: 0x01)                       */
 #define R_XSPI_INTE_CASUCCSE_Pos         (30UL)         /*!< CASUCCSE (Bit 30)                                     */
 #define R_XSPI_INTE_CASUCCSE_Msk         (0x40000000UL) /*!< CASUCCSE (Bitfield-Mask: 0x01)                        */

/* =========================================================================================================================== */
/* ================                                           R_CEU                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  CAPSR  ========================================================= */
 #define R_CEU_CAPSR_CE_Pos              (0UL)          /*!< CE (Bit 0)                                            */
 #define R_CEU_CAPSR_CE_Msk              (0x1UL)        /*!< CE (Bitfield-Mask: 0x01)                              */
 #define R_CEU_CAPSR_CPKIL_Pos           (16UL)         /*!< CPKIL (Bit 16)                                        */
 #define R_CEU_CAPSR_CPKIL_Msk           (0x10000UL)    /*!< CPKIL (Bitfield-Mask: 0x01)                           */
/* =========================================================  CAPCR  ========================================================= */
 #define R_CEU_CAPCR_CTNCP_Pos           (16UL)         /*!< CTNCP (Bit 16)                                        */
 #define R_CEU_CAPCR_CTNCP_Msk           (0x10000UL)    /*!< CTNCP (Bitfield-Mask: 0x01)                           */
 #define R_CEU_CAPCR_MTCM_Pos            (20UL)         /*!< MTCM (Bit 20)                                         */
 #define R_CEU_CAPCR_MTCM_Msk            (0x300000UL)   /*!< MTCM (Bitfield-Mask: 0x03)                            */
 #define R_CEU_CAPCR_FDRP_Pos            (24UL)         /*!< FDRP (Bit 24)                                         */
 #define R_CEU_CAPCR_FDRP_Msk            (0xff000000UL) /*!< FDRP (Bitfield-Mask: 0xff)                            */
/* =========================================================  CAMCR  ========================================================= */
 #define R_CEU_CAMCR_HDPOL_Pos           (0UL)          /*!< HDPOL (Bit 0)                                         */
 #define R_CEU_CAMCR_HDPOL_Msk           (0x1UL)        /*!< HDPOL (Bitfield-Mask: 0x01)                           */
 #define R_CEU_CAMCR_VDPOL_Pos           (1UL)          /*!< VDPOL (Bit 1)                                         */
 #define R_CEU_CAMCR_VDPOL_Msk           (0x2UL)        /*!< VDPOL (Bitfield-Mask: 0x01)                           */
 #define R_CEU_CAMCR_JPG_Pos             (4UL)          /*!< JPG (Bit 4)                                           */
 #define R_CEU_CAMCR_JPG_Msk             (0x30UL)       /*!< JPG (Bitfield-Mask: 0x03)                             */
 #define R_CEU_CAMCR_DTARY_Pos           (8UL)          /*!< DTARY (Bit 8)                                         */
 #define R_CEU_CAMCR_DTARY_Msk           (0x300UL)      /*!< DTARY (Bitfield-Mask: 0x03)                           */
 #define R_CEU_CAMCR_DTIF_Pos            (12UL)         /*!< DTIF (Bit 12)                                         */
 #define R_CEU_CAMCR_DTIF_Msk            (0x1000UL)     /*!< DTIF (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CAMCR_FLDPOL_Pos          (16UL)         /*!< FLDPOL (Bit 16)                                       */
 #define R_CEU_CAMCR_FLDPOL_Msk          (0x10000UL)    /*!< FLDPOL (Bitfield-Mask: 0x01)                          */
 #define R_CEU_CAMCR_DSEL_Pos            (24UL)         /*!< DSEL (Bit 24)                                         */
 #define R_CEU_CAMCR_DSEL_Msk            (0x1000000UL)  /*!< DSEL (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CAMCR_FLDSEL_Pos          (25UL)         /*!< FLDSEL (Bit 25)                                       */
 #define R_CEU_CAMCR_FLDSEL_Msk          (0x2000000UL)  /*!< FLDSEL (Bitfield-Mask: 0x01)                          */
 #define R_CEU_CAMCR_HDSEL_Pos           (26UL)         /*!< HDSEL (Bit 26)                                        */
 #define R_CEU_CAMCR_HDSEL_Msk           (0x4000000UL)  /*!< HDSEL (Bitfield-Mask: 0x01)                           */
 #define R_CEU_CAMCR_VDSEL_Pos           (27UL)         /*!< VDSEL (Bit 27)                                        */
 #define R_CEU_CAMCR_VDSEL_Msk           (0x8000000UL)  /*!< VDSEL (Bitfield-Mask: 0x01)                           */
/* =========================================================  CMCYR  ========================================================= */
 #define R_CEU_CMCYR_HCYL_Pos            (0UL)          /*!< HCYL (Bit 0)                                          */
 #define R_CEU_CMCYR_HCYL_Msk            (0x3fffUL)     /*!< HCYL (Bitfield-Mask: 0x3fff)                          */
 #define R_CEU_CMCYR_VCYL_Pos            (16UL)         /*!< VCYL (Bit 16)                                         */
 #define R_CEU_CMCYR_VCYL_Msk            (0x3fff0000UL) /*!< VCYL (Bitfield-Mask: 0x3fff)                          */
/* =========================================================  CAMOR  ========================================================= */
 #define R_CEU_CAMOR_HOFST_Pos           (0UL)          /*!< HOFST (Bit 0)                                         */
 #define R_CEU_CAMOR_HOFST_Msk           (0x1fffUL)     /*!< HOFST (Bitfield-Mask: 0x1fff)                         */
 #define R_CEU_CAMOR_VOFST_Pos           (16UL)         /*!< VOFST (Bit 16)                                        */
 #define R_CEU_CAMOR_VOFST_Msk           (0xfff0000UL)  /*!< VOFST (Bitfield-Mask: 0xfff)                          */
/* =========================================================  CAPWR  ========================================================= */
 #define R_CEU_CAPWR_HWDTH_Pos           (0UL)          /*!< HWDTH (Bit 0)                                         */
 #define R_CEU_CAPWR_HWDTH_Msk           (0x1fffUL)     /*!< HWDTH (Bitfield-Mask: 0x1fff)                         */
 #define R_CEU_CAPWR_VWDTH_Pos           (16UL)         /*!< VWDTH (Bit 16)                                        */
 #define R_CEU_CAPWR_VWDTH_Msk           (0xfff0000UL)  /*!< VWDTH (Bitfield-Mask: 0xfff)                          */
/* =========================================================  CAIFR  ========================================================= */
 #define R_CEU_CAIFR_FCI_Pos             (0UL)          /*!< FCI (Bit 0)                                           */
 #define R_CEU_CAIFR_FCI_Msk             (0x3UL)        /*!< FCI (Bitfield-Mask: 0x03)                             */
 #define R_CEU_CAIFR_CIM_Pos             (4UL)          /*!< CIM (Bit 4)                                           */
 #define R_CEU_CAIFR_CIM_Msk             (0x10UL)       /*!< CIM (Bitfield-Mask: 0x01)                             */
 #define R_CEU_CAIFR_IFS_Pos             (8UL)          /*!< IFS (Bit 8)                                           */
 #define R_CEU_CAIFR_IFS_Msk             (0x100UL)      /*!< IFS (Bitfield-Mask: 0x01)                             */
/* ========================================================  CRCNTR  ========================================================= */
 #define R_CEU_CRCNTR_RC_Pos             (0UL)          /*!< RC (Bit 0)                                            */
 #define R_CEU_CRCNTR_RC_Msk             (0x1UL)        /*!< RC (Bitfield-Mask: 0x01)                              */
 #define R_CEU_CRCNTR_RS_Pos             (1UL)          /*!< RS (Bit 1)                                            */
 #define R_CEU_CRCNTR_RS_Msk             (0x2UL)        /*!< RS (Bitfield-Mask: 0x01)                              */
 #define R_CEU_CRCNTR_RVS_Pos            (4UL)          /*!< RVS (Bit 4)                                           */
 #define R_CEU_CRCNTR_RVS_Msk            (0x10UL)       /*!< RVS (Bitfield-Mask: 0x01)                             */
/* ========================================================  CRCMPR  ========================================================= */
 #define R_CEU_CRCMPR_RA_Pos             (0UL)          /*!< RA (Bit 0)                                            */
 #define R_CEU_CRCMPR_RA_Msk             (0x1UL)        /*!< RA (Bitfield-Mask: 0x01)                              */
/* =========================================================  CFLCR  ========================================================= */
 #define R_CEU_CFLCR_HFRAC_Pos           (0UL)          /*!< HFRAC (Bit 0)                                         */
 #define R_CEU_CFLCR_HFRAC_Msk           (0xfffUL)      /*!< HFRAC (Bitfield-Mask: 0xfff)                          */
 #define R_CEU_CFLCR_HMANT_Pos           (12UL)         /*!< HMANT (Bit 12)                                        */
 #define R_CEU_CFLCR_HMANT_Msk           (0xf000UL)     /*!< HMANT (Bitfield-Mask: 0x0f)                           */
 #define R_CEU_CFLCR_VFRAC_Pos           (16UL)         /*!< VFRAC (Bit 16)                                        */
 #define R_CEU_CFLCR_VFRAC_Msk           (0xfff0000UL)  /*!< VFRAC (Bitfield-Mask: 0xfff)                          */
 #define R_CEU_CFLCR_VMANT_Pos           (28UL)         /*!< VMANT (Bit 28)                                        */
 #define R_CEU_CFLCR_VMANT_Msk           (0xf0000000UL) /*!< VMANT (Bitfield-Mask: 0x0f)                           */
/* =========================================================  CFSZR  ========================================================= */
 #define R_CEU_CFSZR_HFCLP_Pos           (0UL)          /*!< HFCLP (Bit 0)                                         */
 #define R_CEU_CFSZR_HFCLP_Msk           (0xfffUL)      /*!< HFCLP (Bitfield-Mask: 0xfff)                          */
 #define R_CEU_CFSZR_VFCLP_Pos           (16UL)         /*!< VFCLP (Bit 16)                                        */
 #define R_CEU_CFSZR_VFCLP_Msk           (0xfff0000UL)  /*!< VFCLP (Bitfield-Mask: 0xfff)                          */
/* =========================================================  CDWDR  ========================================================= */
 #define R_CEU_CDWDR_CHDW_Pos            (0UL)          /*!< CHDW (Bit 0)                                          */
 #define R_CEU_CDWDR_CHDW_Msk            (0x1fffUL)     /*!< CHDW (Bitfield-Mask: 0x1fff)                          */
/* =========================================================  CDAYR  ========================================================= */
 #define R_CEU_CDAYR_CAYR_Pos            (0UL)          /*!< CAYR (Bit 0)                                          */
 #define R_CEU_CDAYR_CAYR_Msk            (0xffffffffUL) /*!< CAYR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  CDACR  ========================================================= */
 #define R_CEU_CDACR_CACR_Pos            (0UL)          /*!< CACR (Bit 0)                                          */
 #define R_CEU_CDACR_CACR_Msk            (0xffffffffUL) /*!< CACR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  CDBYR  ========================================================= */
 #define R_CEU_CDBYR_CBYR_Pos            (0UL)          /*!< CBYR (Bit 0)                                          */
 #define R_CEU_CDBYR_CBYR_Msk            (0xffffffffUL) /*!< CBYR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  CDBCR  ========================================================= */
 #define R_CEU_CDBCR_CBCR_Pos            (0UL)          /*!< CBCR (Bit 0)                                          */
 #define R_CEU_CDBCR_CBCR_Msk            (0xffffffffUL) /*!< CBCR (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  CBDSR  ========================================================= */
 #define R_CEU_CBDSR_CBVS_Pos            (0UL)          /*!< CBVS (Bit 0)                                          */
 #define R_CEU_CBDSR_CBVS_Msk            (0x7fffffUL)   /*!< CBVS (Bitfield-Mask: 0x7fffff)                        */
/* =========================================================  CFWCR  ========================================================= */
 #define R_CEU_CFWCR_FWE_Pos             (0UL)          /*!< FWE (Bit 0)                                           */
 #define R_CEU_CFWCR_FWE_Msk             (0x1UL)        /*!< FWE (Bitfield-Mask: 0x01)                             */
 #define R_CEU_CFWCR_FWV_Pos             (5UL)          /*!< FWV (Bit 5)                                           */
 #define R_CEU_CFWCR_FWV_Msk             (0xffffffe0UL) /*!< FWV (Bitfield-Mask: 0x7ffffff)                        */
/* =========================================================  CLFCR  ========================================================= */
 #define R_CEU_CLFCR_LPF_Pos             (0UL)          /*!< LPF (Bit 0)                                           */
 #define R_CEU_CLFCR_LPF_Msk             (0x1UL)        /*!< LPF (Bitfield-Mask: 0x01)                             */
/* =========================================================  CDOCR  ========================================================= */
 #define R_CEU_CDOCR_COBS_Pos            (0UL)          /*!< COBS (Bit 0)                                          */
 #define R_CEU_CDOCR_COBS_Msk            (0x1UL)        /*!< COBS (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CDOCR_COWS_Pos            (1UL)          /*!< COWS (Bit 1)                                          */
 #define R_CEU_CDOCR_COWS_Msk            (0x2UL)        /*!< COWS (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CDOCR_COLS_Pos            (2UL)          /*!< COLS (Bit 2)                                          */
 #define R_CEU_CDOCR_COLS_Msk            (0x4UL)        /*!< COLS (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CDOCR_CDS_Pos             (4UL)          /*!< CDS (Bit 4)                                           */
 #define R_CEU_CDOCR_CDS_Msk             (0x10UL)       /*!< CDS (Bitfield-Mask: 0x01)                             */
 #define R_CEU_CDOCR_CBE_Pos             (16UL)         /*!< CBE (Bit 16)                                          */
 #define R_CEU_CDOCR_CBE_Msk             (0x10000UL)    /*!< CBE (Bitfield-Mask: 0x01)                             */
/* =========================================================  CEIER  ========================================================= */
 #define R_CEU_CEIER_CPEIE_Pos           (0UL)          /*!< CPEIE (Bit 0)                                         */
 #define R_CEU_CEIER_CPEIE_Msk           (0x1UL)        /*!< CPEIE (Bitfield-Mask: 0x01)                           */
 #define R_CEU_CEIER_CFEIE_Pos           (1UL)          /*!< CFEIE (Bit 1)                                         */
 #define R_CEU_CEIER_CFEIE_Msk           (0x2UL)        /*!< CFEIE (Bitfield-Mask: 0x01)                           */
 #define R_CEU_CEIER_IGRWIE_Pos          (4UL)          /*!< IGRWIE (Bit 4)                                        */
 #define R_CEU_CEIER_IGRWIE_Msk          (0x10UL)       /*!< IGRWIE (Bitfield-Mask: 0x01)                          */
 #define R_CEU_CEIER_HDIE_Pos            (8UL)          /*!< HDIE (Bit 8)                                          */
 #define R_CEU_CEIER_HDIE_Msk            (0x100UL)      /*!< HDIE (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CEIER_VDIE_Pos            (9UL)          /*!< VDIE (Bit 9)                                          */
 #define R_CEU_CEIER_VDIE_Msk            (0x200UL)      /*!< VDIE (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CEIER_CPBE1IE_Pos         (12UL)         /*!< CPBE1IE (Bit 12)                                      */
 #define R_CEU_CEIER_CPBE1IE_Msk         (0x1000UL)     /*!< CPBE1IE (Bitfield-Mask: 0x01)                         */
 #define R_CEU_CEIER_CPBE2IE_Pos         (13UL)         /*!< CPBE2IE (Bit 13)                                      */
 #define R_CEU_CEIER_CPBE2IE_Msk         (0x2000UL)     /*!< CPBE2IE (Bitfield-Mask: 0x01)                         */
 #define R_CEU_CEIER_CPBE3IE_Pos         (14UL)         /*!< CPBE3IE (Bit 14)                                      */
 #define R_CEU_CEIER_CPBE3IE_Msk         (0x4000UL)     /*!< CPBE3IE (Bitfield-Mask: 0x01)                         */
 #define R_CEU_CEIER_CPBE4IE_Pos         (15UL)         /*!< CPBE4IE (Bit 15)                                      */
 #define R_CEU_CEIER_CPBE4IE_Msk         (0x8000UL)     /*!< CPBE4IE (Bitfield-Mask: 0x01)                         */
 #define R_CEU_CEIER_CDTOFIE_Pos         (16UL)         /*!< CDTOFIE (Bit 16)                                      */
 #define R_CEU_CEIER_CDTOFIE_Msk         (0x10000UL)    /*!< CDTOFIE (Bitfield-Mask: 0x01)                         */
 #define R_CEU_CEIER_IGHSIE_Pos          (17UL)         /*!< IGHSIE (Bit 17)                                       */
 #define R_CEU_CEIER_IGHSIE_Msk          (0x20000UL)    /*!< IGHSIE (Bitfield-Mask: 0x01)                          */
 #define R_CEU_CEIER_IGVSIE_Pos          (18UL)         /*!< IGVSIE (Bit 18)                                       */
 #define R_CEU_CEIER_IGVSIE_Msk          (0x40000UL)    /*!< IGVSIE (Bitfield-Mask: 0x01)                          */
 #define R_CEU_CEIER_VBPIE_Pos           (20UL)         /*!< VBPIE (Bit 20)                                        */
 #define R_CEU_CEIER_VBPIE_Msk           (0x100000UL)   /*!< VBPIE (Bitfield-Mask: 0x01)                           */
 #define R_CEU_CEIER_FWFIE_Pos           (23UL)         /*!< FWFIE (Bit 23)                                        */
 #define R_CEU_CEIER_FWFIE_Msk           (0x800000UL)   /*!< FWFIE (Bitfield-Mask: 0x01)                           */
 #define R_CEU_CEIER_NHDIE_Pos           (24UL)         /*!< NHDIE (Bit 24)                                        */
 #define R_CEU_CEIER_NHDIE_Msk           (0x1000000UL)  /*!< NHDIE (Bitfield-Mask: 0x01)                           */
 #define R_CEU_CEIER_NVDIE_Pos           (25UL)         /*!< NVDIE (Bit 25)                                        */
 #define R_CEU_CEIER_NVDIE_Msk           (0x2000000UL)  /*!< NVDIE (Bitfield-Mask: 0x01)                           */
/* =========================================================  CETCR  ========================================================= */
 #define R_CEU_CETCR_CPE_Pos             (0UL)          /*!< CPE (Bit 0)                                           */
 #define R_CEU_CETCR_CPE_Msk             (0x1UL)        /*!< CPE (Bitfield-Mask: 0x01)                             */
 #define R_CEU_CETCR_CFE_Pos             (1UL)          /*!< CFE (Bit 1)                                           */
 #define R_CEU_CETCR_CFE_Msk             (0x2UL)        /*!< CFE (Bitfield-Mask: 0x01)                             */
 #define R_CEU_CETCR_IGRW_Pos            (4UL)          /*!< IGRW (Bit 4)                                          */
 #define R_CEU_CETCR_IGRW_Msk            (0x10UL)       /*!< IGRW (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CETCR_HD_Pos              (8UL)          /*!< HD (Bit 8)                                            */
 #define R_CEU_CETCR_HD_Msk              (0x100UL)      /*!< HD (Bitfield-Mask: 0x01)                              */
 #define R_CEU_CETCR_VD_Pos              (9UL)          /*!< VD (Bit 9)                                            */
 #define R_CEU_CETCR_VD_Msk              (0x200UL)      /*!< VD (Bitfield-Mask: 0x01)                              */
 #define R_CEU_CETCR_CPBE1_Pos           (12UL)         /*!< CPBE1 (Bit 12)                                        */
 #define R_CEU_CETCR_CPBE1_Msk           (0x1000UL)     /*!< CPBE1 (Bitfield-Mask: 0x01)                           */
 #define R_CEU_CETCR_CPBE2_Pos           (13UL)         /*!< CPBE2 (Bit 13)                                        */
 #define R_CEU_CETCR_CPBE2_Msk           (0x2000UL)     /*!< CPBE2 (Bitfield-Mask: 0x01)                           */
 #define R_CEU_CETCR_CPBE3_Pos           (14UL)         /*!< CPBE3 (Bit 14)                                        */
 #define R_CEU_CETCR_CPBE3_Msk           (0x4000UL)     /*!< CPBE3 (Bitfield-Mask: 0x01)                           */
 #define R_CEU_CETCR_CPBE4_Pos           (15UL)         /*!< CPBE4 (Bit 15)                                        */
 #define R_CEU_CETCR_CPBE4_Msk           (0x8000UL)     /*!< CPBE4 (Bitfield-Mask: 0x01)                           */
 #define R_CEU_CETCR_CDTOF_Pos           (16UL)         /*!< CDTOF (Bit 16)                                        */
 #define R_CEU_CETCR_CDTOF_Msk           (0x10000UL)    /*!< CDTOF (Bitfield-Mask: 0x01)                           */
 #define R_CEU_CETCR_IGHS_Pos            (17UL)         /*!< IGHS (Bit 17)                                         */
 #define R_CEU_CETCR_IGHS_Msk            (0x20000UL)    /*!< IGHS (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CETCR_IGVS_Pos            (18UL)         /*!< IGVS (Bit 18)                                         */
 #define R_CEU_CETCR_IGVS_Msk            (0x40000UL)    /*!< IGVS (Bitfield-Mask: 0x01)                            */
 #define R_CEU_CETCR_VBP_Pos             (20UL)         /*!< VBP (Bit 20)                                          */
 #define R_CEU_CETCR_VBP_Msk             (0x100000UL)   /*!< VBP (Bitfield-Mask: 0x01)                             */
