RT-Thread/rt-thread/bsp/renesas/ra8d1-vision-board/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8D1BH.h
/* ========================================================  ULPTCNT  ======================================================== */
 #define R_ULPT0_ULPTCNT_ULPTCNT_Pos     (0UL)          /*!< ULPTCNT (Bit 0)                                       */
 #define R_ULPT0_ULPTCNT_ULPTCNT_Msk     (0xffffffffUL) /*!< ULPTCNT (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  ULPTCMA  ======================================================== */
 #define R_ULPT0_ULPTCMA_ULPTCMA_Pos     (0UL)          /*!< ULPTCMA (Bit 0)                                       */
 #define R_ULPT0_ULPTCMA_ULPTCMA_Msk     (0xffffffffUL) /*!< ULPTCMA (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  ULPTCMB  ======================================================== */
 #define R_ULPT0_ULPTCMB_ULPTCMB_Pos     (0UL)          /*!< ULPTCMB (Bit 0)                                       */
 #define R_ULPT0_ULPTCMB_ULPTCMB_Msk     (0xffffffffUL) /*!< ULPTCMB (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  ULPTCR  ========================================================= */
 #define R_ULPT0_ULPTCR_TSTART_Pos       (0UL)          /*!< TSTART (Bit 0)                                        */
 #define R_ULPT0_ULPTCR_TSTART_Msk       (0x1UL)        /*!< TSTART (Bitfield-Mask: 0x01)                          */
 #define R_ULPT0_ULPTCR_TCSTF_Pos        (1UL)          /*!< TCSTF (Bit 1)                                         */
 #define R_ULPT0_ULPTCR_TCSTF_Msk        (0x2UL)        /*!< TCSTF (Bitfield-Mask: 0x01)                           */
 #define R_ULPT0_ULPTCR_TSTOP_Pos        (2UL)          /*!< TSTOP (Bit 2)                                         */
 #define R_ULPT0_ULPTCR_TSTOP_Msk        (0x4UL)        /*!< TSTOP (Bitfield-Mask: 0x01)                           */
 #define R_ULPT0_ULPTCR_TUNDF_Pos        (5UL)          /*!< TUNDF (Bit 5)                                         */
 #define R_ULPT0_ULPTCR_TUNDF_Msk        (0x20UL)       /*!< TUNDF (Bitfield-Mask: 0x01)                           */
 #define R_ULPT0_ULPTCR_TCMAF_Pos        (6UL)          /*!< TCMAF (Bit 6)                                         */
 #define R_ULPT0_ULPTCR_TCMAF_Msk        (0x40UL)       /*!< TCMAF (Bitfield-Mask: 0x01)                           */
 #define R_ULPT0_ULPTCR_TCMBF_Pos        (7UL)          /*!< TCMBF (Bit 7)                                         */
 #define R_ULPT0_ULPTCR_TCMBF_Msk        (0x80UL)       /*!< TCMBF (Bitfield-Mask: 0x01)                           */
/* ========================================================  ULPTMR1  ======================================================== */
 #define R_ULPT0_ULPTMR1_TMOD1_Pos       (1UL)          /*!< TMOD1 (Bit 1)                                         */
 #define R_ULPT0_ULPTMR1_TMOD1_Msk       (0x2UL)        /*!< TMOD1 (Bitfield-Mask: 0x01)                           */
 #define R_ULPT0_ULPTMR1_TEDGPL_Pos      (3UL)          /*!< TEDGPL (Bit 3)                                        */
 #define R_ULPT0_ULPTMR1_TEDGPL_Msk      (0x8UL)        /*!< TEDGPL (Bitfield-Mask: 0x01)                          */
 #define R_ULPT0_ULPTMR1_TCK1_Pos        (5UL)          /*!< TCK1 (Bit 5)                                          */
 #define R_ULPT0_ULPTMR1_TCK1_Msk        (0x20UL)       /*!< TCK1 (Bitfield-Mask: 0x01)                            */
/* ========================================================  ULPTMR2  ======================================================== */
 #define R_ULPT0_ULPTMR2_CKS_Pos         (0UL)          /*!< CKS (Bit 0)                                           */
 #define R_ULPT0_ULPTMR2_CKS_Msk         (0x7UL)        /*!< CKS (Bitfield-Mask: 0x07)                             */
 #define R_ULPT0_ULPTMR2_LPM_Pos         (7UL)          /*!< LPM (Bit 7)                                           */
 #define R_ULPT0_ULPTMR2_LPM_Msk         (0x80UL)       /*!< LPM (Bitfield-Mask: 0x01)                             */
/* ========================================================  ULPTMR3  ======================================================== */
 #define R_ULPT0_ULPTMR3_TCNTCTL_Pos     (0UL)          /*!< TCNTCTL (Bit 0)                                       */
 #define R_ULPT0_ULPTMR3_TCNTCTL_Msk     (0x1UL)        /*!< TCNTCTL (Bitfield-Mask: 0x01)                         */
 #define R_ULPT0_ULPTMR3_TEVPOL_Pos      (1UL)          /*!< TEVPOL (Bit 1)                                        */
 #define R_ULPT0_ULPTMR3_TEVPOL_Msk      (0x2UL)        /*!< TEVPOL (Bitfield-Mask: 0x01)                          */
 #define R_ULPT0_ULPTMR3_TOPOL_Pos       (2UL)          /*!< TOPOL (Bit 2)                                         */
 #define R_ULPT0_ULPTMR3_TOPOL_Msk       (0x4UL)        /*!< TOPOL (Bitfield-Mask: 0x01)                           */
 #define R_ULPT0_ULPTMR3_TEECTL_Pos      (4UL)          /*!< TEECTL (Bit 4)                                        */
 #define R_ULPT0_ULPTMR3_TEECTL_Msk      (0x30UL)       /*!< TEECTL (Bitfield-Mask: 0x03)                          */
 #define R_ULPT0_ULPTMR3_TEEPOL_Pos      (6UL)          /*!< TEEPOL (Bit 6)                                        */
 #define R_ULPT0_ULPTMR3_TEEPOL_Msk      (0xc0UL)       /*!< TEEPOL (Bitfield-Mask: 0x03)                          */
/* ========================================================  ULPTIOC  ======================================================== */
 #define R_ULPT0_ULPTIOC_TOE_Pos         (2UL)          /*!< TOE (Bit 2)                                           */
 #define R_ULPT0_ULPTIOC_TOE_Msk         (0x4UL)        /*!< TOE (Bitfield-Mask: 0x01)                             */
 #define R_ULPT0_ULPTIOC_TIPF_Pos        (4UL)          /*!< TIPF (Bit 4)                                          */
 #define R_ULPT0_ULPTIOC_TIPF_Msk        (0x30UL)       /*!< TIPF (Bitfield-Mask: 0x03)                            */
 #define R_ULPT0_ULPTIOC_TIOGT0_Pos      (6UL)          /*!< TIOGT0 (Bit 6)                                        */
 #define R_ULPT0_ULPTIOC_TIOGT0_Msk      (0x40UL)       /*!< TIOGT0 (Bitfield-Mask: 0x01)                          */
/* ========================================================  ULPTISR  ======================================================== */
 #define R_ULPT0_ULPTISR_RCCPSEL2_Pos    (2UL)          /*!< RCCPSEL2 (Bit 2)                                      */
 #define R_ULPT0_ULPTISR_RCCPSEL2_Msk    (0x4UL)        /*!< RCCPSEL2 (Bitfield-Mask: 0x01)                        */
/* =======================================================  ULPTCMSR  ======================================================== */
 #define R_ULPT0_ULPTCMSR_TCMEA_Pos      (0UL)          /*!< TCMEA (Bit 0)                                         */
 #define R_ULPT0_ULPTCMSR_TCMEA_Msk      (0x1UL)        /*!< TCMEA (Bitfield-Mask: 0x01)                           */
 #define R_ULPT0_ULPTCMSR_TOEA_Pos       (1UL)          /*!< TOEA (Bit 1)                                          */
 #define R_ULPT0_ULPTCMSR_TOEA_Msk       (0x2UL)        /*!< TOEA (Bitfield-Mask: 0x01)                            */
 #define R_ULPT0_ULPTCMSR_TOPOLA_Pos     (2UL)          /*!< TOPOLA (Bit 2)                                        */
 #define R_ULPT0_ULPTCMSR_TOPOLA_Msk     (0x4UL)        /*!< TOPOLA (Bitfield-Mask: 0x01)                          */
 #define R_ULPT0_ULPTCMSR_TCMEB_Pos      (4UL)          /*!< TCMEB (Bit 4)                                         */
 #define R_ULPT0_ULPTCMSR_TCMEB_Msk      (0x10UL)       /*!< TCMEB (Bitfield-Mask: 0x01)                           */
 #define R_ULPT0_ULPTCMSR_TOEB_Pos       (5UL)          /*!< TOEB (Bit 5)                                          */
 #define R_ULPT0_ULPTCMSR_TOEB_Msk       (0x20UL)       /*!< TOEB (Bitfield-Mask: 0x01)                            */
 #define R_ULPT0_ULPTCMSR_TOPOLB_Pos     (6UL)          /*!< TOPOLB (Bit 6)                                        */
 #define R_ULPT0_ULPTCMSR_TOPOLB_Msk     (0x40UL)       /*!< TOPOLB (Bitfield-Mask: 0x01)                          */

/* =========================================================================================================================== */
/* ================                                        R_DEBUG_OCD                                        ================ */
/* =========================================================================================================================== */

/* =======================================================  FSBLSTATM  ======================================================= */
 #define R_DEBUG_OCD_FSBLSTATM_CS_Pos    (0UL)   /*!< CS (Bit 0)                                            */
 #define R_DEBUG_OCD_FSBLSTATM_CS_Msk    (0x1UL) /*!< CS (Bitfield-Mask: 0x01)                              */
 #define R_DEBUG_OCD_FSBLSTATM_RS_Pos    (1UL)   /*!< RS (Bit 1)                                            */
 #define R_DEBUG_OCD_FSBLSTATM_RS_Msk    (0x2UL) /*!< RS (Bitfield-Mask: 0x01)                              */

/* =========================================================================================================================== */
/* ================                                          R_DOTF                                           ================ */
/* =========================================================================================================================== */

/* ======================================================  CONVAREAST  ======================================================= */
 #define R_DOTF_CONVAREAST_CONVAREAST_Pos    (12UL)         /*!< CONVAREAST (Bit 12)                                   */
 #define R_DOTF_CONVAREAST_CONVAREAST_Msk    (0xfffff000UL) /*!< CONVAREAST (Bitfield-Mask: 0xfffff)                   */
/* =======================================================  CONVAREAD  ======================================================= */
 #define R_DOTF_CONVAREAD_CONVAREAD_Pos      (12UL)         /*!< CONVAREAD (Bit 12)                                    */
 #define R_DOTF_CONVAREAD_CONVAREAD_Msk      (0xfffff000UL) /*!< CONVAREAD (Bitfield-Mask: 0xfffff)                    */
/* =========================================================  REG00  ========================================================= */
 #define R_DOTF_REG00_B09_Pos                (9UL)          /*!< B09 (Bit 9)                                           */
 #define R_DOTF_REG00_B09_Msk                (0x200UL)      /*!< B09 (Bitfield-Mask: 0x01)                             */
 #define R_DOTF_REG00_B16_Pos                (16UL)         /*!< B16 (Bit 16)                                          */
 #define R_DOTF_REG00_B16_Msk                (0x10000UL)    /*!< B16 (Bitfield-Mask: 0x01)                             */
 #define R_DOTF_REG00_B17_Pos                (17UL)         /*!< B17 (Bit 17)                                          */
 #define R_DOTF_REG00_B17_Msk                (0x20000UL)    /*!< B17 (Bitfield-Mask: 0x01)                             */
 #define R_DOTF_REG00_B20_Pos                (20UL)         /*!< B20 (Bit 20)                                          */
 #define R_DOTF_REG00_B20_Msk                (0x100000UL)   /*!< B20 (Bitfield-Mask: 0x01)                             */
 #define R_DOTF_REG00_B24_Pos                (24UL)         /*!< B24 (Bit 24)                                          */
 #define R_DOTF_REG00_B24_Msk                (0x3000000UL)  /*!< B24 (Bitfield-Mask: 0x03)                             */
 #define R_DOTF_REG00_B28_Pos                (28UL)         /*!< B28 (Bit 28)                                          */
 #define R_DOTF_REG00_B28_Msk                (0x30000000UL) /*!< B28 (Bitfield-Mask: 0x03)                             */
/* =========================================================  REG03  ========================================================= */
 #define R_DOTF_REG03_B00_Pos                (0UL)          /*!< B00 (Bit 0)                                           */
 #define R_DOTF_REG03_B00_Msk                (0xffffffffUL) /*!< B00 (Bitfield-Mask: 0xffffffff)                       */

/* =========================================================================================================================== */
/* ================                                          R_AGTX0                                          ================ */
/* =========================================================================================================================== */

/* =========================================================================================================================== */
/* ================                                         R_DPHYCNT                                         ================ */
/* =========================================================================================================================== */

/* =======================================================  DPHYREFCR  ======================================================= */
 #define R_DPHYCNT_DPHYREFCR_RFREQ_Pos      (0UL)          /*!< RFREQ (Bit 0)                                         */
 #define R_DPHYCNT_DPHYREFCR_RFREQ_Msk      (0xffUL)       /*!< RFREQ (Bitfield-Mask: 0xff)                           */
/* =======================================================  DPHYPLFCR  ======================================================= */
 #define R_DPHYCNT_DPHYPLFCR_IDIV_Pos       (0UL)          /*!< IDIV (Bit 0)                                          */
 #define R_DPHYCNT_DPHYPLFCR_IDIV_Msk       (0x3UL)        /*!< IDIV (Bitfield-Mask: 0x03)                            */
 #define R_DPHYCNT_DPHYPLFCR_NFMUL_Pos      (8UL)          /*!< NFMUL (Bit 8)                                         */
 #define R_DPHYCNT_DPHYPLFCR_NFMUL_Msk      (0x300UL)      /*!< NFMUL (Bitfield-Mask: 0x03)                           */
 #define R_DPHYCNT_DPHYPLFCR_NMUL_Pos       (16UL)         /*!< NMUL (Bit 16)                                         */
 #define R_DPHYCNT_DPHYPLFCR_NMUL_Msk       (0xff0000UL)   /*!< NMUL (Bitfield-Mask: 0xff)                            */
/* =======================================================  DPHYPLOCR  ======================================================= */
 #define R_DPHYCNT_DPHYPLOCR_PLLSTP_Pos     (0UL)          /*!< PLLSTP (Bit 0)                                        */
 #define R_DPHYCNT_DPHYPLOCR_PLLSTP_Msk     (0x1UL)        /*!< PLLSTP (Bitfield-Mask: 0x01)                          */
/* =======================================================  DPHYESCCR  ======================================================= */
 #define R_DPHYCNT_DPHYESCCR_ESCDIV_Pos     (0UL)          /*!< ESCDIV (Bit 0)                                        */
 #define R_DPHYCNT_DPHYESCCR_ESCDIV_Msk     (0x1fUL)       /*!< ESCDIV (Bitfield-Mask: 0x1f)                          */
/* =======================================================  DPHYPWRCR  ======================================================= */
 #define R_DPHYCNT_DPHYPWRCR_PWRSEN_Pos     (0UL)          /*!< PWRSEN (Bit 0)                                        */
 #define R_DPHYCNT_DPHYPWRCR_PWRSEN_Msk     (0x1UL)        /*!< PWRSEN (Bitfield-Mask: 0x01)                          */
/* ========================================================  DPHYSFR  ======================================================== */
 #define R_DPHYCNT_DPHYSFR_PWRSF_Pos        (0UL)          /*!< PWRSF (Bit 0)                                         */
 #define R_DPHYCNT_DPHYSFR_PWRSF_Msk        (0x1UL)        /*!< PWRSF (Bitfield-Mask: 0x01)                           */
 #define R_DPHYCNT_DPHYSFR_PLLSF_Pos        (8UL)          /*!< PLLSF (Bit 8)                                         */
 #define R_DPHYCNT_DPHYSFR_PLLSF_Msk        (0x100UL)      /*!< PLLSF (Bitfield-Mask: 0x01)                           */
/* ========================================================  DPHYOCR  ======================================================== */
 #define R_DPHYCNT_DPHYOCR_DPHYEN_Pos       (0UL)          /*!< DPHYEN (Bit 0)                                        */
 #define R_DPHYCNT_DPHYOCR_DPHYEN_Msk       (0x1UL)        /*!< DPHYEN (Bitfield-Mask: 0x01)                          */
/* =======================================================  DPHYTIM1  ======================================================== */
 #define R_DPHYCNT_DPHYTIM1_TINIT_Pos       (0UL)          /*!< TINIT (Bit 0)                                         */
 #define R_DPHYCNT_DPHYTIM1_TINIT_Msk       (0x7ffffUL)    /*!< TINIT (Bitfield-Mask: 0x7ffff)                        */
/* =======================================================  DPHYTIM2  ======================================================== */
 #define R_DPHYCNT_DPHYTIM2_TCLKPREP_Pos    (0UL)          /*!< TCLKPREP (Bit 0)                                      */
 #define R_DPHYCNT_DPHYTIM2_TCLKPREP_Msk    (0xffUL)       /*!< TCLKPREP (Bitfield-Mask: 0xff)                        */
/* =======================================================  DPHYTIM3  ======================================================== */
 #define R_DPHYCNT_DPHYTIM3_THSPREP_Pos     (0UL)          /*!< THSPREP (Bit 0)                                       */
 #define R_DPHYCNT_DPHYTIM3_THSPREP_Msk     (0xffUL)       /*!< THSPREP (Bitfield-Mask: 0xff)                         */
/* =======================================================  DPHYTIM4  ======================================================== */
 #define R_DPHYCNT_DPHYTIM4_TCLKZERO_Pos    (0UL)          /*!< TCLKZERO (Bit 0)                                      */
 #define R_DPHYCNT_DPHYTIM4_TCLKZERO_Msk    (0xffUL)       /*!< TCLKZERO (Bitfield-Mask: 0xff)                        */
 #define R_DPHYCNT_DPHYTIM4_TCLKPRE_Pos     (8UL)          /*!< TCLKPRE (Bit 8)                                       */
 #define R_DPHYCNT_DPHYTIM4_TCLKPRE_Msk     (0xff00UL)     /*!< TCLKPRE (Bitfield-Mask: 0xff)                         */
 #define R_DPHYCNT_DPHYTIM4_TCLKPOST_Pos    (16UL)         /*!< TCLKPOST (Bit 16)                                     */
 #define R_DPHYCNT_DPHYTIM4_TCLKPOST_Msk    (0xff0000UL)   /*!< TCLKPOST (Bitfield-Mask: 0xff)                        */
 #define R_DPHYCNT_DPHYTIM4_TCLKTRL_Pos     (24UL)         /*!< TCLKTRL (Bit 24)                                      */
 #define R_DPHYCNT_DPHYTIM4_TCLKTRL_Msk     (0xff000000UL) /*!< TCLKTRL (Bitfield-Mask: 0xff)                         */
/* =======================================================  DPHYTIM5  ======================================================== */
 #define R_DPHYCNT_DPHYTIM5_THSZERO_Pos     (0UL)          /*!< THSZERO (Bit 0)                                       */
 #define R_DPHYCNT_DPHYTIM5_THSZERO_Msk     (0xffUL)       /*!< THSZERO (Bitfield-Mask: 0xff)                         */
 #define R_DPHYCNT_DPHYTIM5_THSTRL_Pos      (8UL)          /*!< THSTRL (Bit 8)                                        */
 #define R_DPHYCNT_DPHYTIM5_THSTRL_Msk      (0xff00UL)     /*!< THSTRL (Bitfield-Mask: 0xff)                          */
 #define R_DPHYCNT_DPHYTIM5_THSEXIT_Pos     (16UL)         /*!< THSEXIT (Bit 16)                                      */
 #define R_DPHYCNT_DPHYTIM5_THSEXIT_Msk     (0xff0000UL)   /*!< THSEXIT (Bitfield-Mask: 0xff)                         */
/* =======================================================  DPHYTIM6  ======================================================== */
 #define R_DPHYCNT_DPHYTIM6_TLPX_Pos        (0UL)          /*!< TLPX (Bit 0)                                          */
 #define R_DPHYCNT_DPHYTIM6_TLPX_Msk        (0xffUL)       /*!< TLPX (Bitfield-Mask: 0xff)                            */

/* =========================================================================================================================== */
/* ================                                         R_DSILINK                                         ================ */
/* =========================================================================================================================== */

