RT-Thread/rt-thread/bsp/renesas/ra8d1-vision-board/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8D1BH.h
/* ==========================================================  ISR  ========================================================== */
 #define R_DSILINK_ISR_SQ0_Pos                   (0UL)          /*!< SQ0 (Bit 0)                                           */
 #define R_DSILINK_ISR_SQ0_Msk                   (0x1UL)        /*!< SQ0 (Bitfield-Mask: 0x01)                             */
 #define R_DSILINK_ISR_SQ1_Pos                   (4UL)          /*!< SQ1 (Bit 4)                                           */
 #define R_DSILINK_ISR_SQ1_Msk                   (0x10UL)       /*!< SQ1 (Bitfield-Mask: 0x01)                             */
 #define R_DSILINK_ISR_VM_Pos                    (8UL)          /*!< VM (Bit 8)                                            */
 #define R_DSILINK_ISR_VM_Msk                    (0x100UL)      /*!< VM (Bitfield-Mask: 0x01)                              */
 #define R_DSILINK_ISR_RCV_Pos                   (12UL)         /*!< RCV (Bit 12)                                          */
 #define R_DSILINK_ISR_RCV_Msk                   (0x1000UL)     /*!< RCV (Bitfield-Mask: 0x01)                             */
 #define R_DSILINK_ISR_FERR_Pos                  (16UL)         /*!< FERR (Bit 16)                                         */
 #define R_DSILINK_ISR_FERR_Msk                  (0x10000UL)    /*!< FERR (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_ISR_PPI_Pos                   (20UL)         /*!< PPI (Bit 20)                                          */
 #define R_DSILINK_ISR_PPI_Msk                   (0x100000UL)   /*!< PPI (Bitfield-Mask: 0x01)                             */
/* ========================================================  LINKSR  ========================================================= */
 #define R_DSILINK_LINKSR_SQ0RUN_Pos             (0UL)          /*!< SQ0RUN (Bit 0)                                        */
 #define R_DSILINK_LINKSR_SQ0RUN_Msk             (0x1UL)        /*!< SQ0RUN (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_LINKSR_SQ1RUN_Pos             (4UL)          /*!< SQ1RUN (Bit 4)                                        */
 #define R_DSILINK_LINKSR_SQ1RUN_Msk             (0x10UL)       /*!< SQ1RUN (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_LINKSR_VRUN_Pos               (8UL)          /*!< VRUN (Bit 8)                                          */
 #define R_DSILINK_LINKSR_VRUN_Msk               (0x100UL)      /*!< VRUN (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_LINKSR_HSBUSY_Pos             (12UL)         /*!< HSBUSY (Bit 12)                                       */
 #define R_DSILINK_LINKSR_HSBUSY_Msk             (0x1000UL)     /*!< HSBUSY (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_LINKSR_LPBUSY_Pos             (13UL)         /*!< LPBUSY (Bit 13)                                       */
 #define R_DSILINK_LINKSR_LPBUSY_Msk             (0x2000UL)     /*!< LPBUSY (Bitfield-Mask: 0x01)                          */
/* ========================================================  TXSETR  ========================================================= */
 #define R_DSILINK_TXSETR_NUMLANE_Pos            (0UL)          /*!< NUMLANE (Bit 0)                                       */
 #define R_DSILINK_TXSETR_NUMLANE_Msk            (0x3UL)        /*!< NUMLANE (Bitfield-Mask: 0x03)                         */
 #define R_DSILINK_TXSETR_CLEN_Pos               (8UL)          /*!< CLEN (Bit 8)                                          */
 #define R_DSILINK_TXSETR_CLEN_Msk               (0x100UL)      /*!< CLEN (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_TXSETR_DLEN_Pos               (9UL)          /*!< DLEN (Bit 9)                                          */
 #define R_DSILINK_TXSETR_DLEN_Msk               (0x200UL)      /*!< DLEN (Bitfield-Mask: 0x01)                            */
/* =======================================================  HSCLKSETR  ======================================================= */
 #define R_DSILINK_HSCLKSETR_HSCLST_Pos          (0UL)          /*!< HSCLST (Bit 0)                                        */
 #define R_DSILINK_HSCLKSETR_HSCLST_Msk          (0x1UL)        /*!< HSCLST (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_HSCLKSETR_HSCLMD_Pos          (1UL)          /*!< HSCLMD (Bit 1)                                        */
 #define R_DSILINK_HSCLKSETR_HSCLMD_Msk          (0x2UL)        /*!< HSCLMD (Bitfield-Mask: 0x01)                          */
/* =======================================================  ULPSSETR  ======================================================== */
 #define R_DSILINK_ULPSSETR_WKUP_Pos             (0UL)          /*!< WKUP (Bit 0)                                          */
 #define R_DSILINK_ULPSSETR_WKUP_Msk             (0xffUL)       /*!< WKUP (Bitfield-Mask: 0xff)                            */
/* ========================================================  ULPSCR  ========================================================= */
 #define R_DSILINK_ULPSCR_CLENT_Pos              (24UL)         /*!< CLENT (Bit 24)                                        */
 #define R_DSILINK_ULPSCR_CLENT_Msk              (0x1000000UL)  /*!< CLENT (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_ULPSCR_CLEXIT_Pos             (25UL)         /*!< CLEXIT (Bit 25)                                       */
 #define R_DSILINK_ULPSCR_CLEXIT_Msk             (0x2000000UL)  /*!< CLEXIT (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_ULPSCR_DLENT_Pos              (28UL)         /*!< DLENT (Bit 28)                                        */
 #define R_DSILINK_ULPSCR_DLENT_Msk              (0x10000000UL) /*!< DLENT (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_ULPSCR_DLEXIT_Pos             (29UL)         /*!< DLEXIT (Bit 29)                                       */
 #define R_DSILINK_ULPSCR_DLEXIT_Msk             (0x20000000UL) /*!< DLEXIT (Bitfield-Mask: 0x01)                          */
/* =========================================================  RSTCR  ========================================================= */
 #define R_DSILINK_RSTCR_SWRST_Pos               (0UL)          /*!< SWRST (Bit 0)                                         */
 #define R_DSILINK_RSTCR_SWRST_Msk               (0x1UL)        /*!< SWRST (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_RSTCR_FTXSTP_Pos              (16UL)         /*!< FTXSTP (Bit 16)                                       */
 #define R_DSILINK_RSTCR_FTXSTP_Msk              (0x10000UL)    /*!< FTXSTP (Bitfield-Mask: 0x01)                          */
/* =========================================================  RSTSR  ========================================================= */
 #define R_DSILINK_RSTSR_RSTHS_Pos               (0UL)          /*!< RSTHS (Bit 0)                                         */
 #define R_DSILINK_RSTSR_RSTHS_Msk               (0x1UL)        /*!< RSTHS (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_RSTSR_RSTLP_Pos               (1UL)          /*!< RSTLP (Bit 1)                                         */
 #define R_DSILINK_RSTSR_RSTLP_Msk               (0x2UL)        /*!< RSTLP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_RSTSR_RSTAPB_Pos              (2UL)          /*!< RSTAPB (Bit 2)                                        */
 #define R_DSILINK_RSTSR_RSTAPB_Msk              (0x4UL)        /*!< RSTAPB (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RSTSR_RSTAXI_Pos              (3UL)          /*!< RSTAXI (Bit 3)                                        */
 #define R_DSILINK_RSTSR_RSTAXI_Msk              (0x8UL)        /*!< RSTAXI (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RSTSR_RSTV_Pos                (4UL)          /*!< RSTV (Bit 4)                                          */
 #define R_DSILINK_RSTSR_RSTV_Msk                (0x10UL)       /*!< RSTV (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_RSTSR_DL0STP_Pos              (8UL)          /*!< DL0STP (Bit 8)                                        */
 #define R_DSILINK_RSTSR_DL0STP_Msk              (0x100UL)      /*!< DL0STP (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RSTSR_DL1STP_Pos              (9UL)          /*!< DL1STP (Bit 9)                                        */
 #define R_DSILINK_RSTSR_DL1STP_Msk              (0x200UL)      /*!< DL1STP (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RSTSR_DL0DIR_Pos              (15UL)         /*!< DL0DIR (Bit 15)                                       */
 #define R_DSILINK_RSTSR_DL0DIR_Msk              (0x8000UL)     /*!< DL0DIR (Bitfield-Mask: 0x01)                          */
/* ========================================================  DSISETR  ======================================================== */
 #define R_DSILINK_DSISETR_MRPSZ_Pos             (0UL)          /*!< MRPSZ (Bit 0)                                         */
 #define R_DSILINK_DSISETR_MRPSZ_Msk             (0xffffUL)     /*!< MRPSZ (Bitfield-Mask: 0xffff)                         */
 #define R_DSILINK_DSISETR_ECCEN_Pos             (16UL)         /*!< ECCEN (Bit 16)                                        */
 #define R_DSILINK_DSISETR_ECCEN_Msk             (0x10000UL)    /*!< ECCEN (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_DSISETR_VC0CRCEN_Pos          (20UL)         /*!< VC0CRCEN (Bit 20)                                     */
 #define R_DSILINK_DSISETR_VC0CRCEN_Msk          (0x100000UL)   /*!< VC0CRCEN (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_DSISETR_VC1CRCEN_Pos          (21UL)         /*!< VC1CRCEN (Bit 21)                                     */
 #define R_DSILINK_DSISETR_VC1CRCEN_Msk          (0x200000UL)   /*!< VC1CRCEN (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_DSISETR_VC2CRCEN_Pos          (22UL)         /*!< VC2CRCEN (Bit 22)                                     */
 #define R_DSILINK_DSISETR_VC2CRCEN_Msk          (0x400000UL)   /*!< VC2CRCEN (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_DSISETR_VC3CRCEN_Pos          (23UL)         /*!< VC3CRCEN (Bit 23)                                     */
 #define R_DSILINK_DSISETR_VC3CRCEN_Msk          (0x800000UL)   /*!< VC3CRCEN (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_DSISETR_SCREN_Pos             (29UL)         /*!< SCREN (Bit 29)                                        */
 #define R_DSILINK_DSISETR_SCREN_Msk             (0x20000000UL) /*!< SCREN (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_DSISETR_EXTEMD_Pos            (30UL)         /*!< EXTEMD (Bit 30)                                       */
 #define R_DSILINK_DSISETR_EXTEMD_Msk            (0x40000000UL) /*!< EXTEMD (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_DSISETR_EOTPEN_Pos            (31UL)         /*!< EOTPEN (Bit 31)                                       */
 #define R_DSILINK_DSISETR_EOTPEN_Msk            (0x80000000UL) /*!< EOTPEN (Bitfield-Mask: 0x01)                          */
/* ========================================================  TXPPD0R  ======================================================== */
 #define R_DSILINK_TXPPD0R_DATA0_Pos             (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_DSILINK_TXPPD0R_DATA0_Msk             (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_TXPPD0R_DATA1_Pos             (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_DSILINK_TXPPD0R_DATA1_Msk             (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_TXPPD0R_DATA2_Pos             (16UL)         /*!< DATA2 (Bit 16)                                        */
 #define R_DSILINK_TXPPD0R_DATA2_Msk             (0xff0000UL)   /*!< DATA2 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_TXPPD0R_DATA3_Pos             (24UL)         /*!< DATA3 (Bit 24)                                        */
 #define R_DSILINK_TXPPD0R_DATA3_Msk             (0xff000000UL) /*!< DATA3 (Bitfield-Mask: 0xff)                           */
/* ========================================================  TXPPD1R  ======================================================== */
 #define R_DSILINK_TXPPD1R_DATA4_Pos             (0UL)          /*!< DATA4 (Bit 0)                                         */
 #define R_DSILINK_TXPPD1R_DATA4_Msk             (0xffUL)       /*!< DATA4 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_TXPPD1R_DATA5_Pos             (8UL)          /*!< DATA5 (Bit 8)                                         */
 #define R_DSILINK_TXPPD1R_DATA5_Msk             (0xff00UL)     /*!< DATA5 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_TXPPD1R_DATA6_Pos             (16UL)         /*!< DATA6 (Bit 16)                                        */
 #define R_DSILINK_TXPPD1R_DATA6_Msk             (0xff0000UL)   /*!< DATA6 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_TXPPD1R_DATA7_Pos             (24UL)         /*!< DATA7 (Bit 24)                                        */
 #define R_DSILINK_TXPPD1R_DATA7_Msk             (0xff000000UL) /*!< DATA7 (Bitfield-Mask: 0xff)                           */
/* ========================================================  TXPPD2R  ======================================================== */
 #define R_DSILINK_TXPPD2R_DATA8_Pos             (0UL)          /*!< DATA8 (Bit 0)                                         */
 #define R_DSILINK_TXPPD2R_DATA8_Msk             (0xffUL)       /*!< DATA8 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_TXPPD2R_DATA9_Pos             (8UL)          /*!< DATA9 (Bit 8)                                         */
 #define R_DSILINK_TXPPD2R_DATA9_Msk             (0xff00UL)     /*!< DATA9 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_TXPPD2R_DATA10_Pos            (16UL)         /*!< DATA10 (Bit 16)                                       */
 #define R_DSILINK_TXPPD2R_DATA10_Msk            (0xff0000UL)   /*!< DATA10 (Bitfield-Mask: 0xff)                          */
 #define R_DSILINK_TXPPD2R_DATA11_Pos            (24UL)         /*!< DATA11 (Bit 24)                                       */
 #define R_DSILINK_TXPPD2R_DATA11_Msk            (0xff000000UL) /*!< DATA11 (Bitfield-Mask: 0xff)                          */
/* ========================================================  TXPPD3R  ======================================================== */
 #define R_DSILINK_TXPPD3R_DATA12_Pos            (0UL)          /*!< DATA12 (Bit 0)                                        */
 #define R_DSILINK_TXPPD3R_DATA12_Msk            (0xffUL)       /*!< DATA12 (Bitfield-Mask: 0xff)                          */
 #define R_DSILINK_TXPPD3R_DATA13_Pos            (8UL)          /*!< DATA13 (Bit 8)                                        */
 #define R_DSILINK_TXPPD3R_DATA13_Msk            (0xff00UL)     /*!< DATA13 (Bitfield-Mask: 0xff)                          */
 #define R_DSILINK_TXPPD3R_DATA14_Pos            (16UL)         /*!< DATA14 (Bit 16)                                       */
 #define R_DSILINK_TXPPD3R_DATA14_Msk            (0xff0000UL)   /*!< DATA14 (Bitfield-Mask: 0xff)                          */
 #define R_DSILINK_TXPPD3R_DATA15_Pos            (24UL)         /*!< DATA15 (Bit 24)                                       */
 #define R_DSILINK_TXPPD3R_DATA15_Msk            (0xff000000UL) /*!< DATA15 (Bitfield-Mask: 0xff)                          */
/* =========================================================  RXSR  ========================================================== */
 #define R_DSILINK_RXSR_BTAREND_Pos              (0UL)          /*!< BTAREND (Bit 0)                                       */
 #define R_DSILINK_RXSR_BTAREND_Msk              (0x1UL)        /*!< BTAREND (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_RXSR_LRXHTO_Pos               (1UL)          /*!< LRXHTO (Bit 1)                                        */
 #define R_DSILINK_RXSR_LRXHTO_Msk               (0x2UL)        /*!< LRXHTO (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXSR_TATO_Pos                 (2UL)          /*!< TATO (Bit 2)                                          */
 #define R_DSILINK_RXSR_TATO_Msk                 (0x4UL)        /*!< TATO (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_RXSR_RXRESP_Pos               (8UL)          /*!< RXRESP (Bit 8)                                        */
 #define R_DSILINK_RXSR_RXRESP_Msk               (0x100UL)      /*!< RXRESP (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXSR_RXEOTP_Pos               (10UL)         /*!< RXEOTP (Bit 10)                                       */
 #define R_DSILINK_RXSR_RXEOTP_Msk               (0x400UL)      /*!< RXEOTP (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXSR_RXTE_Pos                 (13UL)         /*!< RXTE (Bit 13)                                         */
 #define R_DSILINK_RXSR_RXTE_Msk                 (0x2000UL)     /*!< RXTE (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_RXSR_RXACK_Pos                (14UL)         /*!< RXACK (Bit 14)                                        */
 #define R_DSILINK_RXSR_RXACK_Msk                (0x4000UL)     /*!< RXACK (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_RXSR_EXTEDET_Pos              (15UL)         /*!< EXTEDET (Bit 15)                                      */
 #define R_DSILINK_RXSR_EXTEDET_Msk              (0x8000UL)     /*!< EXTEDET (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_RXSR_MLFERR_Pos               (16UL)         /*!< MLFERR (Bit 16)                                       */
 #define R_DSILINK_RXSR_MLFERR_Msk               (0x10000UL)    /*!< MLFERR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXSR_ECCERRM_Pos              (17UL)         /*!< ECCERRM (Bit 17)                                      */
 #define R_DSILINK_RXSR_ECCERRM_Msk              (0x20000UL)    /*!< ECCERRM (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_RXSR_UNEXERR_Pos              (18UL)         /*!< UNEXERR (Bit 18)                                      */
 #define R_DSILINK_RXSR_UNEXERR_Msk              (0x40000UL)    /*!< UNEXERR (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_RXSR_WCERR_Pos                (20UL)         /*!< WCERR (Bit 20)                                        */
 #define R_DSILINK_RXSR_WCERR_Msk                (0x100000UL)   /*!< WCERR (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_RXSR_CRCERR_Pos               (21UL)         /*!< CRCERR (Bit 21)                                       */
 #define R_DSILINK_RXSR_CRCERR_Msk               (0x200000UL)   /*!< CRCERR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXSR_IBERR_Pos                (22UL)         /*!< IBERR (Bit 22)                                        */
 #define R_DSILINK_RXSR_IBERR_Msk                (0x400000UL)   /*!< IBERR (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_RXSR_RXOVFERR_Pos             (23UL)         /*!< RXOVFERR (Bit 23)                                     */
 #define R_DSILINK_RXSR_RXOVFERR_Msk             (0x800000UL)   /*!< RXOVFERR (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_RXSR_PRTOERR_Pos              (24UL)         /*!< PRTOERR (Bit 24)                                      */
 #define R_DSILINK_RXSR_PRTOERR_Msk              (0x1000000UL)  /*!< PRTOERR (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_RXSR_NORESERR_Pos             (25UL)         /*!< NORESERR (Bit 25)                                     */
 #define R_DSILINK_RXSR_NORESERR_Msk             (0x2000000UL)  /*!< NORESERR (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_RXSR_RSIZEERR_Pos             (26UL)         /*!< RSIZEERR (Bit 26)                                     */
 #define R_DSILINK_RXSR_RSIZEERR_Msk             (0x4000000UL)  /*!< RSIZEERR (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_RXSR_ECCERRS_Pos              (28UL)         /*!< ECCERRS (Bit 28)                                      */
 #define R_DSILINK_RXSR_ECCERRS_Msk              (0x10000000UL) /*!< ECCERRS (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_RXSR_RXAKE_Pos                (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_DSILINK_RXSR_RXAKE_Msk                (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
/* =========================================================  RXSCR  ========================================================= */
 #define R_DSILINK_RXSCR_BTAREND_Pos             (0UL)          /*!< BTAREND (Bit 0)                                       */
 #define R_DSILINK_RXSCR_BTAREND_Msk             (0x1UL)        /*!< BTAREND (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_RXSCR_LRXHTO_Pos              (1UL)          /*!< LRXHTO (Bit 1)                                        */
 #define R_DSILINK_RXSCR_LRXHTO_Msk              (0x2UL)        /*!< LRXHTO (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXSCR_TATO_Pos                (2UL)          /*!< TATO (Bit 2)                                          */
 #define R_DSILINK_RXSCR_TATO_Msk                (0x4UL)        /*!< TATO (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_RXSCR_RXRESP_Pos              (8UL)          /*!< RXRESP (Bit 8)                                        */
 #define R_DSILINK_RXSCR_RXRESP_Msk              (0x100UL)      /*!< RXRESP (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXSCR_RXEOTP_Pos              (10UL)         /*!< RXEOTP (Bit 10)                                       */
 #define R_DSILINK_RXSCR_RXEOTP_Msk              (0x400UL)      /*!< RXEOTP (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXSCR_RXTE_Pos                (13UL)         /*!< RXTE (Bit 13)                                         */
 #define R_DSILINK_RXSCR_RXTE_Msk                (0x2000UL)     /*!< RXTE (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_RXSCR_RXACK_Pos               (14UL)         /*!< RXACK (Bit 14)                                        */
 #define R_DSILINK_RXSCR_RXACK_Msk               (0x4000UL)     /*!< RXACK (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_RXSCR_EXTEDET_Pos             (15UL)         /*!< EXTEDET (Bit 15)                                      */
 #define R_DSILINK_RXSCR_EXTEDET_Msk             (0x8000UL)     /*!< EXTEDET (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_RXSCR_MLFERR_Pos              (16UL)         /*!< MLFERR (Bit 16)                                       */
 #define R_DSILINK_RXSCR_MLFERR_Msk              (0x10000UL)    /*!< MLFERR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXSCR_ECCERRM_Pos             (17UL)         /*!< ECCERRM (Bit 17)                                      */
 #define R_DSILINK_RXSCR_ECCERRM_Msk             (0x20000UL)    /*!< ECCERRM (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_RXSCR_UNEXERR_Pos             (18UL)         /*!< UNEXERR (Bit 18)                                      */
 #define R_DSILINK_RXSCR_UNEXERR_Msk             (0x40000UL)    /*!< UNEXERR (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_RXSCR_WCERR_Pos               (20UL)         /*!< WCERR (Bit 20)                                        */
