RT-Thread/rt-thread/bsp/renesas/ra8d1-vision-board/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8D1BH.h
 #define R_DSILINK_RXRSS0R_HH_RXPFAIL_Pos        (4UL)          /*!< RXPFAIL (Bit 4)                                       */
 #define R_DSILINK_RXRSS0R_HH_RXPFAIL_Msk        (0x10UL)       /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_RXRSS0R_HH_RXCERR_Pos         (5UL)          /*!< RXCERR (Bit 5)                                        */
 #define R_DSILINK_RXRSS0R_HH_RXCERR_Msk         (0x20UL)       /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXRSS0R_HH_RXAKE_Pos          (6UL)          /*!< RXAKE (Bit 6)                                         */
 #define R_DSILINK_RXRSS0R_HH_RXAKE_Msk          (0x40UL)       /*!< RXAKE (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_RXRSS0R_HH_INFOOW_Pos         (7UL)          /*!< INFOOW (Bit 7)                                        */
 #define R_DSILINK_RXRSS0R_HH_INFOOW_Msk         (0x80UL)       /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* ======================================================  RXRSS1R_HH  ======================================================= */
 #define R_DSILINK_RXRSS1R_HH_FMT_Pos            (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_DSILINK_RXRSS1R_HH_FMT_Msk            (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_DSILINK_RXRSS1R_HH_RXSUC_Pos          (1UL)          /*!< RXSUC (Bit 1)                                         */
 #define R_DSILINK_RXRSS1R_HH_RXSUC_Msk          (0x2UL)        /*!< RXSUC (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_RXRSS1R_HH_RXFERR_Pos         (2UL)          /*!< RXFERR (Bit 2)                                        */
 #define R_DSILINK_RXRSS1R_HH_RXFERR_Msk         (0x4UL)        /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXRSS1R_HH_RXFAIL_Pos         (3UL)          /*!< RXFAIL (Bit 3)                                        */
 #define R_DSILINK_RXRSS1R_HH_RXFAIL_Msk         (0x8UL)        /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXRSS1R_HH_RXPFAIL_Pos        (4UL)          /*!< RXPFAIL (Bit 4)                                       */
 #define R_DSILINK_RXRSS1R_HH_RXPFAIL_Msk        (0x10UL)       /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_RXRSS1R_HH_RXCERR_Pos         (5UL)          /*!< RXCERR (Bit 5)                                        */
 #define R_DSILINK_RXRSS1R_HH_RXCERR_Msk         (0x20UL)       /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXRSS1R_HH_RXAKE_Pos          (6UL)          /*!< RXAKE (Bit 6)                                         */
 #define R_DSILINK_RXRSS1R_HH_RXAKE_Msk          (0x40UL)       /*!< RXAKE (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_RXRSS1R_HH_INFOOW_Pos         (7UL)          /*!< INFOOW (Bit 7)                                        */
 #define R_DSILINK_RXRSS1R_HH_INFOOW_Msk         (0x80UL)       /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* ======================================================  RXRSS2R_HH  ======================================================= */
 #define R_DSILINK_RXRSS2R_HH_FMT_Pos            (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_DSILINK_RXRSS2R_HH_FMT_Msk            (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_DSILINK_RXRSS2R_HH_RXSUC_Pos          (1UL)          /*!< RXSUC (Bit 1)                                         */
 #define R_DSILINK_RXRSS2R_HH_RXSUC_Msk          (0x2UL)        /*!< RXSUC (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_RXRSS2R_HH_RXFERR_Pos         (2UL)          /*!< RXFERR (Bit 2)                                        */
 #define R_DSILINK_RXRSS2R_HH_RXFERR_Msk         (0x4UL)        /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXRSS2R_HH_RXFAIL_Pos         (3UL)          /*!< RXFAIL (Bit 3)                                        */
 #define R_DSILINK_RXRSS2R_HH_RXFAIL_Msk         (0x8UL)        /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXRSS2R_HH_RXPFAIL_Pos        (4UL)          /*!< RXPFAIL (Bit 4)                                       */
 #define R_DSILINK_RXRSS2R_HH_RXPFAIL_Msk        (0x10UL)       /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_RXRSS2R_HH_RXCERR_Pos         (5UL)          /*!< RXCERR (Bit 5)                                        */
 #define R_DSILINK_RXRSS2R_HH_RXCERR_Msk         (0x20UL)       /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXRSS2R_HH_RXAKE_Pos          (6UL)          /*!< RXAKE (Bit 6)                                         */
 #define R_DSILINK_RXRSS2R_HH_RXAKE_Msk          (0x40UL)       /*!< RXAKE (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_RXRSS2R_HH_INFOOW_Pos         (7UL)          /*!< INFOOW (Bit 7)                                        */
 #define R_DSILINK_RXRSS2R_HH_INFOOW_Msk         (0x80UL)       /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* ======================================================  RXRSS3R_HH  ======================================================= */
 #define R_DSILINK_RXRSS3R_HH_FMT_Pos            (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_DSILINK_RXRSS3R_HH_FMT_Msk            (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_DSILINK_RXRSS3R_HH_RXSUC_Pos          (1UL)          /*!< RXSUC (Bit 1)                                         */
 #define R_DSILINK_RXRSS3R_HH_RXSUC_Msk          (0x2UL)        /*!< RXSUC (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_RXRSS3R_HH_RXFERR_Pos         (2UL)          /*!< RXFERR (Bit 2)                                        */
 #define R_DSILINK_RXRSS3R_HH_RXFERR_Msk         (0x4UL)        /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXRSS3R_HH_RXFAIL_Pos         (3UL)          /*!< RXFAIL (Bit 3)                                        */
 #define R_DSILINK_RXRSS3R_HH_RXFAIL_Msk         (0x8UL)        /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXRSS3R_HH_RXPFAIL_Pos        (4UL)          /*!< RXPFAIL (Bit 4)                                       */
 #define R_DSILINK_RXRSS3R_HH_RXPFAIL_Msk        (0x10UL)       /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_RXRSS3R_HH_RXCERR_Pos         (5UL)          /*!< RXCERR (Bit 5)                                        */
 #define R_DSILINK_RXRSS3R_HH_RXCERR_Msk         (0x20UL)       /*!< RXCERR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_RXRSS3R_HH_RXAKE_Pos          (6UL)          /*!< RXAKE (Bit 6)                                         */
 #define R_DSILINK_RXRSS3R_HH_RXAKE_Msk          (0x40UL)       /*!< RXAKE (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_RXRSS3R_HH_INFOOW_Pos         (7UL)          /*!< INFOOW (Bit 7)                                        */
 #define R_DSILINK_RXRSS3R_HH_INFOOW_Msk         (0x80UL)       /*!< INFOOW (Bitfield-Mask: 0x01)                          */
/* ========================================================  RXPPD0R  ======================================================== */
 #define R_DSILINK_RXPPD0R_DATA0_Pos             (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_DSILINK_RXPPD0R_DATA0_Msk             (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_RXPPD0R_DATA1_Pos             (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_DSILINK_RXPPD0R_DATA1_Msk             (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_RXPPD0R_DATA2_Pos             (16UL)         /*!< DATA2 (Bit 16)                                        */
 #define R_DSILINK_RXPPD0R_DATA2_Msk             (0xff0000UL)   /*!< DATA2 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_RXPPD0R_DATA3_Pos             (24UL)         /*!< DATA3 (Bit 24)                                        */
 #define R_DSILINK_RXPPD0R_DATA3_Msk             (0xff000000UL) /*!< DATA3 (Bitfield-Mask: 0xff)                           */
/* ========================================================  RXPPD1R  ======================================================== */
 #define R_DSILINK_RXPPD1R_DATA4_Pos             (0UL)          /*!< DATA4 (Bit 0)                                         */
 #define R_DSILINK_RXPPD1R_DATA4_Msk             (0xffUL)       /*!< DATA4 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_RXPPD1R_DATA5_Pos             (8UL)          /*!< DATA5 (Bit 8)                                         */
 #define R_DSILINK_RXPPD1R_DATA5_Msk             (0xff00UL)     /*!< DATA5 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_RXPPD1R_DATA6_Pos             (16UL)         /*!< DATA6 (Bit 16)                                        */
 #define R_DSILINK_RXPPD1R_DATA6_Msk             (0xff0000UL)   /*!< DATA6 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_RXPPD1R_DATA7_Pos             (24UL)         /*!< DATA7 (Bit 24)                                        */
 #define R_DSILINK_RXPPD1R_DATA7_Msk             (0xff000000UL) /*!< DATA7 (Bitfield-Mask: 0xff)                           */
/* ========================================================  RXPPD2R  ======================================================== */
 #define R_DSILINK_RXPPD2R_DATA8_Pos             (0UL)          /*!< DATA8 (Bit 0)                                         */
 #define R_DSILINK_RXPPD2R_DATA8_Msk             (0xffUL)       /*!< DATA8 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_RXPPD2R_DATA9_Pos             (8UL)          /*!< DATA9 (Bit 8)                                         */
 #define R_DSILINK_RXPPD2R_DATA9_Msk             (0xff00UL)     /*!< DATA9 (Bitfield-Mask: 0xff)                           */
 #define R_DSILINK_RXPPD2R_DATA10_Pos            (16UL)         /*!< DATA10 (Bit 16)                                       */
 #define R_DSILINK_RXPPD2R_DATA10_Msk            (0xff0000UL)   /*!< DATA10 (Bitfield-Mask: 0xff)                          */
 #define R_DSILINK_RXPPD2R_DATA11_Pos            (24UL)         /*!< DATA11 (Bit 24)                                       */
 #define R_DSILINK_RXPPD2R_DATA11_Msk            (0xff000000UL) /*!< DATA11 (Bitfield-Mask: 0xff)                          */
/* ========================================================  RXPPD3R  ======================================================== */
 #define R_DSILINK_RXPPD3R_DATA12_Pos            (0UL)          /*!< DATA12 (Bit 0)                                        */
 #define R_DSILINK_RXPPD3R_DATA12_Msk            (0xffUL)       /*!< DATA12 (Bitfield-Mask: 0xff)                          */
 #define R_DSILINK_RXPPD3R_DATA13_Pos            (8UL)          /*!< DATA13 (Bit 8)                                        */
 #define R_DSILINK_RXPPD3R_DATA13_Msk            (0xff00UL)     /*!< DATA13 (Bitfield-Mask: 0xff)                          */
 #define R_DSILINK_RXPPD3R_DATA14_Pos            (16UL)         /*!< DATA14 (Bit 16)                                       */
 #define R_DSILINK_RXPPD3R_DATA14_Msk            (0xff0000UL)   /*!< DATA14 (Bitfield-Mask: 0xff)                          */
 #define R_DSILINK_RXPPD3R_DATA15_Pos            (24UL)         /*!< DATA15 (Bit 24)                                       */
 #define R_DSILINK_RXPPD3R_DATA15_Msk            (0xff000000UL) /*!< DATA15 (Bitfield-Mask: 0xff)                          */
/* ======================================================  HSTXTOSETR  ======================================================= */
 #define R_DSILINK_HSTXTOSETR_HTXTO_Pos          (0UL)          /*!< HTXTO (Bit 0)                                         */
 #define R_DSILINK_HSTXTOSETR_HTXTO_Msk          (0xffffffffUL) /*!< HTXTO (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  LRXHTOSETR  ======================================================= */
 #define R_DSILINK_LRXHTOSETR_LRXHTO_Pos         (0UL)          /*!< LRXHTO (Bit 0)                                        */
 #define R_DSILINK_LRXHTOSETR_LRXHTO_Msk         (0xffffffffUL) /*!< LRXHTO (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  TATOSETR  ======================================================== */
 #define R_DSILINK_TATOSETR_TATO_Pos             (0UL)          /*!< TATO (Bit 0)                                          */
 #define R_DSILINK_TATOSETR_TATO_Msk             (0xffffffffUL) /*!< TATO (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  FERRSR  ========================================================= */
 #define R_DSILINK_FERRSR_HTXTO_Pos              (0UL)          /*!< HTXTO (Bit 0)                                         */
 #define R_DSILINK_FERRSR_HTXTO_Msk              (0x1UL)        /*!< HTXTO (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_FERRSR_LRXHTO_Pos             (1UL)          /*!< LRXHTO (Bit 1)                                        */
 #define R_DSILINK_FERRSR_LRXHTO_Msk             (0x2UL)        /*!< LRXHTO (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_FERRSR_TATO_Pos               (2UL)          /*!< TATO (Bit 2)                                          */
 #define R_DSILINK_FERRSR_TATO_Msk               (0x4UL)        /*!< TATO (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_FERRSR_ESCENT_Pos             (16UL)         /*!< ESCENT (Bit 16)                                       */
 #define R_DSILINK_FERRSR_ESCENT_Msk             (0x10000UL)    /*!< ESCENT (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_FERRSR_SYNCESC_Pos            (17UL)         /*!< SYNCESC (Bit 17)                                      */
 #define R_DSILINK_FERRSR_SYNCESC_Msk            (0x20000UL)    /*!< SYNCESC (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_FERRSR_CTRL_Pos               (18UL)         /*!< CTRL (Bit 18)                                         */
 #define R_DSILINK_FERRSR_CTRL_Msk               (0x40000UL)    /*!< CTRL (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_FERRSR_CLP0_Pos               (19UL)         /*!< CLP0 (Bit 19)                                         */
 #define R_DSILINK_FERRSR_CLP0_Msk               (0x80000UL)    /*!< CLP0 (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_FERRSR_CLP1_Pos               (20UL)         /*!< CLP1 (Bit 20)                                         */
 #define R_DSILINK_FERRSR_CLP1_Msk               (0x100000UL)   /*!< CLP1 (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_FERRSR_CLP0S_Pos              (27UL)         /*!< CLP0S (Bit 27)                                        */
 #define R_DSILINK_FERRSR_CLP0S_Msk              (0x8000000UL)  /*!< CLP0S (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_FERRSR_CLP1S_Pos              (28UL)         /*!< CLP1S (Bit 28)                                        */
 #define R_DSILINK_FERRSR_CLP1S_Msk              (0x10000000UL) /*!< CLP1S (Bitfield-Mask: 0x01)                           */
/* ========================================================  FERRSCR  ======================================================== */
 #define R_DSILINK_FERRSCR_HTXTO_Pos             (0UL)          /*!< HTXTO (Bit 0)                                         */
 #define R_DSILINK_FERRSCR_HTXTO_Msk             (0x1UL)        /*!< HTXTO (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_FERRSCR_LRXHTO_Pos            (1UL)          /*!< LRXHTO (Bit 1)                                        */
 #define R_DSILINK_FERRSCR_LRXHTO_Msk            (0x2UL)        /*!< LRXHTO (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_FERRSCR_TATO_Pos              (2UL)          /*!< TATO (Bit 2)                                          */
 #define R_DSILINK_FERRSCR_TATO_Msk              (0x4UL)        /*!< TATO (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_FERRSCR_ESCENT_Pos            (16UL)         /*!< ESCENT (Bit 16)                                       */
 #define R_DSILINK_FERRSCR_ESCENT_Msk            (0x10000UL)    /*!< ESCENT (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_FERRSCR_SYNCESC_Pos           (17UL)         /*!< SYNCESC (Bit 17)                                      */
 #define R_DSILINK_FERRSCR_SYNCESC_Msk           (0x20000UL)    /*!< SYNCESC (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_FERRSCR_CTRL_Pos              (18UL)         /*!< CTRL (Bit 18)                                         */
 #define R_DSILINK_FERRSCR_CTRL_Msk              (0x40000UL)    /*!< CTRL (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_FERRSCR_CLP0_Pos              (19UL)         /*!< CLP0 (Bit 19)                                         */
 #define R_DSILINK_FERRSCR_CLP0_Msk              (0x80000UL)    /*!< CLP0 (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_FERRSCR_CLP1_Pos              (20UL)         /*!< CLP1 (Bit 20)                                         */
 #define R_DSILINK_FERRSCR_CLP1_Msk              (0x100000UL)   /*!< CLP1 (Bitfield-Mask: 0x01)                            */
/* ========================================================  FERRIER  ======================================================== */
 #define R_DSILINK_FERRIER_HTXTO_Pos             (0UL)          /*!< HTXTO (Bit 0)                                         */
 #define R_DSILINK_FERRIER_HTXTO_Msk             (0x1UL)        /*!< HTXTO (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_FERRIER_LRXHTO_Pos            (1UL)          /*!< LRXHTO (Bit 1)                                        */
 #define R_DSILINK_FERRIER_LRXHTO_Msk            (0x2UL)        /*!< LRXHTO (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_FERRIER_TATO_Pos              (2UL)          /*!< TATO (Bit 2)                                          */
 #define R_DSILINK_FERRIER_TATO_Msk              (0x4UL)        /*!< TATO (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_FERRIER_ESCENT_Pos            (16UL)         /*!< ESCENT (Bit 16)                                       */
 #define R_DSILINK_FERRIER_ESCENT_Msk            (0x10000UL)    /*!< ESCENT (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_FERRIER_SYNCESC_Pos           (17UL)         /*!< SYNCESC (Bit 17)                                      */
 #define R_DSILINK_FERRIER_SYNCESC_Msk           (0x20000UL)    /*!< SYNCESC (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_FERRIER_CTRL_Pos              (18UL)         /*!< CTRL (Bit 18)                                         */
 #define R_DSILINK_FERRIER_CTRL_Msk              (0x40000UL)    /*!< CTRL (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_FERRIER_CLP0_Pos              (19UL)         /*!< CLP0 (Bit 19)                                         */
 #define R_DSILINK_FERRIER_CLP0_Msk              (0x80000UL)    /*!< CLP0 (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_FERRIER_CLP1_Pos              (20UL)         /*!< CLP1 (Bit 20)                                         */
 #define R_DSILINK_FERRIER_CLP1_Msk              (0x100000UL)   /*!< CLP1 (Bitfield-Mask: 0x01)                            */
/* ======================================================  CLSTPTSETR  ======================================================= */
 #define R_DSILINK_CLSTPTSETR_CLKSTPT_Pos        (2UL)          /*!< CLKSTPT (Bit 2)                                       */
 #define R_DSILINK_CLSTPTSETR_CLKSTPT_Msk        (0xffcUL)      /*!< CLKSTPT (Bitfield-Mask: 0x3ff)                        */
 #define R_DSILINK_CLSTPTSETR_CLKBFHT_Pos        (16UL)         /*!< CLKBFHT (Bit 16)                                      */
 #define R_DSILINK_CLSTPTSETR_CLKBFHT_Msk        (0xff0000UL)   /*!< CLKBFHT (Bitfield-Mask: 0xff)                         */
 #define R_DSILINK_CLSTPTSETR_CLKKPT_Pos         (24UL)         /*!< CLKKPT (Bit 24)                                       */
 #define R_DSILINK_CLSTPTSETR_CLKKPT_Msk         (0xff000000UL) /*!< CLKKPT (Bitfield-Mask: 0xff)                          */
/* ======================================================  LPTRNSTSETR  ====================================================== */
 #define R_DSILINK_LPTRNSTSETR_GOLPBKT_Pos       (0UL)          /*!< GOLPBKT (Bit 0)                                       */
 #define R_DSILINK_LPTRNSTSETR_GOLPBKT_Msk       (0x3ffUL)      /*!< GOLPBKT (Bitfield-Mask: 0x3ff)                        */
/* =========================================================  PLSR  ========================================================== */
 #define R_DSILINK_PLSR_CLUAN_Pos                (0UL)          /*!< CLUAN (Bit 0)                                         */
 #define R_DSILINK_PLSR_CLUAN_Msk                (0x1UL)        /*!< CLUAN (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_PLSR_CLSTP_Pos                (1UL)          /*!< CLSTP (Bit 1)                                         */
 #define R_DSILINK_PLSR_CLSTP_Msk                (0x2UL)        /*!< CLSTP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_PLSR_DL0RLE_Pos               (2UL)          /*!< DL0RLE (Bit 2)                                        */
 #define R_DSILINK_PLSR_DL0RLE_Msk               (0x4UL)        /*!< DL0RLE (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_PLSR_DL0RUE_Pos               (3UL)          /*!< DL0RUE (Bit 3)                                        */
 #define R_DSILINK_PLSR_DL0RUE_Msk               (0x8UL)        /*!< DL0RUE (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_PLSR_DL0UAN_Pos               (4UL)          /*!< DL0UAN (Bit 4)                                        */
 #define R_DSILINK_PLSR_DL0UAN_Msk               (0x10UL)       /*!< DL0UAN (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_PLSR_DL1UAN_Pos               (5UL)          /*!< DL1UAN (Bit 5)                                        */
 #define R_DSILINK_PLSR_DL1UAN_Msk               (0x20UL)       /*!< DL1UAN (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_PLSR_DL0STP_Pos               (8UL)          /*!< DL0STP (Bit 8)                                        */
 #define R_DSILINK_PLSR_DL0STP_Msk               (0x100UL)      /*!< DL0STP (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_PLSR_DL1STP_Pos               (9UL)          /*!< DL1STP (Bit 9)                                        */
 #define R_DSILINK_PLSR_DL1STP_Msk               (0x200UL)      /*!< DL1STP (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_PLSR_DL0RX2TX_Pos             (12UL)         /*!< DL0RX2TX (Bit 12)                                     */
 #define R_DSILINK_PLSR_DL0RX2TX_Msk             (0x1000UL)     /*!< DL0RX2TX (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_PLSR_DL0TX2RX_Pos             (13UL)         /*!< DL0TX2RX (Bit 13)                                     */
