RT-Thread/rt-thread/bsp/renesas/ra8d1-vision-board/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8D1BH.h
 #define R_DSILINK_PLSR_DL0TX2RX_Msk             (0x2000UL)     /*!< DL0TX2RX (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_PLSR_DL0DIR_Pos               (15UL)         /*!< DL0DIR (Bit 15)                                       */
 #define R_DSILINK_PLSR_DL0DIR_Msk               (0x8000UL)     /*!< DL0DIR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_PLSR_CLULPENT_Pos             (24UL)         /*!< CLULPENT (Bit 24)                                     */
 #define R_DSILINK_PLSR_CLULPENT_Msk             (0x1000000UL)  /*!< CLULPENT (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_PLSR_CLULPEXT_Pos             (25UL)         /*!< CLULPEXT (Bit 25)                                     */
 #define R_DSILINK_PLSR_CLULPEXT_Msk             (0x2000000UL)  /*!< CLULPEXT (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_PLSR_CLLP2HS_Pos              (26UL)         /*!< CLLP2HS (Bit 26)                                      */
 #define R_DSILINK_PLSR_CLLP2HS_Msk              (0x4000000UL)  /*!< CLLP2HS (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_PLSR_CLHS2LP_Pos              (27UL)         /*!< CLHS2LP (Bit 27)                                      */
 #define R_DSILINK_PLSR_CLHS2LP_Msk              (0x8000000UL)  /*!< CLHS2LP (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_PLSR_DLULPENT_Pos             (28UL)         /*!< DLULPENT (Bit 28)                                     */
 #define R_DSILINK_PLSR_DLULPENT_Msk             (0x10000000UL) /*!< DLULPENT (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_PLSR_DLULPEXT_Pos             (29UL)         /*!< DLULPEXT (Bit 29)                                     */
 #define R_DSILINK_PLSR_DLULPEXT_Msk             (0x20000000UL) /*!< DLULPEXT (Bitfield-Mask: 0x01)                        */
/* =========================================================  PLSCR  ========================================================= */
 #define R_DSILINK_PLSCR_DL0RX2TX_Pos            (12UL)         /*!< DL0RX2TX (Bit 12)                                     */
 #define R_DSILINK_PLSCR_DL0RX2TX_Msk            (0x1000UL)     /*!< DL0RX2TX (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_PLSCR_DL0TX2RX_Pos            (13UL)         /*!< DL0TX2RX (Bit 13)                                     */
 #define R_DSILINK_PLSCR_DL0TX2RX_Msk            (0x2000UL)     /*!< DL0TX2RX (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_PLSCR_CLULPENT_Pos            (24UL)         /*!< CLULPENT (Bit 24)                                     */
 #define R_DSILINK_PLSCR_CLULPENT_Msk            (0x1000000UL)  /*!< CLULPENT (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_PLSCR_CLULPEXT_Pos            (25UL)         /*!< CLULPEXT (Bit 25)                                     */
 #define R_DSILINK_PLSCR_CLULPEXT_Msk            (0x2000000UL)  /*!< CLULPEXT (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_PLSCR_CLLP2HS_Pos             (26UL)         /*!< CLLP2HS (Bit 26)                                      */
 #define R_DSILINK_PLSCR_CLLP2HS_Msk             (0x4000000UL)  /*!< CLLP2HS (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_PLSCR_CLHS2LP_Pos             (27UL)         /*!< CLHS2LP (Bit 27)                                      */
 #define R_DSILINK_PLSCR_CLHS2LP_Msk             (0x8000000UL)  /*!< CLHS2LP (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_PLSCR_DLULPENT_Pos            (28UL)         /*!< DLULPENT (Bit 28)                                     */
 #define R_DSILINK_PLSCR_DLULPENT_Msk            (0x10000000UL) /*!< DLULPENT (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_PLSCR_DLULPEXT_Pos            (29UL)         /*!< DLULPEXT (Bit 29)                                     */
 #define R_DSILINK_PLSCR_DLULPEXT_Msk            (0x20000000UL) /*!< DLULPEXT (Bitfield-Mask: 0x01)                        */
/* =========================================================  PLIER  ========================================================= */
 #define R_DSILINK_PLIER_DL0RX2TX_Pos            (12UL)         /*!< DL0RX2TX (Bit 12)                                     */
 #define R_DSILINK_PLIER_DL0RX2TX_Msk            (0x1000UL)     /*!< DL0RX2TX (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_PLIER_DL0TX2RX_Pos            (13UL)         /*!< DL0TX2RX (Bit 13)                                     */
 #define R_DSILINK_PLIER_DL0TX2RX_Msk            (0x2000UL)     /*!< DL0TX2RX (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_PLIER_CLULPENT_Pos            (24UL)         /*!< CLULPENT (Bit 24)                                     */
 #define R_DSILINK_PLIER_CLULPENT_Msk            (0x1000000UL)  /*!< CLULPENT (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_PLIER_CLULPEXT_Pos            (25UL)         /*!< CLULPEXT (Bit 25)                                     */
 #define R_DSILINK_PLIER_CLULPEXT_Msk            (0x2000000UL)  /*!< CLULPEXT (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_PLIER_CLLP2HS_Pos             (26UL)         /*!< CLLP2HS (Bit 26)                                      */
 #define R_DSILINK_PLIER_CLLP2HS_Msk             (0x4000000UL)  /*!< CLLP2HS (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_PLIER_CLHS2LP_Pos             (27UL)         /*!< CLHS2LP (Bit 27)                                      */
 #define R_DSILINK_PLIER_CLHS2LP_Msk             (0x8000000UL)  /*!< CLHS2LP (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_PLIER_DLULPENT_Pos            (28UL)         /*!< DLULPENT (Bit 28)                                     */
 #define R_DSILINK_PLIER_DLULPENT_Msk            (0x10000000UL) /*!< DLULPENT (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_PLIER_DLULPEXT_Pos            (29UL)         /*!< DLULPEXT (Bit 29)                                     */
 #define R_DSILINK_PLIER_DLULPEXT_Msk            (0x20000000UL) /*!< DLULPEXT (Bitfield-Mask: 0x01)                        */
/* ========================================================  VMSET0R  ======================================================== */
 #define R_DSILINK_VMSET0R_VSTART_Pos            (0UL)          /*!< VSTART (Bit 0)                                        */
 #define R_DSILINK_VMSET0R_VSTART_Msk            (0x1UL)        /*!< VSTART (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_VMSET0R_VSTOP_Pos             (1UL)          /*!< VSTOP (Bit 1)                                         */
 #define R_DSILINK_VMSET0R_VSTOP_Msk             (0x2UL)        /*!< VSTOP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_VMSET0R_HSANOLP_Pos           (8UL)          /*!< HSANOLP (Bit 8)                                       */
 #define R_DSILINK_VMSET0R_HSANOLP_Msk           (0x100UL)      /*!< HSANOLP (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_VMSET0R_HBPNOLP_Pos           (9UL)          /*!< HBPNOLP (Bit 9)                                       */
 #define R_DSILINK_VMSET0R_HBPNOLP_Msk           (0x200UL)      /*!< HBPNOLP (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_VMSET0R_HFPNOLP_Pos           (10UL)         /*!< HFPNOLP (Bit 10)                                      */
 #define R_DSILINK_VMSET0R_HFPNOLP_Msk           (0x400UL)      /*!< HFPNOLP (Bitfield-Mask: 0x01)                         */
/* ========================================================  VMSET1R  ======================================================== */
 #define R_DSILINK_VMSET1R_DLY_Pos               (2UL)          /*!< DLY (Bit 2)                                           */
 #define R_DSILINK_VMSET1R_DLY_Msk               (0x3ffcUL)     /*!< DLY (Bitfield-Mask: 0xfff)                            */
/* =========================================================  VMSR  ========================================================== */
 #define R_DSILINK_VMSR_START_Pos                (0UL)          /*!< START (Bit 0)                                         */
 #define R_DSILINK_VMSR_START_Msk                (0x1UL)        /*!< START (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_VMSR_STOP_Pos                 (1UL)          /*!< STOP (Bit 1)                                          */
 #define R_DSILINK_VMSR_STOP_Msk                 (0x2UL)        /*!< STOP (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_VMSR_RUNNING_Pos              (2UL)          /*!< RUNNING (Bit 2)                                       */
 #define R_DSILINK_VMSR_RUNNING_Msk              (0x4UL)        /*!< RUNNING (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_VMSR_VIRDY_Pos                (3UL)          /*!< VIRDY (Bit 3)                                         */
 #define R_DSILINK_VMSR_VIRDY_Msk                (0x8UL)        /*!< VIRDY (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_VMSR_TIMERR_Pos               (20UL)         /*!< TIMERR (Bit 20)                                       */
 #define R_DSILINK_VMSR_TIMERR_Msk               (0x100000UL)   /*!< TIMERR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_VMSR_VBUFUDF_Pos              (22UL)         /*!< VBUFUDF (Bit 22)                                      */
 #define R_DSILINK_VMSR_VBUFUDF_Msk              (0x400000UL)   /*!< VBUFUDF (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_VMSR_VBUFOVF_Pos              (23UL)         /*!< VBUFOVF (Bit 23)                                      */
 #define R_DSILINK_VMSR_VBUFOVF_Msk              (0x800000UL)   /*!< VBUFOVF (Bitfield-Mask: 0x01)                         */
/* =========================================================  VMSCR  ========================================================= */
 #define R_DSILINK_VMSCR_START_Pos               (0UL)          /*!< START (Bit 0)                                         */
 #define R_DSILINK_VMSCR_START_Msk               (0x1UL)        /*!< START (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_VMSCR_STOP_Pos                (1UL)          /*!< STOP (Bit 1)                                          */
 #define R_DSILINK_VMSCR_STOP_Msk                (0x2UL)        /*!< STOP (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_VMSCR_VIRDY_Pos               (3UL)          /*!< VIRDY (Bit 3)                                         */
 #define R_DSILINK_VMSCR_VIRDY_Msk               (0x8UL)        /*!< VIRDY (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_VMSCR_TIMERR_Pos              (20UL)         /*!< TIMERR (Bit 20)                                       */
 #define R_DSILINK_VMSCR_TIMERR_Msk              (0x100000UL)   /*!< TIMERR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_VMSCR_VBUFUDF_Pos             (22UL)         /*!< VBUFUDF (Bit 22)                                      */
 #define R_DSILINK_VMSCR_VBUFUDF_Msk             (0x400000UL)   /*!< VBUFUDF (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_VMSCR_VBUFOVF_Pos             (23UL)         /*!< VBUFOVF (Bit 23)                                      */
 #define R_DSILINK_VMSCR_VBUFOVF_Msk             (0x800000UL)   /*!< VBUFOVF (Bitfield-Mask: 0x01)                         */
/* =========================================================  VMIER  ========================================================= */
 #define R_DSILINK_VMIER_START_Pos               (0UL)          /*!< START (Bit 0)                                         */
 #define R_DSILINK_VMIER_START_Msk               (0x1UL)        /*!< START (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_VMIER_STOP_Pos                (1UL)          /*!< STOP (Bit 1)                                          */
 #define R_DSILINK_VMIER_STOP_Msk                (0x2UL)        /*!< STOP (Bitfield-Mask: 0x01)                            */
 #define R_DSILINK_VMIER_VIRDY_Pos               (3UL)          /*!< VIRDY (Bit 3)                                         */
 #define R_DSILINK_VMIER_VIRDY_Msk               (0x8UL)        /*!< VIRDY (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_VMIER_TIMERR_Pos              (20UL)         /*!< TIMERR (Bit 20)                                       */
 #define R_DSILINK_VMIER_TIMERR_Msk              (0x100000UL)   /*!< TIMERR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_VMIER_VBUFUDF_Pos             (22UL)         /*!< VBUFUDF (Bit 22)                                      */
 #define R_DSILINK_VMIER_VBUFUDF_Msk             (0x400000UL)   /*!< VBUFUDF (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_VMIER_VBUFOVF_Pos             (23UL)         /*!< VBUFOVF (Bit 23)                                      */
 #define R_DSILINK_VMIER_VBUFOVF_Msk             (0x800000UL)   /*!< VBUFOVF (Bitfield-Mask: 0x01)                         */
/* =======================================================  VMPPSETR  ======================================================== */
 #define R_DSILINK_VMPPSETR_TXESYNC_Pos          (15UL)         /*!< TXESYNC (Bit 15)                                      */
 #define R_DSILINK_VMPPSETR_TXESYNC_Msk          (0x8000UL)     /*!< TXESYNC (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_VMPPSETR_DT_Pos               (16UL)         /*!< DT (Bit 16)                                           */
 #define R_DSILINK_VMPPSETR_DT_Msk               (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_DSILINK_VMPPSETR_VC_Pos               (22UL)         /*!< VC (Bit 22)                                           */
 #define R_DSILINK_VMPPSETR_VC_Msk               (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
/* =======================================================  VMVSSETR  ======================================================== */
 #define R_DSILINK_VMVSSETR_VSA_Pos              (0UL)          /*!< VSA (Bit 0)                                           */
 #define R_DSILINK_VMVSSETR_VSA_Msk              (0xfffUL)      /*!< VSA (Bitfield-Mask: 0xfff)                            */
 #define R_DSILINK_VMVSSETR_VSPOL_Pos            (15UL)         /*!< VSPOL (Bit 15)                                        */
 #define R_DSILINK_VMVSSETR_VSPOL_Msk            (0x8000UL)     /*!< VSPOL (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_VMVSSETR_VACT_Pos             (16UL)         /*!< VACT (Bit 16)                                         */
 #define R_DSILINK_VMVSSETR_VACT_Msk             (0x7fff0000UL) /*!< VACT (Bitfield-Mask: 0x7fff)                          */
/* =======================================================  VMVPSETR  ======================================================== */
 #define R_DSILINK_VMVPSETR_VBP_Pos              (0UL)          /*!< VBP (Bit 0)                                           */
 #define R_DSILINK_VMVPSETR_VBP_Msk              (0x1fffUL)     /*!< VBP (Bitfield-Mask: 0x1fff)                           */
 #define R_DSILINK_VMVPSETR_VFP_Pos              (16UL)         /*!< VFP (Bit 16)                                          */
 #define R_DSILINK_VMVPSETR_VFP_Msk              (0x1fff0000UL) /*!< VFP (Bitfield-Mask: 0x1fff)                           */
/* =======================================================  VMHSSETR  ======================================================== */
 #define R_DSILINK_VMHSSETR_HSA_Pos              (0UL)          /*!< HSA (Bit 0)                                           */
 #define R_DSILINK_VMHSSETR_HSA_Msk              (0xfffUL)      /*!< HSA (Bitfield-Mask: 0xfff)                            */
 #define R_DSILINK_VMHSSETR_HSPOL_Pos            (15UL)         /*!< HSPOL (Bit 15)                                        */
 #define R_DSILINK_VMHSSETR_HSPOL_Msk            (0x8000UL)     /*!< HSPOL (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_VMHSSETR_HACT_Pos             (16UL)         /*!< HACT (Bit 16)                                         */
 #define R_DSILINK_VMHSSETR_HACT_Msk             (0x7fff0000UL) /*!< HACT (Bitfield-Mask: 0x7fff)                          */
/* =======================================================  VMHPSETR  ======================================================== */
 #define R_DSILINK_VMHPSETR_HBP_Pos              (0UL)          /*!< HBP (Bit 0)                                           */
 #define R_DSILINK_VMHPSETR_HBP_Msk              (0x1fffUL)     /*!< HBP (Bitfield-Mask: 0x1fff)                           */
 #define R_DSILINK_VMHPSETR_HFP_Pos              (16UL)         /*!< HFP (Bit 16)                                          */
 #define R_DSILINK_VMHPSETR_HFP_Msk              (0x1fff0000UL) /*!< HFP (Bitfield-Mask: 0x1fff)                           */
/* ======================================================  SQCH0SET0R  ======================================================= */
 #define R_DSILINK_SQCH0SET0R_START_Pos          (0UL)          /*!< START (Bit 0)                                         */
 #define R_DSILINK_SQCH0SET0R_START_Msk          (0x1UL)        /*!< START (Bitfield-Mask: 0x01)                           */
/* ========================================================  SQCH0SR  ======================================================== */
 #define R_DSILINK_SQCH0SR_RUNNING_Pos           (2UL)          /*!< RUNNING (Bit 2)                                       */
 #define R_DSILINK_SQCH0SR_RUNNING_Msk           (0x4UL)        /*!< RUNNING (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_SQCH0SR_AACTFIN_Pos           (4UL)          /*!< AACTFIN (Bit 4)                                       */
 #define R_DSILINK_SQCH0SR_AACTFIN_Msk           (0x10UL)       /*!< AACTFIN (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_SQCH0SR_ADESFIN_Pos           (8UL)          /*!< ADESFIN (Bit 8)                                       */
 #define R_DSILINK_SQCH0SR_ADESFIN_Msk           (0x100UL)      /*!< ADESFIN (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_SQCH0SR_DABORT_Pos            (16UL)         /*!< DABORT (Bit 16)                                       */
 #define R_DSILINK_SQCH0SR_DABORT_Msk            (0x10000UL)    /*!< DABORT (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_SQCH0SR_SIZEERR_Pos           (19UL)         /*!< SIZEERR (Bit 19)                                      */
 #define R_DSILINK_SQCH0SR_SIZEERR_Msk           (0x80000UL)    /*!< SIZEERR (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_SQCH0SR_TXIBERR_Pos           (24UL)         /*!< TXIBERR (Bit 24)                                      */
 #define R_DSILINK_SQCH0SR_TXIBERR_Msk           (0x1000000UL)  /*!< TXIBERR (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_SQCH0SR_RXFERR_Pos            (26UL)         /*!< RXFERR (Bit 26)                                       */
 #define R_DSILINK_SQCH0SR_RXFERR_Msk            (0x4000000UL)  /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_SQCH0SR_RXFAIL_Pos            (27UL)         /*!< RXFAIL (Bit 27)                                       */
 #define R_DSILINK_SQCH0SR_RXFAIL_Msk            (0x8000000UL)  /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_SQCH0SR_RXPFAIL_Pos           (28UL)         /*!< RXPFAIL (Bit 28)                                      */
 #define R_DSILINK_SQCH0SR_RXPFAIL_Msk           (0x10000000UL) /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_SQCH0SR_RXCORERR_Pos          (29UL)         /*!< RXCORERR (Bit 29)                                     */
 #define R_DSILINK_SQCH0SR_RXCORERR_Msk          (0x20000000UL) /*!< RXCORERR (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_SQCH0SR_RXAKE_Pos             (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_DSILINK_SQCH0SR_RXAKE_Msk             (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
/* =======================================================  SQCH0SCR  ======================================================== */
 #define R_DSILINK_SQCH0SCR_AACTFIN_Pos          (4UL)          /*!< AACTFIN (Bit 4)                                       */
 #define R_DSILINK_SQCH0SCR_AACTFIN_Msk          (0x10UL)       /*!< AACTFIN (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_SQCH0SCR_ADESFIN_Pos          (8UL)          /*!< ADESFIN (Bit 8)                                       */
 #define R_DSILINK_SQCH0SCR_ADESFIN_Msk          (0x100UL)      /*!< ADESFIN (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_SQCH0SCR_DABORT_Pos           (16UL)         /*!< DABORT (Bit 16)                                       */
 #define R_DSILINK_SQCH0SCR_DABORT_Msk           (0x10000UL)    /*!< DABORT (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_SQCH0SCR_SIZEERR_Pos          (19UL)         /*!< SIZEERR (Bit 19)                                      */
 #define R_DSILINK_SQCH0SCR_SIZEERR_Msk          (0x80000UL)    /*!< SIZEERR (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_SQCH0SCR_TXIBERR_Pos          (24UL)         /*!< TXIBERR (Bit 24)                                      */
 #define R_DSILINK_SQCH0SCR_TXIBERR_Msk          (0x1000000UL)  /*!< TXIBERR (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_SQCH0SCR_RXFERR_Pos           (26UL)         /*!< RXFERR (Bit 26)                                       */
 #define R_DSILINK_SQCH0SCR_RXFERR_Msk           (0x4000000UL)  /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_SQCH0SCR_RXFAIL_Pos           (27UL)         /*!< RXFAIL (Bit 27)                                       */
 #define R_DSILINK_SQCH0SCR_RXFAIL_Msk           (0x8000000UL)  /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_SQCH0SCR_RXPFAIL_Pos          (28UL)         /*!< RXPFAIL (Bit 28)                                      */
 #define R_DSILINK_SQCH0SCR_RXPFAIL_Msk          (0x10000000UL) /*!< RXPFAIL (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_SQCH0SCR_RXCORERR_Pos         (29UL)         /*!< RXCORERR (Bit 29)                                     */
 #define R_DSILINK_SQCH0SCR_RXCORERR_Msk         (0x20000000UL) /*!< RXCORERR (Bitfield-Mask: 0x01)                        */
 #define R_DSILINK_SQCH0SCR_RXAKE_Pos            (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_DSILINK_SQCH0SCR_RXAKE_Msk            (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
/* =======================================================  SQCH0IER  ======================================================== */
 #define R_DSILINK_SQCH0IER_AACTFIN_Pos          (4UL)          /*!< AACTFIN (Bit 4)                                       */
 #define R_DSILINK_SQCH0IER_AACTFIN_Msk          (0x10UL)       /*!< AACTFIN (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_SQCH0IER_ADESFIN_Pos          (8UL)          /*!< ADESFIN (Bit 8)                                       */
 #define R_DSILINK_SQCH0IER_ADESFIN_Msk          (0x100UL)      /*!< ADESFIN (Bitfield-Mask: 0x01)                         */
 #define R_DSILINK_SQCH0IER_DABORT_Pos           (16UL)         /*!< DABORT (Bit 16)                                       */
 #define R_DSILINK_SQCH0IER_DABORT_Msk           (0x10000UL)    /*!< DABORT (Bitfield-Mask: 0x01)                          */
