RT-Thread/rt-thread/bsp/renesas/ra8d1-vision-board/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8D1BH.h
 #define R_DSILINK_SQCH0DSC3CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC3CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_SQCH0DSC3CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_DSILINK_SQCH0DSC3CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_SQCH0DSC3CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_DSILINK_SQCH0DSC3CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH0DSC4CR  ====================================================== */
 #define R_DSILINK_SQCH0DSC4CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC4CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_SQCH0DSC4CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_DSILINK_SQCH0DSC4CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_SQCH0DSC4CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_DSILINK_SQCH0DSC4CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH0DSC5CR  ====================================================== */
 #define R_DSILINK_SQCH0DSC5CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC5CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_SQCH0DSC5CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_DSILINK_SQCH0DSC5CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_SQCH0DSC5CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_DSILINK_SQCH0DSC5CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH0DSC6CR  ====================================================== */
 #define R_DSILINK_SQCH0DSC6CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC6CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_SQCH0DSC6CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_DSILINK_SQCH0DSC6CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_SQCH0DSC6CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_DSILINK_SQCH0DSC6CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH0DSC7CR  ====================================================== */
 #define R_DSILINK_SQCH0DSC7CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC7CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_DSILINK_SQCH0DSC7CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_DSILINK_SQCH0DSC7CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_SQCH0DSC7CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_DSILINK_SQCH0DSC7CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC0CR_L  ===================================================== */
 #define R_DSILINK_SQCH0DSC0CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC0CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC1CR_L  ===================================================== */
 #define R_DSILINK_SQCH0DSC1CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC1CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC2CR_L  ===================================================== */
 #define R_DSILINK_SQCH0DSC2CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC2CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC3CR_L  ===================================================== */
 #define R_DSILINK_SQCH0DSC3CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC3CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC4CR_L  ===================================================== */
 #define R_DSILINK_SQCH0DSC4CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC4CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC5CR_L  ===================================================== */
 #define R_DSILINK_SQCH0DSC5CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC5CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC6CR_L  ===================================================== */
 #define R_DSILINK_SQCH0DSC6CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC6CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC7CR_L  ===================================================== */
 #define R_DSILINK_SQCH0DSC7CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC7CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC0CR_LL  ===================================================== */
 #define R_DSILINK_SQCH0DSC0CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC0CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC1CR_LL  ===================================================== */
 #define R_DSILINK_SQCH0DSC1CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC1CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC2CR_LL  ===================================================== */
 #define R_DSILINK_SQCH0DSC2CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC2CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC3CR_LL  ===================================================== */
 #define R_DSILINK_SQCH0DSC3CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC3CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC4CR_LL  ===================================================== */
 #define R_DSILINK_SQCH0DSC4CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC4CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC5CR_LL  ===================================================== */
 #define R_DSILINK_SQCH0DSC5CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC5CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC6CR_LL  ===================================================== */
 #define R_DSILINK_SQCH0DSC6CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC6CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC7CR_LL  ===================================================== */
 #define R_DSILINK_SQCH0DSC7CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_DSILINK_SQCH0DSC7CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC0CR_H  ===================================================== */
 #define R_DSILINK_SQCH0DSC0CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC0CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_SQCH0DSC0CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_DSILINK_SQCH0DSC0CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC1CR_H  ===================================================== */
 #define R_DSILINK_SQCH0DSC1CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC1CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_SQCH0DSC1CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_DSILINK_SQCH0DSC1CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC2CR_H  ===================================================== */
 #define R_DSILINK_SQCH0DSC2CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC2CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_SQCH0DSC2CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_DSILINK_SQCH0DSC2CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC3CR_H  ===================================================== */
 #define R_DSILINK_SQCH0DSC3CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC3CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_SQCH0DSC3CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_DSILINK_SQCH0DSC3CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC4CR_H  ===================================================== */
 #define R_DSILINK_SQCH0DSC4CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC4CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_SQCH0DSC4CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_DSILINK_SQCH0DSC4CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC5CR_H  ===================================================== */
 #define R_DSILINK_SQCH0DSC5CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC5CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_SQCH0DSC5CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_DSILINK_SQCH0DSC5CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC6CR_H  ===================================================== */
 #define R_DSILINK_SQCH0DSC6CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC6CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_SQCH0DSC6CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_DSILINK_SQCH0DSC6CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC7CR_H  ===================================================== */
 #define R_DSILINK_SQCH0DSC7CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC7CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_SQCH0DSC7CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_DSILINK_SQCH0DSC7CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC0CR_HL  ===================================================== */
 #define R_DSILINK_SQCH0DSC0CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC0CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC1CR_HL  ===================================================== */
 #define R_DSILINK_SQCH0DSC1CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC1CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC2CR_HL  ===================================================== */
 #define R_DSILINK_SQCH0DSC2CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC2CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC3CR_HL  ===================================================== */
 #define R_DSILINK_SQCH0DSC3CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC3CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC4CR_HL  ===================================================== */
 #define R_DSILINK_SQCH0DSC4CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC4CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC5CR_HL  ===================================================== */
 #define R_DSILINK_SQCH0DSC5CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC5CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC6CR_HL  ===================================================== */
 #define R_DSILINK_SQCH0DSC6CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC6CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC7CR_HL  ===================================================== */
 #define R_DSILINK_SQCH0DSC7CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH0DSC7CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC0CR_HH  ===================================================== */
 #define R_DSILINK_SQCH0DSC0CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH0DSC0CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC1CR_HH  ===================================================== */
 #define R_DSILINK_SQCH0DSC1CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH0DSC1CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC2CR_HH  ===================================================== */
 #define R_DSILINK_SQCH0DSC2CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH0DSC2CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC3CR_HH  ===================================================== */
 #define R_DSILINK_SQCH0DSC3CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH0DSC3CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC4CR_HH  ===================================================== */
 #define R_DSILINK_SQCH0DSC4CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH0DSC4CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC5CR_HH  ===================================================== */
 #define R_DSILINK_SQCH0DSC5CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH0DSC5CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC6CR_HH  ===================================================== */
 #define R_DSILINK_SQCH0DSC6CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH0DSC6CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC7CR_HH  ===================================================== */
 #define R_DSILINK_SQCH0DSC7CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH0DSC7CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH0DSC0DR  ====================================================== */
 #define R_DSILINK_SQCH0DSC0DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH0DSC0DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH0DSC1DR  ====================================================== */
 #define R_DSILINK_SQCH0DSC1DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH0DSC1DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH0DSC2DR  ====================================================== */
 #define R_DSILINK_SQCH0DSC2DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH0DSC2DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH0DSC3DR  ====================================================== */
 #define R_DSILINK_SQCH0DSC3DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH0DSC3DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH0DSC4DR  ====================================================== */
 #define R_DSILINK_SQCH0DSC4DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH0DSC4DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH0DSC5DR  ====================================================== */
 #define R_DSILINK_SQCH0DSC5DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH0DSC5DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
