RT-Thread/rt-thread/bsp/renesas/ra8d1-vision-board/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8D1BH.h
 #define R_DSILINK_SQCH1DSC7CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_DSILINK_SQCH1DSC7CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_DSILINK_SQCH1DSC7CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC0CR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC0CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH1DSC0CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC1CR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC1CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH1DSC1CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC2CR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC2CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH1DSC2CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC3CR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC3CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH1DSC3CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC4CR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC4CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH1DSC4CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC5CR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC5CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH1DSC5CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC6CR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC6CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH1DSC6CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC7CR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC7CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_DSILINK_SQCH1DSC7CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC0CR_HH  ===================================================== */
 #define R_DSILINK_SQCH1DSC0CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH1DSC0CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC1CR_HH  ===================================================== */
 #define R_DSILINK_SQCH1DSC1CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH1DSC1CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC2CR_HH  ===================================================== */
 #define R_DSILINK_SQCH1DSC2CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH1DSC2CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC3CR_HH  ===================================================== */
 #define R_DSILINK_SQCH1DSC3CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH1DSC3CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC4CR_HH  ===================================================== */
 #define R_DSILINK_SQCH1DSC4CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH1DSC4CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC5CR_HH  ===================================================== */
 #define R_DSILINK_SQCH1DSC5CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH1DSC5CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC6CR_HH  ===================================================== */
 #define R_DSILINK_SQCH1DSC6CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH1DSC6CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC7CR_HH  ===================================================== */
 #define R_DSILINK_SQCH1DSC7CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_DSILINK_SQCH1DSC7CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH1DSC0DR  ====================================================== */
 #define R_DSILINK_SQCH1DSC0DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC0DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH1DSC1DR  ====================================================== */
 #define R_DSILINK_SQCH1DSC1DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC1DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH1DSC2DR  ====================================================== */
 #define R_DSILINK_SQCH1DSC2DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC2DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH1DSC3DR  ====================================================== */
 #define R_DSILINK_SQCH1DSC3DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC3DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH1DSC4DR  ====================================================== */
 #define R_DSILINK_SQCH1DSC4DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC4DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH1DSC5DR  ====================================================== */
 #define R_DSILINK_SQCH1DSC5DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC5DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH1DSC6DR  ====================================================== */
 #define R_DSILINK_SQCH1DSC6DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC6DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH1DSC7DR  ====================================================== */
 #define R_DSILINK_SQCH1DSC7DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC7DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* =====================================================  SQCH1DSC0DR_L  ===================================================== */
 #define R_DSILINK_SQCH1DSC0DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC0DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH1DSC1DR_L  ===================================================== */
 #define R_DSILINK_SQCH1DSC1DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC1DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH1DSC2DR_L  ===================================================== */
 #define R_DSILINK_SQCH1DSC2DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC2DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH1DSC3DR_L  ===================================================== */
 #define R_DSILINK_SQCH1DSC3DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC3DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH1DSC4DR_L  ===================================================== */
 #define R_DSILINK_SQCH1DSC4DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC4DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH1DSC5DR_L  ===================================================== */
 #define R_DSILINK_SQCH1DSC5DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC5DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH1DSC6DR_L  ===================================================== */
 #define R_DSILINK_SQCH1DSC6DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC6DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH1DSC7DR_L  ===================================================== */
 #define R_DSILINK_SQCH1DSC7DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC7DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* ====================================================  SQCH1DSC0DR_LL  ===================================================== */
 #define R_DSILINK_SQCH1DSC0DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC0DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC1DR_LL  ===================================================== */
 #define R_DSILINK_SQCH1DSC1DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC1DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC2DR_LL  ===================================================== */
 #define R_DSILINK_SQCH1DSC2DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC2DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC3DR_LL  ===================================================== */
 #define R_DSILINK_SQCH1DSC3DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC3DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC4DR_LL  ===================================================== */
 #define R_DSILINK_SQCH1DSC4DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC4DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC5DR_LL  ===================================================== */
 #define R_DSILINK_SQCH1DSC5DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC5DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC6DR_LL  ===================================================== */
 #define R_DSILINK_SQCH1DSC6DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC6DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC7DR_LL  ===================================================== */
 #define R_DSILINK_SQCH1DSC7DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC7DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC0DR_LH  ===================================================== */
 #define R_DSILINK_SQCH1DSC0DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC0DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC1DR_LH  ===================================================== */
 #define R_DSILINK_SQCH1DSC1DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC1DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC2DR_LH  ===================================================== */
 #define R_DSILINK_SQCH1DSC2DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC2DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC3DR_LH  ===================================================== */
 #define R_DSILINK_SQCH1DSC3DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC3DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC4DR_LH  ===================================================== */
 #define R_DSILINK_SQCH1DSC4DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC4DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC5DR_LH  ===================================================== */
 #define R_DSILINK_SQCH1DSC5DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC5DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC6DR_LH  ===================================================== */
 #define R_DSILINK_SQCH1DSC6DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC6DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC7DR_LH  ===================================================== */
 #define R_DSILINK_SQCH1DSC7DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC7DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC0DR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC0DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC0DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC1DR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC1DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC1DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC2DR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC2DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC2DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC3DR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC3DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC3DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC4DR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC4DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC4DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC5DR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC5DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC5DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC6DR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC6DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC6DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC7DR_HL  ===================================================== */
 #define R_DSILINK_SQCH1DSC7DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC7DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC0DR_HH  ===================================================== */
 #define R_DSILINK_SQCH1DSC0DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC0DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC1DR_HH  ===================================================== */
 #define R_DSILINK_SQCH1DSC1DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC1DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC2DR_HH  ===================================================== */
 #define R_DSILINK_SQCH1DSC2DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC2DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC3DR_HH  ===================================================== */
 #define R_DSILINK_SQCH1DSC3DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC3DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC4DR_HH  ===================================================== */
 #define R_DSILINK_SQCH1DSC4DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_DSILINK_SQCH1DSC4DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC5DR_HH  ===================================================== */
 #define R_DSILINK_SQCH1DSC5DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
